1) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Mac/HS256.php:28    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getSignatureLength() : int
     {
-        return 256;
+        return 257;
     }
 }

2) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Mac/Hmac.php:15    [M] CastString

--- Original
+++ New
@@ @@
     public function hash(string $data, Key $key) : string
     {
         $this->checKey($key);
-        $signature = hash_hmac($this->getHashAlgorithm(), $data, (string) $key->get(-1), true);
+        $signature = hash_hmac($this->getHashAlgorithm(), $data, $key->get(-1), true);
         return mb_substr($signature, 0, intdiv($this->getSignatureLength(), 8), '8bit');
     }
     public function verify(string $data, Key $key, string $signature) : bool

3) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Mac/Hmac.php:17    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         $this->checKey($key);
         $signature = hash_hmac($this->getHashAlgorithm(), $data, (string) $key->get(-1), true);
-        return mb_substr($signature, 0, intdiv($this->getSignatureLength(), 8), '8bit');
+        return mb_substr($signature, 0, intdiv($this->getSignatureLength(), 7), '8bit');
     }
     public function verify(string $data, Key $key, string $signature) : bool
     {

4) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Mac/Hmac.php:17    [M] MBString

--- Original
+++ New
@@ @@
     {
         $this->checKey($key);
         $signature = hash_hmac($this->getHashAlgorithm(), $data, (string) $key->get(-1), true);
-        return mb_substr($signature, 0, intdiv($this->getSignatureLength(), 8), '8bit');
+        return substr($signature, 0, intdiv($this->getSignatureLength(), 8));
     }
     public function verify(string $data, Key $key, string $signature) : bool
     {

5) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Mac/Hmac.php:32    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     private function checKey(Key $key) : void
     {
         Assertion::eq($key->type(), 4, 'Invalid key. Must be of type symmetric');
-        Assertion::true($key->has(-1), 'Invalid key. The value of the key is missing');
+        
     }
 }

6) /home/florent/PhpstormProjects/cose-lib/src/Key/Key.php:40    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function __construct(array $data)
     {
-        Assertion::keyExists($data, self::TYPE, 'Invalid key: the type is not defined');
+        
         $this->data = $data;
     }
     /**

7) /home/florent/PhpstormProjects/cose-lib/src/Key/Key.php:93    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function get(int|string $key) : mixed
     {
-        Assertion::keyExists($this->data, $key, sprintf('The key has no data at index %d', $key));
+        
         return $this->data[$key];
     }
 }

8) /home/florent/PhpstormProjects/cose-lib/src/Key/OkpKey.php:39    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function __construct(array $data)
     {
         parent::__construct($data);
-        Assertion::eq($data[self::TYPE], self::TYPE_OKP, 'Invalid OKP key. The key type does not correspond to an OKP key');
+        
         Assertion::keyExists($data, self::DATA_CURVE, 'Invalid EC2 key. The curve is missing');
         Assertion::keyExists($data, self::DATA_X, 'Invalid OKP key. The x coordinate is missing');
         Assertion::inArray((int) $data[self::DATA_CURVE], self::SUPPORTED_CURVES, 'The curve is not supported');

9) /home/florent/PhpstormProjects/cose-lib/src/Key/OkpKey.php:44    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         parent::__construct($data);
         Assertion::eq($data[self::TYPE], self::TYPE_OKP, 'Invalid OKP key. The key type does not correspond to an OKP key');
-        Assertion::keyExists($data, self::DATA_CURVE, 'Invalid EC2 key. The curve is missing');
+        
         Assertion::keyExists($data, self::DATA_X, 'Invalid OKP key. The x coordinate is missing');
         Assertion::inArray((int) $data[self::DATA_CURVE], self::SUPPORTED_CURVES, 'The curve is not supported');
     }

10) /home/florent/PhpstormProjects/cose-lib/src/Key/OkpKey.php:45    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         parent::__construct($data);
         Assertion::eq($data[self::TYPE], self::TYPE_OKP, 'Invalid OKP key. The key type does not correspond to an OKP key');
         Assertion::keyExists($data, self::DATA_CURVE, 'Invalid EC2 key. The curve is missing');
-        Assertion::keyExists($data, self::DATA_X, 'Invalid OKP key. The x coordinate is missing');
+        
         Assertion::inArray((int) $data[self::DATA_CURVE], self::SUPPORTED_CURVES, 'The curve is not supported');
     }
     /**

11) /home/florent/PhpstormProjects/cose-lib/src/Key/OkpKey.php:46    [M] CastInt

--- Original
+++ New
@@ @@
         Assertion::eq($data[self::TYPE], self::TYPE_OKP, 'Invalid OKP key. The key type does not correspond to an OKP key');
         Assertion::keyExists($data, self::DATA_CURVE, 'Invalid EC2 key. The curve is missing');
         Assertion::keyExists($data, self::DATA_X, 'Invalid OKP key. The x coordinate is missing');
-        Assertion::inArray((int) $data[self::DATA_CURVE], self::SUPPORTED_CURVES, 'The curve is not supported');
+        Assertion::inArray($data[self::DATA_CURVE], self::SUPPORTED_CURVES, 'The curve is not supported');
     }
     /**
      * @param array<int|string, mixed> $data

12) /home/florent/PhpstormProjects/cose-lib/src/Key/OkpKey.php:46    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         Assertion::eq($data[self::TYPE], self::TYPE_OKP, 'Invalid OKP key. The key type does not correspond to an OKP key');
         Assertion::keyExists($data, self::DATA_CURVE, 'Invalid EC2 key. The curve is missing');
         Assertion::keyExists($data, self::DATA_X, 'Invalid OKP key. The x coordinate is missing');
-        Assertion::inArray((int) $data[self::DATA_CURVE], self::SUPPORTED_CURVES, 'The curve is not supported');
+        
     }
     /**
      * @param array<int|string, mixed> $data

13) /home/florent/PhpstormProjects/cose-lib/src/Key/SymmetricKey.php:19    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function __construct(array $data)
     {
         parent::__construct($data);
-        Assertion::eq($data[self::TYPE], self::TYPE_OCT, 'Invalid symmetric key. The key type does not correspond to a symmetric key');
+        
         Assertion::keyExists($data, self::DATA_K, 'Invalid symmetric key. The parameter "k" is missing');
     }
     /**

14) /home/florent/PhpstormProjects/cose-lib/src/Key/SymmetricKey.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         parent::__construct($data);
         Assertion::eq($data[self::TYPE], self::TYPE_OCT, 'Invalid symmetric key. The key type does not correspond to a symmetric key');
-        Assertion::keyExists($data, self::DATA_K, 'Invalid symmetric key. The parameter "k" is missing');
+        
     }
     /**
      * @param array<int|string, mixed> $data


Timed Out mutants:
==================

1) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Mac/HS256Truncated64.php:11    [M] PublicVisibility

--- Original
+++ New
@@ @@
 final class HS256Truncated64 extends Hmac
 {
     public const ID = 4;
-    public static function create() : self
+    protected static function create() : self
     {
         return new self();
     }

2) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Mac/HS256Truncated64.php:28    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getSignatureLength() : int
     {
-        return 64;
+        return 63;
     }
 }

3) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Mac/HS256Truncated64.php:28    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getSignatureLength() : int
     {
-        return 64;
+        return 65;
     }
 }

4) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Mac/HS256Truncated64.php:28    [M] IntegerNegation

--- Original
+++ New
@@ @@
     }
     protected function getSignatureLength() : int
     {
-        return 64;
+        return -64;
     }
 }

5) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Mac/HS384.php:11    [M] PublicVisibility

--- Original
+++ New
@@ @@
 final class HS384 extends Hmac
 {
     public const ID = 6;
-    public static function create() : self
+    protected static function create() : self
     {
         return new self();
     }

6) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Mac/HS384.php:28    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getSignatureLength() : int
     {
-        return 384;
+        return 383;
     }
 }

7) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Mac/HS384.php:28    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getSignatureLength() : int
     {
-        return 384;
+        return 385;
     }
 }

8) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Mac/HS384.php:28    [M] IntegerNegation

--- Original
+++ New
@@ @@
     }
     protected function getSignatureLength() : int
     {
-        return 384;
+        return -384;
     }
 }

9) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Mac/HS512.php:11    [M] PublicVisibility

--- Original
+++ New
@@ @@
 final class HS512 extends Hmac
 {
     public const ID = 7;
-    public static function create() : self
+    protected static function create() : self
     {
         return new self();
     }

10) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Mac/HS512.php:28    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getSignatureLength() : int
     {
-        return 512;
+        return 511;
     }
 }

11) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Mac/HS512.php:28    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getSignatureLength() : int
     {
-        return 512;
+        return 513;
     }
 }

12) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Mac/HS512.php:28    [M] IntegerNegation

--- Original
+++ New
@@ @@
     }
     protected function getSignatureLength() : int
     {
-        return 512;
+        return -512;
     }
 }

13) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Manager.php:17    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @var array<int, Algorithm>
      */
     private array $algorithms = [];
-    public static function create() : self
+    protected static function create() : self
     {
         return new self();
     }

14) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Manager.php:22    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return new self();
     }
-    public function add(Algorithm ...$algorithms) : self
+    protected function add(Algorithm ...$algorithms) : self
     {
         foreach ($algorithms as $algorithm) {
             $identifier = $algorithm::identifier();

15) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Manager.php:24    [M] Foreach_

--- Original
+++ New
@@ @@
     }
     public function add(Algorithm ...$algorithms) : self
     {
-        foreach ($algorithms as $algorithm) {
+        foreach (array() as $algorithm) {
             $identifier = $algorithm::identifier();
             $this->algorithms[$identifier] = $algorithm;
         }

16) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Manager.php:35    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @return iterable<int>
      */
-    public function list() : iterable
+    protected function list() : iterable
     {
         yield from array_keys($this->algorithms);
     }

17) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Manager.php:37    [M] UnwrapArrayKeys

--- Original
+++ New
@@ @@
      */
     public function list() : iterable
     {
-        yield from array_keys($this->algorithms);
+        yield from $this->algorithms;
     }
     /**
      * @return iterable<int, Algorithm>

18) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Manager.php:43    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @return iterable<int, Algorithm>
      */
-    public function all() : iterable
+    protected function all() : iterable
     {
         yield from $this->algorithms;
     }

19) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Manager.php:48    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         yield from $this->algorithms;
     }
-    public function has(int $identifier) : bool
+    protected function has(int $identifier) : bool
     {
         return array_key_exists($identifier, $this->algorithms);
     }

20) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Manager.php:53    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return array_key_exists($identifier, $this->algorithms);
     }
-    public function get(int $identifier) : Algorithm
+    protected function get(int $identifier) : Algorithm
     {
         Assertion::true($this->has($identifier), 'Unsupported algorithm');
         return $this->algorithms[$identifier];
     }
 }

21) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Manager.php:55    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function get(int $identifier) : Algorithm
     {
-        Assertion::true($this->has($identifier), 'Unsupported algorithm');
+        
         return $this->algorithms[$identifier];
     }
 }

23) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/ManagerFactory.php:21    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return new self();
     }
-    public function add(string $alias, Algorithm $algorithm) : self
+    protected function add(string $alias, Algorithm $algorithm) : self
     {
         $this->algorithms[$alias] = $algorithm;
         return $this;

27) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/ManagerFactory.php:44    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         yield from $this->algorithms;
     }
-    public function generate(string ...$aliases) : Manager
+    protected function generate(string ...$aliases) : Manager
     {
         $manager = Manager::create();
         foreach ($aliases as $alias) {

28) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/ManagerFactory.php:47    [M] Foreach_

--- Original
+++ New
@@ @@
     public function generate(string ...$aliases) : Manager
     {
         $manager = Manager::create();
-        foreach ($aliases as $alias) {
+        foreach (array() as $alias) {
             Assertion::keyExists($this->algorithms, $alias, sprintf('The algorithm with alias "%s" is not supported', $alias));
             $manager->add($this->algorithms[$alias]);
         }

29) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/ManagerFactory.php:48    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $manager = Manager::create();
         foreach ($aliases as $alias) {
-            Assertion::keyExists($this->algorithms, $alias, sprintf('The algorithm with alias "%s" is not supported', $alias));
+            
             $manager->add($this->algorithms[$alias]);
         }
         return $manager;
     }
 }

30) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/ManagerFactory.php:53    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $manager = Manager::create();
         foreach ($aliases as $alias) {
             Assertion::keyExists($this->algorithms, $alias, sprintf('The algorithm with alias "%s" is not supported', $alias));
-            $manager->add($this->algorithms[$alias]);
+            
         }
         return $manager;
     }
 }

31) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECDSA.php:19    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
     public function sign(string $data, Key $key) : string
     {
         $key = $this->handleKey($key);
-        openssl_sign($data, $signature, $key->asPEM(), $this->getHashAlgorithm());
+        
         return ECSignature::fromAsn1($signature, $this->getSignaturePartLength());
     }
     public function verify(string $data, Key $key, string $signature) : bool

32) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECDSA.php:30    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $key = $this->handleKey($key);
         $publicKey = $key->toPublic();
         $signature = ECSignature::toAsn1($signature, $this->getSignaturePartLength());
-        return openssl_verify($data, $signature, $publicKey->asPEM(), $this->getHashAlgorithm()) === 1;
+        return openssl_verify($data, $signature, $publicKey->asPEM(), $this->getHashAlgorithm()) === 2;
     }
     protected abstract function getCurve() : int;
     protected abstract function getHashAlgorithm() : int;

33) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECDSA.php:30    [M] Identical

--- Original
+++ New
@@ @@
         $key = $this->handleKey($key);
         $publicKey = $key->toPublic();
         $signature = ECSignature::toAsn1($signature, $this->getSignaturePartLength());
-        return openssl_verify($data, $signature, $publicKey->asPEM(), $this->getHashAlgorithm()) === 1;
+        return openssl_verify($data, $signature, $publicKey->asPEM(), $this->getHashAlgorithm()) !== 1;
     }
     protected abstract function getCurve() : int;
     protected abstract function getHashAlgorithm() : int;

34) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECDSA.php:42    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     private function handleKey(Key $key) : Ec2Key
     {
         $key = Ec2Key::create($key->getData());
-        Assertion::eq($key->curve(), $this->getCurve(), 'This key cannot be used with this algorithm');
+        
         return $key;
     }
 }

35) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:36    [M] PublicVisibility

--- Original
+++ New
@@ @@
     private const ASN1_BIG_INTEGER_LIMIT = '7f';
     private const ASN1_NEGATIVE_INTEGER = '00';
     private const BYTE_SIZE = 2;
-    public static function toAsn1(string $signature, int $length) : string
+    protected static function toAsn1(string $signature, int $length) : string
     {
         $signature = bin2hex($signature);
         if (self::octetLength($signature) !== $length) {

36) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:40    [M] NotIdentical

--- Original
+++ New
@@ @@
     public static function toAsn1(string $signature, int $length) : string
     {
         $signature = bin2hex($signature);
-        if (self::octetLength($signature) !== $length) {
+        if (self::octetLength($signature) === $length) {
             throw new InvalidArgumentException('Invalid signature length.');
         }
         $pointR = self::preparePositiveInteger(mb_substr($signature, 0, $length, '8bit'));

37) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:41    [M] Throw_

--- Original
+++ New
@@ @@
     {
         $signature = bin2hex($signature);
         if (self::octetLength($signature) !== $length) {
-            throw new InvalidArgumentException('Invalid signature length.');
+            new InvalidArgumentException('Invalid signature length.');
         }
         $pointR = self::preparePositiveInteger(mb_substr($signature, 0, $length, '8bit'));
         $pointS = self::preparePositiveInteger(mb_substr($signature, $length, null, '8bit'));

38) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:44    [M] DecrementInteger

--- Original
+++ New
@@ @@
         if (self::octetLength($signature) !== $length) {
             throw new InvalidArgumentException('Invalid signature length.');
         }
-        $pointR = self::preparePositiveInteger(mb_substr($signature, 0, $length, '8bit'));
+        $pointR = self::preparePositiveInteger(mb_substr($signature, -1, $length, '8bit'));
         $pointS = self::preparePositiveInteger(mb_substr($signature, $length, null, '8bit'));
         $lengthR = self::octetLength($pointR);
         $lengthS = self::octetLength($pointS);

39) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:44    [M] IncrementInteger

--- Original
+++ New
@@ @@
         if (self::octetLength($signature) !== $length) {
             throw new InvalidArgumentException('Invalid signature length.');
         }
-        $pointR = self::preparePositiveInteger(mb_substr($signature, 0, $length, '8bit'));
+        $pointR = self::preparePositiveInteger(mb_substr($signature, 1, $length, '8bit'));
         $pointS = self::preparePositiveInteger(mb_substr($signature, $length, null, '8bit'));
         $lengthR = self::octetLength($pointR);
         $lengthS = self::octetLength($pointS);

40) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:44    [M] MBString

--- Original
+++ New
@@ @@
         if (self::octetLength($signature) !== $length) {
             throw new InvalidArgumentException('Invalid signature length.');
         }
-        $pointR = self::preparePositiveInteger(mb_substr($signature, 0, $length, '8bit'));
+        $pointR = self::preparePositiveInteger(substr($signature, 0, $length));
         $pointS = self::preparePositiveInteger(mb_substr($signature, $length, null, '8bit'));
         $lengthR = self::octetLength($pointR);
         $lengthS = self::octetLength($pointS);

41) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:45    [M] MBString

--- Original
+++ New
@@ @@
             throw new InvalidArgumentException('Invalid signature length.');
         }
         $pointR = self::preparePositiveInteger(mb_substr($signature, 0, $length, '8bit'));
-        $pointS = self::preparePositiveInteger(mb_substr($signature, $length, null, '8bit'));
+        $pointS = self::preparePositiveInteger(substr($signature, $length, null));
         $lengthR = self::octetLength($pointR);
         $lengthS = self::octetLength($pointS);
         $totalLength = $lengthR + $lengthS + self::BYTE_SIZE + self::BYTE_SIZE;

42) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:50    [M] Plus

--- Original
+++ New
@@ @@
         $pointS = self::preparePositiveInteger(mb_substr($signature, $length, null, '8bit'));
         $lengthR = self::octetLength($pointR);
         $lengthS = self::octetLength($pointS);
-        $totalLength = $lengthR + $lengthS + self::BYTE_SIZE + self::BYTE_SIZE;
+        $totalLength = $lengthR - $lengthS + self::BYTE_SIZE + self::BYTE_SIZE;
         $lengthPrefix = $totalLength > self::ASN1_MAX_SINGLE_BYTE ? self::ASN1_LENGTH_2BYTES : '';
         return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . self::ASN1_INTEGER . dechex($lengthR) . $pointR . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
     }

43) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:50    [M] Plus

--- Original
+++ New
@@ @@
         $pointS = self::preparePositiveInteger(mb_substr($signature, $length, null, '8bit'));
         $lengthR = self::octetLength($pointR);
         $lengthS = self::octetLength($pointS);
-        $totalLength = $lengthR + $lengthS + self::BYTE_SIZE + self::BYTE_SIZE;
+        $totalLength = $lengthR + $lengthS - self::BYTE_SIZE + self::BYTE_SIZE;
         $lengthPrefix = $totalLength > self::ASN1_MAX_SINGLE_BYTE ? self::ASN1_LENGTH_2BYTES : '';
         return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . self::ASN1_INTEGER . dechex($lengthR) . $pointR . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
     }

44) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:50    [M] Plus

--- Original
+++ New
@@ @@
         $pointS = self::preparePositiveInteger(mb_substr($signature, $length, null, '8bit'));
         $lengthR = self::octetLength($pointR);
         $lengthS = self::octetLength($pointS);
-        $totalLength = $lengthR + $lengthS + self::BYTE_SIZE + self::BYTE_SIZE;
+        $totalLength = $lengthR + $lengthS + self::BYTE_SIZE - self::BYTE_SIZE;
         $lengthPrefix = $totalLength > self::ASN1_MAX_SINGLE_BYTE ? self::ASN1_LENGTH_2BYTES : '';
         return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . self::ASN1_INTEGER . dechex($lengthR) . $pointR . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
     }

45) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:51    [M] GreaterThan

--- Original
+++ New
@@ @@
         $lengthR = self::octetLength($pointR);
         $lengthS = self::octetLength($pointS);
         $totalLength = $lengthR + $lengthS + self::BYTE_SIZE + self::BYTE_SIZE;
-        $lengthPrefix = $totalLength > self::ASN1_MAX_SINGLE_BYTE ? self::ASN1_LENGTH_2BYTES : '';
+        $lengthPrefix = $totalLength >= self::ASN1_MAX_SINGLE_BYTE ? self::ASN1_LENGTH_2BYTES : '';
         return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . self::ASN1_INTEGER . dechex($lengthR) . $pointR . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
     }
     public static function fromAsn1(string $signature, int $length) : string

46) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:51    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
         $lengthR = self::octetLength($pointR);
         $lengthS = self::octetLength($pointS);
         $totalLength = $lengthR + $lengthS + self::BYTE_SIZE + self::BYTE_SIZE;
-        $lengthPrefix = $totalLength > self::ASN1_MAX_SINGLE_BYTE ? self::ASN1_LENGTH_2BYTES : '';
+        $lengthPrefix = $totalLength <= self::ASN1_MAX_SINGLE_BYTE ? self::ASN1_LENGTH_2BYTES : '';
         return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . self::ASN1_INTEGER . dechex($lengthR) . $pointR . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
     }
     public static function fromAsn1(string $signature, int $length) : string

47) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:51    [M] Ternary

--- Original
+++ New
@@ @@
         $lengthR = self::octetLength($pointR);
         $lengthS = self::octetLength($pointS);
         $totalLength = $lengthR + $lengthS + self::BYTE_SIZE + self::BYTE_SIZE;
-        $lengthPrefix = $totalLength > self::ASN1_MAX_SINGLE_BYTE ? self::ASN1_LENGTH_2BYTES : '';
+        $lengthPrefix = $totalLength > self::ASN1_MAX_SINGLE_BYTE ? '' : self::ASN1_LENGTH_2BYTES;
         return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . self::ASN1_INTEGER . dechex($lengthR) . $pointR . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
     }
     public static function fromAsn1(string $signature, int $length) : string

48) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:54    [M] Concat

--- Original
+++ New
@@ @@
         $lengthS = self::octetLength($pointS);
         $totalLength = $lengthR + $lengthS + self::BYTE_SIZE + self::BYTE_SIZE;
         $lengthPrefix = $totalLength > self::ASN1_MAX_SINGLE_BYTE ? self::ASN1_LENGTH_2BYTES : '';
-        return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . self::ASN1_INTEGER . dechex($lengthR) . $pointR . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
+        return hex2bin($lengthPrefix . self::ASN1_SEQUENCE . dechex($totalLength) . self::ASN1_INTEGER . dechex($lengthR) . $pointR . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
     }
     public static function fromAsn1(string $signature, int $length) : string
     {

49) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:54    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $lengthS = self::octetLength($pointS);
         $totalLength = $lengthR + $lengthS + self::BYTE_SIZE + self::BYTE_SIZE;
         $lengthPrefix = $totalLength > self::ASN1_MAX_SINGLE_BYTE ? self::ASN1_LENGTH_2BYTES : '';
-        return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . self::ASN1_INTEGER . dechex($lengthR) . $pointR . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
+        return hex2bin($lengthPrefix . dechex($totalLength) . self::ASN1_INTEGER . dechex($lengthR) . $pointR . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
     }
     public static function fromAsn1(string $signature, int $length) : string
     {

50) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:54    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $lengthS = self::octetLength($pointS);
         $totalLength = $lengthR + $lengthS + self::BYTE_SIZE + self::BYTE_SIZE;
         $lengthPrefix = $totalLength > self::ASN1_MAX_SINGLE_BYTE ? self::ASN1_LENGTH_2BYTES : '';
-        return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . self::ASN1_INTEGER . dechex($lengthR) . $pointR . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
+        return hex2bin(self::ASN1_SEQUENCE . dechex($totalLength) . self::ASN1_INTEGER . dechex($lengthR) . $pointR . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
     }
     public static function fromAsn1(string $signature, int $length) : string
     {
