51) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:54    [M] Concat

--- Original
+++ New
@@ @@
         $lengthS = self::octetLength($pointS);
         $totalLength = $lengthR + $lengthS + self::BYTE_SIZE + self::BYTE_SIZE;
         $lengthPrefix = $totalLength > self::ASN1_MAX_SINGLE_BYTE ? self::ASN1_LENGTH_2BYTES : '';
-        return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . self::ASN1_INTEGER . dechex($lengthR) . $pointR . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
+        return hex2bin(self::ASN1_SEQUENCE . dechex($totalLength) . $lengthPrefix . self::ASN1_INTEGER . dechex($lengthR) . $pointR . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
     }
     public static function fromAsn1(string $signature, int $length) : string
     {

52) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:54    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $lengthS = self::octetLength($pointS);
         $totalLength = $lengthR + $lengthS + self::BYTE_SIZE + self::BYTE_SIZE;
         $lengthPrefix = $totalLength > self::ASN1_MAX_SINGLE_BYTE ? self::ASN1_LENGTH_2BYTES : '';
-        return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . self::ASN1_INTEGER . dechex($lengthR) . $pointR . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
+        return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . self::ASN1_INTEGER . dechex($lengthR) . $pointR . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
     }
     public static function fromAsn1(string $signature, int $length) : string
     {

53) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:54    [M] Concat

--- Original
+++ New
@@ @@
         $lengthS = self::octetLength($pointS);
         $totalLength = $lengthR + $lengthS + self::BYTE_SIZE + self::BYTE_SIZE;
         $lengthPrefix = $totalLength > self::ASN1_MAX_SINGLE_BYTE ? self::ASN1_LENGTH_2BYTES : '';
-        return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . self::ASN1_INTEGER . dechex($lengthR) . $pointR . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
+        return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . self::ASN1_INTEGER . dechex($totalLength) . dechex($lengthR) . $pointR . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
     }
     public static function fromAsn1(string $signature, int $length) : string
     {

54) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:54    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $lengthS = self::octetLength($pointS);
         $totalLength = $lengthR + $lengthS + self::BYTE_SIZE + self::BYTE_SIZE;
         $lengthPrefix = $totalLength > self::ASN1_MAX_SINGLE_BYTE ? self::ASN1_LENGTH_2BYTES : '';
-        return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . self::ASN1_INTEGER . dechex($lengthR) . $pointR . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
+        return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . dechex($lengthR) . $pointR . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
     }
     public static function fromAsn1(string $signature, int $length) : string
     {

55) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:54    [M] Concat

--- Original
+++ New
@@ @@
         $lengthS = self::octetLength($pointS);
         $totalLength = $lengthR + $lengthS + self::BYTE_SIZE + self::BYTE_SIZE;
         $lengthPrefix = $totalLength > self::ASN1_MAX_SINGLE_BYTE ? self::ASN1_LENGTH_2BYTES : '';
-        return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . self::ASN1_INTEGER . dechex($lengthR) . $pointR . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
+        return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . dechex($lengthR) . self::ASN1_INTEGER . $pointR . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
     }
     public static function fromAsn1(string $signature, int $length) : string
     {

56) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:54    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $lengthS = self::octetLength($pointS);
         $totalLength = $lengthR + $lengthS + self::BYTE_SIZE + self::BYTE_SIZE;
         $lengthPrefix = $totalLength > self::ASN1_MAX_SINGLE_BYTE ? self::ASN1_LENGTH_2BYTES : '';
-        return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . self::ASN1_INTEGER . dechex($lengthR) . $pointR . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
+        return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . self::ASN1_INTEGER . $pointR . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
     }
     public static function fromAsn1(string $signature, int $length) : string
     {

57) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:54    [M] Concat

--- Original
+++ New
@@ @@
         $lengthS = self::octetLength($pointS);
         $totalLength = $lengthR + $lengthS + self::BYTE_SIZE + self::BYTE_SIZE;
         $lengthPrefix = $totalLength > self::ASN1_MAX_SINGLE_BYTE ? self::ASN1_LENGTH_2BYTES : '';
-        return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . self::ASN1_INTEGER . dechex($lengthR) . $pointR . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
+        return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . self::ASN1_INTEGER . $pointR . dechex($lengthR) . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
     }
     public static function fromAsn1(string $signature, int $length) : string
     {

58) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:54    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $lengthS = self::octetLength($pointS);
         $totalLength = $lengthR + $lengthS + self::BYTE_SIZE + self::BYTE_SIZE;
         $lengthPrefix = $totalLength > self::ASN1_MAX_SINGLE_BYTE ? self::ASN1_LENGTH_2BYTES : '';
-        return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . self::ASN1_INTEGER . dechex($lengthR) . $pointR . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
+        return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . self::ASN1_INTEGER . dechex($lengthR) . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
     }
     public static function fromAsn1(string $signature, int $length) : string
     {

59) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:54    [M] Concat

--- Original
+++ New
@@ @@
         $lengthS = self::octetLength($pointS);
         $totalLength = $lengthR + $lengthS + self::BYTE_SIZE + self::BYTE_SIZE;
         $lengthPrefix = $totalLength > self::ASN1_MAX_SINGLE_BYTE ? self::ASN1_LENGTH_2BYTES : '';
-        return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . self::ASN1_INTEGER . dechex($lengthR) . $pointR . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
+        return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . self::ASN1_INTEGER . dechex($lengthR) . self::ASN1_INTEGER . $pointR . dechex($lengthS) . $pointS);
     }
     public static function fromAsn1(string $signature, int $length) : string
     {

60) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:54    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $lengthS = self::octetLength($pointS);
         $totalLength = $lengthR + $lengthS + self::BYTE_SIZE + self::BYTE_SIZE;
         $lengthPrefix = $totalLength > self::ASN1_MAX_SINGLE_BYTE ? self::ASN1_LENGTH_2BYTES : '';
-        return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . self::ASN1_INTEGER . dechex($lengthR) . $pointR . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
+        return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . self::ASN1_INTEGER . dechex($lengthR) . $pointR . dechex($lengthS) . $pointS);
     }
     public static function fromAsn1(string $signature, int $length) : string
     {

61) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:54    [M] Concat

--- Original
+++ New
@@ @@
         $lengthS = self::octetLength($pointS);
         $totalLength = $lengthR + $lengthS + self::BYTE_SIZE + self::BYTE_SIZE;
         $lengthPrefix = $totalLength > self::ASN1_MAX_SINGLE_BYTE ? self::ASN1_LENGTH_2BYTES : '';
-        return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . self::ASN1_INTEGER . dechex($lengthR) . $pointR . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
+        return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . self::ASN1_INTEGER . dechex($lengthR) . $pointR . dechex($lengthS) . self::ASN1_INTEGER . $pointS);
     }
     public static function fromAsn1(string $signature, int $length) : string
     {

62) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:54    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $lengthS = self::octetLength($pointS);
         $totalLength = $lengthR + $lengthS + self::BYTE_SIZE + self::BYTE_SIZE;
         $lengthPrefix = $totalLength > self::ASN1_MAX_SINGLE_BYTE ? self::ASN1_LENGTH_2BYTES : '';
-        return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . self::ASN1_INTEGER . dechex($lengthR) . $pointR . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
+        return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . self::ASN1_INTEGER . dechex($lengthR) . $pointR . self::ASN1_INTEGER . $pointS);
     }
     public static function fromAsn1(string $signature, int $length) : string
     {

63) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:54    [M] Concat

--- Original
+++ New
@@ @@
         $lengthS = self::octetLength($pointS);
         $totalLength = $lengthR + $lengthS + self::BYTE_SIZE + self::BYTE_SIZE;
         $lengthPrefix = $totalLength > self::ASN1_MAX_SINGLE_BYTE ? self::ASN1_LENGTH_2BYTES : '';
-        return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . self::ASN1_INTEGER . dechex($lengthR) . $pointR . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
+        return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . self::ASN1_INTEGER . dechex($lengthR) . $pointR . self::ASN1_INTEGER . $pointS . dechex($lengthS));
     }
     public static function fromAsn1(string $signature, int $length) : string
     {

64) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:54    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $lengthS = self::octetLength($pointS);
         $totalLength = $lengthR + $lengthS + self::BYTE_SIZE + self::BYTE_SIZE;
         $lengthPrefix = $totalLength > self::ASN1_MAX_SINGLE_BYTE ? self::ASN1_LENGTH_2BYTES : '';
-        return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . self::ASN1_INTEGER . dechex($lengthR) . $pointR . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
+        return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . self::ASN1_INTEGER . dechex($lengthR) . $pointR . self::ASN1_INTEGER . dechex($lengthS));
     }
     public static function fromAsn1(string $signature, int $length) : string
     {

65) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:61    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $lengthPrefix = $totalLength > self::ASN1_MAX_SINGLE_BYTE ? self::ASN1_LENGTH_2BYTES : '';
         return hex2bin(self::ASN1_SEQUENCE . $lengthPrefix . dechex($totalLength) . self::ASN1_INTEGER . dechex($lengthR) . $pointR . self::ASN1_INTEGER . dechex($lengthS) . $pointS);
     }
-    public static function fromAsn1(string $signature, int $length) : string
+    protected static function fromAsn1(string $signature, int $length) : string
     {
         $message = bin2hex($signature);
         $position = 0;

66) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:64    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public static function fromAsn1(string $signature, int $length) : string
     {
         $message = bin2hex($signature);
-        $position = 0;
+        $position = -1;
         if (self::readAsn1Content($message, $position, self::BYTE_SIZE) !== self::ASN1_SEQUENCE) {
             throw new InvalidArgumentException('Invalid data. Should start with a sequence.');
         }

67) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:66    [M] NotIdentical

--- Original
+++ New
@@ @@
     {
         $message = bin2hex($signature);
         $position = 0;
-        if (self::readAsn1Content($message, $position, self::BYTE_SIZE) !== self::ASN1_SEQUENCE) {
+        if (self::readAsn1Content($message, $position, self::BYTE_SIZE) === self::ASN1_SEQUENCE) {
             throw new InvalidArgumentException('Invalid data. Should start with a sequence.');
         }
         // @phpstan-ignore-next-line

68) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:67    [M] Throw_

--- Original
+++ New
@@ @@
         $message = bin2hex($signature);
         $position = 0;
         if (self::readAsn1Content($message, $position, self::BYTE_SIZE) !== self::ASN1_SEQUENCE) {
-            throw new InvalidArgumentException('Invalid data. Should start with a sequence.');
+            new InvalidArgumentException('Invalid data. Should start with a sequence.');
         }
         // @phpstan-ignore-next-line
         if (self::readAsn1Content($message, $position, self::BYTE_SIZE) === self::ASN1_LENGTH_2BYTES) {

69) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:71    [M] Identical

--- Original
+++ New
@@ @@
             throw new InvalidArgumentException('Invalid data. Should start with a sequence.');
         }
         // @phpstan-ignore-next-line
-        if (self::readAsn1Content($message, $position, self::BYTE_SIZE) === self::ASN1_LENGTH_2BYTES) {
+        if (self::readAsn1Content($message, $position, self::BYTE_SIZE) !== self::ASN1_LENGTH_2BYTES) {
             $position += self::BYTE_SIZE;
         }
         $pointR = self::retrievePositiveInteger(self::readAsn1Integer($message, $position));

70) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:72    [M] Assignment

--- Original
+++ New
@@ @@
         }
         // @phpstan-ignore-next-line
         if (self::readAsn1Content($message, $position, self::BYTE_SIZE) === self::ASN1_LENGTH_2BYTES) {
-            $position += self::BYTE_SIZE;
+            $position = self::BYTE_SIZE;
         }
         $pointR = self::retrievePositiveInteger(self::readAsn1Integer($message, $position));
         $pointS = self::retrievePositiveInteger(self::readAsn1Integer($message, $position));

71) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:72    [M] PlusEqual

--- Original
+++ New
@@ @@
         }
         // @phpstan-ignore-next-line
         if (self::readAsn1Content($message, $position, self::BYTE_SIZE) === self::ASN1_LENGTH_2BYTES) {
-            $position += self::BYTE_SIZE;
+            $position -= self::BYTE_SIZE;
         }
         $pointR = self::retrievePositiveInteger(self::readAsn1Integer($message, $position));
         $pointS = self::retrievePositiveInteger(self::readAsn1Integer($message, $position));

72) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:78    [M] Concat

--- Original
+++ New
@@ @@
         }
         $pointR = self::retrievePositiveInteger(self::readAsn1Integer($message, $position));
         $pointS = self::retrievePositiveInteger(self::readAsn1Integer($message, $position));
-        return hex2bin(str_pad($pointR, $length, '0', STR_PAD_LEFT) . str_pad($pointS, $length, '0', STR_PAD_LEFT));
+        return hex2bin(str_pad($pointS, $length, '0', STR_PAD_LEFT) . str_pad($pointR, $length, '0', STR_PAD_LEFT));
     }
     private static function octetLength(string $data) : int
     {

73) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:78    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         }
         $pointR = self::retrievePositiveInteger(self::readAsn1Integer($message, $position));
         $pointS = self::retrievePositiveInteger(self::readAsn1Integer($message, $position));
-        return hex2bin(str_pad($pointR, $length, '0', STR_PAD_LEFT) . str_pad($pointS, $length, '0', STR_PAD_LEFT));
+        return hex2bin(str_pad($pointS, $length, '0', STR_PAD_LEFT));
     }
     private static function octetLength(string $data) : int
     {

74) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:78    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         }
         $pointR = self::retrievePositiveInteger(self::readAsn1Integer($message, $position));
         $pointS = self::retrievePositiveInteger(self::readAsn1Integer($message, $position));
-        return hex2bin(str_pad($pointR, $length, '0', STR_PAD_LEFT) . str_pad($pointS, $length, '0', STR_PAD_LEFT));
+        return hex2bin(str_pad($pointR, $length, '0', STR_PAD_LEFT));
     }
     private static function octetLength(string $data) : int
     {

75) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:83    [M] MBString

--- Original
+++ New
@@ @@
     }
     private static function octetLength(string $data) : int
     {
-        return intdiv(mb_strlen($data, '8bit'), self::BYTE_SIZE);
+        return intdiv(strlen($data), self::BYTE_SIZE);
     }
     private static function preparePositiveInteger(string $data) : string
     {

76) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:88    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     private static function preparePositiveInteger(string $data) : string
     {
-        if (mb_substr($data, 0, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
+        if (mb_substr($data, -1, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
             return self::ASN1_NEGATIVE_INTEGER . $data;
         }
         while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') <= self::ASN1_BIG_INTEGER_LIMIT) {

77) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:88    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     private static function preparePositiveInteger(string $data) : string
     {
-        if (mb_substr($data, 0, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
+        if (mb_substr($data, 1, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
             return self::ASN1_NEGATIVE_INTEGER . $data;
         }
         while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') <= self::ASN1_BIG_INTEGER_LIMIT) {

78) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:88    [M] MBString

--- Original
+++ New
@@ @@
     }
     private static function preparePositiveInteger(string $data) : string
     {
-        if (mb_substr($data, 0, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
+        if (substr($data, 0, self::BYTE_SIZE) > self::ASN1_BIG_INTEGER_LIMIT) {
             return self::ASN1_NEGATIVE_INTEGER . $data;
         }
         while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') <= self::ASN1_BIG_INTEGER_LIMIT) {

79) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:88    [M] GreaterThan

--- Original
+++ New
@@ @@
     }
     private static function preparePositiveInteger(string $data) : string
     {
-        if (mb_substr($data, 0, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
+        if (mb_substr($data, 0, self::BYTE_SIZE, '8bit') >= self::ASN1_BIG_INTEGER_LIMIT) {
             return self::ASN1_NEGATIVE_INTEGER . $data;
         }
         while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') <= self::ASN1_BIG_INTEGER_LIMIT) {

80) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:88    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
     }
     private static function preparePositiveInteger(string $data) : string
     {
-        if (mb_substr($data, 0, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
+        if (mb_substr($data, 0, self::BYTE_SIZE, '8bit') <= self::ASN1_BIG_INTEGER_LIMIT) {
             return self::ASN1_NEGATIVE_INTEGER . $data;
         }
         while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') <= self::ASN1_BIG_INTEGER_LIMIT) {

81) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:89    [M] Concat

--- Original
+++ New
@@ @@
     private static function preparePositiveInteger(string $data) : string
     {
         if (mb_substr($data, 0, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
-            return self::ASN1_NEGATIVE_INTEGER . $data;
+            return $data . self::ASN1_NEGATIVE_INTEGER;
         }
         while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') <= self::ASN1_BIG_INTEGER_LIMIT) {
             $data = mb_substr($data, 2, null, '8bit');

82) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:89    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     private static function preparePositiveInteger(string $data) : string
     {
         if (mb_substr($data, 0, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
-            return self::ASN1_NEGATIVE_INTEGER . $data;
+            return $data;
         }
         while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') <= self::ASN1_BIG_INTEGER_LIMIT) {
             $data = mb_substr($data, 2, null, '8bit');

83) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:89    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     private static function preparePositiveInteger(string $data) : string
     {
         if (mb_substr($data, 0, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
-            return self::ASN1_NEGATIVE_INTEGER . $data;
+            return self::ASN1_NEGATIVE_INTEGER;
         }
         while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') <= self::ASN1_BIG_INTEGER_LIMIT) {
             $data = mb_substr($data, 2, null, '8bit');

84) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:92    [M] While_

--- Original
+++ New
@@ @@
         if (mb_substr($data, 0, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
             return self::ASN1_NEGATIVE_INTEGER . $data;
         }
-        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') <= self::ASN1_BIG_INTEGER_LIMIT) {
+        while (false) {
             $data = mb_substr($data, 2, null, '8bit');
         }
         return $data;

85) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:93    [M] DecrementInteger

--- Original
+++ New
@@ @@
         if (mb_substr($data, 0, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
             return self::ASN1_NEGATIVE_INTEGER . $data;
         }
-        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') <= self::ASN1_BIG_INTEGER_LIMIT) {
+        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, -1, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') <= self::ASN1_BIG_INTEGER_LIMIT) {
             $data = mb_substr($data, 2, null, '8bit');
         }
         return $data;

86) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:93    [M] IncrementInteger

--- Original
+++ New
@@ @@
         if (mb_substr($data, 0, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
             return self::ASN1_NEGATIVE_INTEGER . $data;
         }
-        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') <= self::ASN1_BIG_INTEGER_LIMIT) {
+        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 1, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') <= self::ASN1_BIG_INTEGER_LIMIT) {
             $data = mb_substr($data, 2, null, '8bit');
         }
         return $data;

87) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:93    [M] MBString

--- Original
+++ New
@@ @@
         if (mb_substr($data, 0, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
             return self::ASN1_NEGATIVE_INTEGER . $data;
         }
-        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') <= self::ASN1_BIG_INTEGER_LIMIT) {
+        while (strpos($data, self::ASN1_NEGATIVE_INTEGER, 0) === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') <= self::ASN1_BIG_INTEGER_LIMIT) {
             $data = mb_substr($data, 2, null, '8bit');
         }
         return $data;

88) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:93    [M] DecrementInteger

--- Original
+++ New
@@ @@
         if (mb_substr($data, 0, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
             return self::ASN1_NEGATIVE_INTEGER . $data;
         }
-        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') <= self::ASN1_BIG_INTEGER_LIMIT) {
+        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === -1 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') <= self::ASN1_BIG_INTEGER_LIMIT) {
             $data = mb_substr($data, 2, null, '8bit');
         }
         return $data;

89) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:93    [M] Identical

--- Original
+++ New
@@ @@
         if (mb_substr($data, 0, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
             return self::ASN1_NEGATIVE_INTEGER . $data;
         }
-        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') <= self::ASN1_BIG_INTEGER_LIMIT) {
+        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') !== 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') <= self::ASN1_BIG_INTEGER_LIMIT) {
             $data = mb_substr($data, 2, null, '8bit');
         }
         return $data;

90) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:93    [M] LogicalAnd

--- Original
+++ New
@@ @@
         if (mb_substr($data, 0, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
             return self::ASN1_NEGATIVE_INTEGER . $data;
         }
-        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') <= self::ASN1_BIG_INTEGER_LIMIT) {
+        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 || mb_substr($data, 2, self::BYTE_SIZE, '8bit') <= self::ASN1_BIG_INTEGER_LIMIT) {
             $data = mb_substr($data, 2, null, '8bit');
         }
         return $data;

91) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:94    [M] DecrementInteger

--- Original
+++ New
@@ @@
         if (mb_substr($data, 0, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
             return self::ASN1_NEGATIVE_INTEGER . $data;
         }
-        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') <= self::ASN1_BIG_INTEGER_LIMIT) {
+        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 1, self::BYTE_SIZE, '8bit') <= self::ASN1_BIG_INTEGER_LIMIT) {
             $data = mb_substr($data, 2, null, '8bit');
         }
         return $data;

92) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:94    [M] IncrementInteger

--- Original
+++ New
@@ @@
         if (mb_substr($data, 0, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
             return self::ASN1_NEGATIVE_INTEGER . $data;
         }
-        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') <= self::ASN1_BIG_INTEGER_LIMIT) {
+        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 3, self::BYTE_SIZE, '8bit') <= self::ASN1_BIG_INTEGER_LIMIT) {
             $data = mb_substr($data, 2, null, '8bit');
         }
         return $data;
