93) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:94    [M] MBString

--- Original
+++ New
@@ @@
         if (mb_substr($data, 0, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
             return self::ASN1_NEGATIVE_INTEGER . $data;
         }
-        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') <= self::ASN1_BIG_INTEGER_LIMIT) {
+        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && substr($data, 2, self::BYTE_SIZE) <= self::ASN1_BIG_INTEGER_LIMIT) {
             $data = mb_substr($data, 2, null, '8bit');
         }
         return $data;

94) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:94    [M] LessThanOrEqualTo

--- Original
+++ New
@@ @@
         if (mb_substr($data, 0, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
             return self::ASN1_NEGATIVE_INTEGER . $data;
         }
-        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') <= self::ASN1_BIG_INTEGER_LIMIT) {
+        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') < self::ASN1_BIG_INTEGER_LIMIT) {
             $data = mb_substr($data, 2, null, '8bit');
         }
         return $data;

95) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:94    [M] LessThanOrEqualToNegotiation

--- Original
+++ New
@@ @@
         if (mb_substr($data, 0, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
             return self::ASN1_NEGATIVE_INTEGER . $data;
         }
-        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') <= self::ASN1_BIG_INTEGER_LIMIT) {
+        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
             $data = mb_substr($data, 2, null, '8bit');
         }
         return $data;

96) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:96    [M] DecrementInteger

--- Original
+++ New
@@ @@
             return self::ASN1_NEGATIVE_INTEGER . $data;
         }
         while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') <= self::ASN1_BIG_INTEGER_LIMIT) {
-            $data = mb_substr($data, 2, null, '8bit');
+            $data = mb_substr($data, 1, null, '8bit');
         }
         return $data;
     }

97) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:96    [M] IncrementInteger

--- Original
+++ New
@@ @@
             return self::ASN1_NEGATIVE_INTEGER . $data;
         }
         while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') <= self::ASN1_BIG_INTEGER_LIMIT) {
-            $data = mb_substr($data, 2, null, '8bit');
+            $data = mb_substr($data, 3, null, '8bit');
         }
         return $data;
     }

98) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:96    [M] MBString

--- Original
+++ New
@@ @@
             return self::ASN1_NEGATIVE_INTEGER . $data;
         }
         while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') <= self::ASN1_BIG_INTEGER_LIMIT) {
-            $data = mb_substr($data, 2, null, '8bit');
+            $data = substr($data, 2, null);
         }
         return $data;
     }

99) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:104    [M] MBString

--- Original
+++ New
@@ @@
     }
     private static function readAsn1Content(string $message, int &$position, int $length) : string
     {
-        $content = mb_substr($message, $position, $length, '8bit');
+        $content = substr($message, $position, $length);
         $position += $length;
         return $content;
     }

100) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:105    [M] Assignment

--- Original
+++ New
@@ @@
     private static function readAsn1Content(string $message, int &$position, int $length) : string
     {
         $content = mb_substr($message, $position, $length, '8bit');
-        $position += $length;
+        $position = $length;
         return $content;
     }
     private static function readAsn1Integer(string $message, int &$position) : string

101) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:105    [M] PlusEqual

--- Original
+++ New
@@ @@
     private static function readAsn1Content(string $message, int &$position, int $length) : string
     {
         $content = mb_substr($message, $position, $length, '8bit');
-        $position += $length;
+        $position -= $length;
         return $content;
     }
     private static function readAsn1Integer(string $message, int &$position) : string

102) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:112    [M] NotIdentical

--- Original
+++ New
@@ @@
     }
     private static function readAsn1Integer(string $message, int &$position) : string
     {
-        if (self::readAsn1Content($message, $position, self::BYTE_SIZE) !== self::ASN1_INTEGER) {
+        if (self::readAsn1Content($message, $position, self::BYTE_SIZE) === self::ASN1_INTEGER) {
             throw new InvalidArgumentException('Invalid data. Should contain an integer.');
         }
         $length = (int) hexdec(self::readAsn1Content($message, $position, self::BYTE_SIZE));

103) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:113    [M] Throw_

--- Original
+++ New
@@ @@
     private static function readAsn1Integer(string $message, int &$position) : string
     {
         if (self::readAsn1Content($message, $position, self::BYTE_SIZE) !== self::ASN1_INTEGER) {
-            throw new InvalidArgumentException('Invalid data. Should contain an integer.');
+            new InvalidArgumentException('Invalid data. Should contain an integer.');
         }
         $length = (int) hexdec(self::readAsn1Content($message, $position, self::BYTE_SIZE));
         return self::readAsn1Content($message, $position, $length * self::BYTE_SIZE);

104) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:116    [M] CastInt

--- Original
+++ New
@@ @@
         if (self::readAsn1Content($message, $position, self::BYTE_SIZE) !== self::ASN1_INTEGER) {
             throw new InvalidArgumentException('Invalid data. Should contain an integer.');
         }
-        $length = (int) hexdec(self::readAsn1Content($message, $position, self::BYTE_SIZE));
+        $length = hexdec(self::readAsn1Content($message, $position, self::BYTE_SIZE));
         return self::readAsn1Content($message, $position, $length * self::BYTE_SIZE);
     }
     private static function retrievePositiveInteger(string $data) : string

105) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:118    [M] Multiplication

--- Original
+++ New
@@ @@
             throw new InvalidArgumentException('Invalid data. Should contain an integer.');
         }
         $length = (int) hexdec(self::readAsn1Content($message, $position, self::BYTE_SIZE));
-        return self::readAsn1Content($message, $position, $length * self::BYTE_SIZE);
+        return self::readAsn1Content($message, $position, $length / self::BYTE_SIZE);
     }
     private static function retrievePositiveInteger(string $data) : string
     {

106) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:123    [M] While_

--- Original
+++ New
@@ @@
     }
     private static function retrievePositiveInteger(string $data) : string
     {
-        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
+        while (false) {
             $data = mb_substr($data, 2, null, '8bit');
         }
         return $data;
     }
 }

107) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:124    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     private static function retrievePositiveInteger(string $data) : string
     {
-        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
+        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, -1, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
             $data = mb_substr($data, 2, null, '8bit');
         }
         return $data;
     }
 }

108) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:124    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     private static function retrievePositiveInteger(string $data) : string
     {
-        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
+        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 1, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
             $data = mb_substr($data, 2, null, '8bit');
         }
         return $data;
     }
 }

109) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:124    [M] MBString

--- Original
+++ New
@@ @@
     }
     private static function retrievePositiveInteger(string $data) : string
     {
-        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
+        while (strpos($data, self::ASN1_NEGATIVE_INTEGER, 0) === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
             $data = mb_substr($data, 2, null, '8bit');
         }
         return $data;
     }
 }

110) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:124    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     private static function retrievePositiveInteger(string $data) : string
     {
-        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
+        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === -1 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
             $data = mb_substr($data, 2, null, '8bit');
         }
         return $data;
     }
 }

111) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:124    [M] Identical

--- Original
+++ New
@@ @@
     }
     private static function retrievePositiveInteger(string $data) : string
     {
-        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
+        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') !== 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
             $data = mb_substr($data, 2, null, '8bit');
         }
         return $data;
     }
 }

112) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:124    [M] LogicalAnd

--- Original
+++ New
@@ @@
     }
     private static function retrievePositiveInteger(string $data) : string
     {
-        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
+        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 || mb_substr($data, 2, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
             $data = mb_substr($data, 2, null, '8bit');
         }
         return $data;
     }
 }

113) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:125    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     private static function retrievePositiveInteger(string $data) : string
     {
-        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
+        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 1, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
             $data = mb_substr($data, 2, null, '8bit');
         }
         return $data;
     }
 }

114) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:125    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     private static function retrievePositiveInteger(string $data) : string
     {
-        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
+        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 3, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
             $data = mb_substr($data, 2, null, '8bit');
         }
         return $data;
     }
 }

115) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:125    [M] MBString

--- Original
+++ New
@@ @@
     }
     private static function retrievePositiveInteger(string $data) : string
     {
-        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
+        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && substr($data, 2, self::BYTE_SIZE) > self::ASN1_BIG_INTEGER_LIMIT) {
             $data = mb_substr($data, 2, null, '8bit');
         }
         return $data;
     }
 }

116) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:125    [M] GreaterThan

--- Original
+++ New
@@ @@
     }
     private static function retrievePositiveInteger(string $data) : string
     {
-        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
+        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') >= self::ASN1_BIG_INTEGER_LIMIT) {
             $data = mb_substr($data, 2, null, '8bit');
         }
         return $data;
     }
 }

117) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:125    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
     }
     private static function retrievePositiveInteger(string $data) : string
     {
-        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
+        while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') <= self::ASN1_BIG_INTEGER_LIMIT) {
             $data = mb_substr($data, 2, null, '8bit');
         }
         return $data;
     }
 }

118) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:127    [M] DecrementInteger

--- Original
+++ New
@@ @@
     private static function retrievePositiveInteger(string $data) : string
     {
         while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
-            $data = mb_substr($data, 2, null, '8bit');
+            $data = mb_substr($data, 1, null, '8bit');
         }
         return $data;
     }
 }

119) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:127    [M] IncrementInteger

--- Original
+++ New
@@ @@
     private static function retrievePositiveInteger(string $data) : string
     {
         while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
-            $data = mb_substr($data, 2, null, '8bit');
+            $data = mb_substr($data, 3, null, '8bit');
         }
         return $data;
     }
 }

120) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ECSignature.php:127    [M] MBString

--- Original
+++ New
@@ @@
     private static function retrievePositiveInteger(string $data) : string
     {
         while (mb_strpos($data, self::ASN1_NEGATIVE_INTEGER, 0, '8bit') === 0 && mb_substr($data, 2, self::BYTE_SIZE, '8bit') > self::ASN1_BIG_INTEGER_LIMIT) {
-            $data = mb_substr($data, 2, null, '8bit');
+            $data = substr($data, 2, null);
         }
         return $data;
     }
 }

121) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ES256.php:14    [M] PublicVisibility

--- Original
+++ New
@@ @@
 final class ES256 extends ECDSA
 {
     public const ID = -7;
-    public static function create() : self
+    protected static function create() : self
     {
         return new self();
     }

125) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ES256K.php:14    [M] PublicVisibility

--- Original
+++ New
@@ @@
 final class ES256K extends ECDSA
 {
     public const ID = -46;
-    public static function create() : self
+    protected static function create() : self
     {
         return new self();
     }

129) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ES384.php:14    [M] PublicVisibility

--- Original
+++ New
@@ @@
 final class ES384 extends ECDSA
 {
     public const ID = -35;
-    public static function create() : self
+    protected static function create() : self
     {
         return new self();
     }

130) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ES384.php:36    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getSignaturePartLength() : int
     {
-        return 96;
+        return 95;
     }
 }

131) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ES384.php:36    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getSignaturePartLength() : int
     {
-        return 96;
+        return 97;
     }
 }

132) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ES384.php:36    [M] IntegerNegation

--- Original
+++ New
@@ @@
     }
     protected function getSignaturePartLength() : int
     {
-        return 96;
+        return -96;
     }
 }

133) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ES512.php:14    [M] PublicVisibility

--- Original
+++ New
@@ @@
 final class ES512 extends ECDSA
 {
     public const ID = -36;
-    public static function create() : self
+    protected static function create() : self
     {
         return new self();
     }

134) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ES512.php:36    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getSignaturePartLength() : int
     {
-        return 132;
+        return 131;
     }
 }

135) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ES512.php:36    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getSignaturePartLength() : int
     {
-        return 132;
+        return 133;
     }
 }

136) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/ECDSA/ES512.php:36    [M] IntegerNegation

--- Original
+++ New
@@ @@
     }
     protected function getSignaturePartLength() : int
     {
-        return 132;
+        return -132;
     }
 }

137) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/EdDSA/Ed25519.php:11    [M] PublicVisibility

--- Original
+++ New
@@ @@
 final class Ed25519 extends EdDSA
 {
     public const ID = -8;
-    public static function create() : self
+    protected static function create() : self
     {
         return new self();
     }

138) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/EdDSA/Ed256.php:13    [M] PublicVisibility

--- Original
+++ New
@@ @@
 final class Ed256 extends EdDSA
 {
     public const ID = -260;
-    public static function create() : self
+    protected static function create() : self
     {
         return new self();
     }

139) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/EdDSA/Ed512.php:13    [M] PublicVisibility

--- Original
+++ New
@@ @@
 final class Ed512 extends EdDSA
 {
     public const ID = -261;
-    public static function create() : self
+    protected static function create() : self
     {
         return new self();
     }

140) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/EdDSA/EdDSA.php:22    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function sign(string $data, Key $key) : string
     {
         $key = $this->handleKey($key);
-        Assertion::true($key->isPrivate(), 'The key is not private');
+        
         $x = $key->x();
         $d = $key->d();
         $secret = $d . $x;

141) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/EdDSA/EdDSA.php:26    [M] Concat

--- Original
+++ New
@@ @@
         Assertion::true($key->isPrivate(), 'The key is not private');
         $x = $key->x();
         $d = $key->d();
-        $secret = $d . $x;
+        $secret = $x . $d;
         return match ($key->curve()) {
             OkpKey::CURVE_ED25519 => sodium_crypto_sign_detached($data, $secret),
             default => throw new InvalidArgumentException('Unsupported curve'),

142) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/EdDSA/EdDSA.php:26    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         Assertion::true($key->isPrivate(), 'The key is not private');
         $x = $key->x();
         $d = $key->d();
-        $secret = $d . $x;
+        $secret = $x;
         return match ($key->curve()) {
             OkpKey::CURVE_ED25519 => sodium_crypto_sign_detached($data, $secret),
             default => throw new InvalidArgumentException('Unsupported curve'),

143) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/EdDSA/EdDSA.php:26    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         Assertion::true($key->isPrivate(), 'The key is not private');
         $x = $key->x();
         $d = $key->d();
-        $secret = $d . $x;
+        $secret = $d;
         return match ($key->curve()) {
             OkpKey::CURVE_ED25519 => sodium_crypto_sign_detached($data, $secret),
             default => throw new InvalidArgumentException('Unsupported curve'),

144) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/EdDSA/EdDSA.php:37    [M] NotIdentical

--- Original
+++ New
@@ @@
     public function verify(string $data, Key $key, string $signature) : bool
     {
         $key = $this->handleKey($key);
-        if ($key->curve() !== OkpKey::CURVE_ED25519) {
+        if ($key->curve() === OkpKey::CURVE_ED25519) {
             throw new InvalidArgumentException('Unsupported curve');
         }
         try {

145) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/EdDSA/EdDSA.php:38    [M] Throw_

--- Original
+++ New
@@ @@
     {
         $key = $this->handleKey($key);
         if ($key->curve() !== OkpKey::CURVE_ED25519) {
-            throw new InvalidArgumentException('Unsupported curve');
+            new InvalidArgumentException('Unsupported curve');
         }
         try {
             sodium_crypto_sign_verify_detached($signature, $data, $key->x());

146) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/EdDSA/EdDSA.php:41    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
             throw new InvalidArgumentException('Unsupported curve');
         }
         try {
-            sodium_crypto_sign_verify_detached($signature, $data, $key->x());
+            
         } catch (Throwable) {
             return false;
         }

147) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/EdDSA/EdDSA.php:43    [M] FalseValue

--- Original
+++ New
@@ @@
         try {
             sodium_crypto_sign_verify_detached($signature, $data, $key->x());
         } catch (Throwable) {
-            return false;
+            return true;
         }
         return true;
     }

149) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PS256.php:13    [M] PublicVisibility

--- Original
+++ New
@@ @@
 final class PS256 extends PSSRSA
 {
     public const ID = -37;
-    public static function create() : self
+    protected static function create() : self
     {
         return new self();
     }

150) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PS384.php:13    [M] PublicVisibility

--- Original
+++ New
@@ @@
 final class PS384 extends PSSRSA
 {
     public const ID = -38;
-    public static function create() : self
+    protected static function create() : self
     {
         return new self();
     }

151) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PS512.php:13    [M] PublicVisibility

--- Original
+++ New
@@ @@
 final class PS512 extends PSSRSA
 {
     public const ID = -39;
-    public static function create() : self
+    protected static function create() : self
     {
         return new self();
     }

152) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:34    [M] MBString

--- Original
+++ New
@@ @@
     public function sign(string $data, Key $key) : string
     {
         $key = $this->handleKey($key);
-        $modulusLength = mb_strlen($key->n(), '8bit');
+        $modulusLength = strlen($key->n());
         $em = $this->encodeEMSAPSS($data, 8 * $modulusLength - 1, $this->getHashAlgorithm());
         $message = BigInteger::createFromBinaryString($em);
         $signature = $this->exponentiate($key, $message);

153) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:36    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         $key = $this->handleKey($key);
         $modulusLength = mb_strlen($key->n(), '8bit');
-        $em = $this->encodeEMSAPSS($data, 8 * $modulusLength - 1, $this->getHashAlgorithm());
+        $em = $this->encodeEMSAPSS($data, 7 * $modulusLength - 1, $this->getHashAlgorithm());
         $message = BigInteger::createFromBinaryString($em);
         $signature = $this->exponentiate($key, $message);
         return $this->convertIntegerToOctetString($signature, $modulusLength);

154) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:36    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         $key = $this->handleKey($key);
         $modulusLength = mb_strlen($key->n(), '8bit');
-        $em = $this->encodeEMSAPSS($data, 8 * $modulusLength - 1, $this->getHashAlgorithm());
+        $em = $this->encodeEMSAPSS($data, 9 * $modulusLength - 1, $this->getHashAlgorithm());
         $message = BigInteger::createFromBinaryString($em);
         $signature = $this->exponentiate($key, $message);
         return $this->convertIntegerToOctetString($signature, $modulusLength);

155) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:36    [M] Multiplication

--- Original
+++ New
@@ @@
     {
         $key = $this->handleKey($key);
         $modulusLength = mb_strlen($key->n(), '8bit');
-        $em = $this->encodeEMSAPSS($data, 8 * $modulusLength - 1, $this->getHashAlgorithm());
+        $em = $this->encodeEMSAPSS($data, 8 / $modulusLength - 1, $this->getHashAlgorithm());
         $message = BigInteger::createFromBinaryString($em);
         $signature = $this->exponentiate($key, $message);
         return $this->convertIntegerToOctetString($signature, $modulusLength);

156) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:36    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         $key = $this->handleKey($key);
         $modulusLength = mb_strlen($key->n(), '8bit');
-        $em = $this->encodeEMSAPSS($data, 8 * $modulusLength - 1, $this->getHashAlgorithm());
+        $em = $this->encodeEMSAPSS($data, 8 * $modulusLength - 0, $this->getHashAlgorithm());
         $message = BigInteger::createFromBinaryString($em);
         $signature = $this->exponentiate($key, $message);
         return $this->convertIntegerToOctetString($signature, $modulusLength);

157) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:36    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         $key = $this->handleKey($key);
         $modulusLength = mb_strlen($key->n(), '8bit');
-        $em = $this->encodeEMSAPSS($data, 8 * $modulusLength - 1, $this->getHashAlgorithm());
+        $em = $this->encodeEMSAPSS($data, 8 * $modulusLength - 2, $this->getHashAlgorithm());
         $message = BigInteger::createFromBinaryString($em);
         $signature = $this->exponentiate($key, $message);
         return $this->convertIntegerToOctetString($signature, $modulusLength);
