158) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:36    [M] Minus

--- Original
+++ New
@@ @@
     {
         $key = $this->handleKey($key);
         $modulusLength = mb_strlen($key->n(), '8bit');
-        $em = $this->encodeEMSAPSS($data, 8 * $modulusLength - 1, $this->getHashAlgorithm());
+        $em = $this->encodeEMSAPSS($data, 8 * $modulusLength + 1, $this->getHashAlgorithm());
         $message = BigInteger::createFromBinaryString($em);
         $signature = $this->exponentiate($key, $message);
         return $this->convertIntegerToOctetString($signature, $modulusLength);

160) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:48    [M] MBString

--- Original
+++ New
@@ @@
     {
         $key = $this->handleKey($key);
         $modulusLength = mb_strlen($key->n(), '8bit');
-        if (mb_strlen($signature, '8bit') !== $modulusLength) {
+        if (strlen($signature) !== $modulusLength) {
             throw new InvalidArgumentException('Invalid modulus length');
         }
         $s2 = BigInteger::createFromBinaryString($signature);

161) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:48    [M] NotIdentical

--- Original
+++ New
@@ @@
     {
         $key = $this->handleKey($key);
         $modulusLength = mb_strlen($key->n(), '8bit');
-        if (mb_strlen($signature, '8bit') !== $modulusLength) {
+        if (mb_strlen($signature, '8bit') === $modulusLength) {
             throw new InvalidArgumentException('Invalid modulus length');
         }
         $s2 = BigInteger::createFromBinaryString($signature);

162) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:49    [M] Throw_

--- Original
+++ New
@@ @@
         $key = $this->handleKey($key);
         $modulusLength = mb_strlen($key->n(), '8bit');
         if (mb_strlen($signature, '8bit') !== $modulusLength) {
-            throw new InvalidArgumentException('Invalid modulus length');
+            new InvalidArgumentException('Invalid modulus length');
         }
         $s2 = BigInteger::createFromBinaryString($signature);
         $m2 = $this->exponentiate($key, $s2);

163) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:54    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $s2 = BigInteger::createFromBinaryString($signature);
         $m2 = $this->exponentiate($key, $s2);
         $em = $this->convertIntegerToOctetString($m2, $modulusLength);
-        $modBits = 8 * $modulusLength;
+        $modBits = 7 * $modulusLength;
         return $this->verifyEMSAPSS($data, $em, $modBits - 1, $this->getHashAlgorithm());
     }
     /**

164) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:54    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $s2 = BigInteger::createFromBinaryString($signature);
         $m2 = $this->exponentiate($key, $s2);
         $em = $this->convertIntegerToOctetString($m2, $modulusLength);
-        $modBits = 8 * $modulusLength;
+        $modBits = 9 * $modulusLength;
         return $this->verifyEMSAPSS($data, $em, $modBits - 1, $this->getHashAlgorithm());
     }
     /**

165) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:54    [M] Multiplication

--- Original
+++ New
@@ @@
         $s2 = BigInteger::createFromBinaryString($signature);
         $m2 = $this->exponentiate($key, $s2);
         $em = $this->convertIntegerToOctetString($m2, $modulusLength);
-        $modBits = 8 * $modulusLength;
+        $modBits = 8 / $modulusLength;
         return $this->verifyEMSAPSS($data, $em, $modBits - 1, $this->getHashAlgorithm());
     }
     /**

166) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:56    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $m2 = $this->exponentiate($key, $s2);
         $em = $this->convertIntegerToOctetString($m2, $modulusLength);
         $modBits = 8 * $modulusLength;
-        return $this->verifyEMSAPSS($data, $em, $modBits - 1, $this->getHashAlgorithm());
+        return $this->verifyEMSAPSS($data, $em, $modBits - 0, $this->getHashAlgorithm());
     }
     /**
      * Exponentiate with or without Chinese Remainder Theorem. Operation with primes 'p' and 'q' is appox. 2x faster.

167) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:56    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $m2 = $this->exponentiate($key, $s2);
         $em = $this->convertIntegerToOctetString($m2, $modulusLength);
         $modBits = 8 * $modulusLength;
-        return $this->verifyEMSAPSS($data, $em, $modBits - 1, $this->getHashAlgorithm());
+        return $this->verifyEMSAPSS($data, $em, $modBits - 2, $this->getHashAlgorithm());
     }
     /**
      * Exponentiate with or without Chinese Remainder Theorem. Operation with primes 'p' and 'q' is appox. 2x faster.

168) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:56    [M] Minus

--- Original
+++ New
@@ @@
         $m2 = $this->exponentiate($key, $s2);
         $em = $this->convertIntegerToOctetString($m2, $modulusLength);
         $modBits = 8 * $modulusLength;
-        return $this->verifyEMSAPSS($data, $em, $modBits - 1, $this->getHashAlgorithm());
+        return $this->verifyEMSAPSS($data, $em, $modBits + 1, $this->getHashAlgorithm());
     }
     /**
      * Exponentiate with or without Chinese Remainder Theorem. Operation with primes 'p' and 'q' is appox. 2x faster.

169) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:62    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * Exponentiate with or without Chinese Remainder Theorem. Operation with primes 'p' and 'q' is appox. 2x faster.
      */
-    public function exponentiate(RsaKey $key, BigInteger $c) : BigInteger
+    protected function exponentiate(RsaKey $key, BigInteger $c) : BigInteger
     {
         if ($c->compare(BigInteger::createFromDecimal(0)) < 0 || $c->compare(BigInteger::createFromBinaryString($key->n())) > 0) {
             throw new RuntimeException();

170) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:64    [M] DecrementInteger

--- Original
+++ New
@@ @@
      */
     public function exponentiate(RsaKey $key, BigInteger $c) : BigInteger
     {
-        if ($c->compare(BigInteger::createFromDecimal(0)) < 0 || $c->compare(BigInteger::createFromBinaryString($key->n())) > 0) {
+        if ($c->compare(BigInteger::createFromDecimal(-1)) < 0 || $c->compare(BigInteger::createFromBinaryString($key->n())) > 0) {
             throw new RuntimeException();
         }
         if ($key->isPublic() || !$key->hasPrimes() || !$key->hasExponents() || !$key->hasCoefficient()) {

171) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:64    [M] IncrementInteger

--- Original
+++ New
@@ @@
      */
     public function exponentiate(RsaKey $key, BigInteger $c) : BigInteger
     {
-        if ($c->compare(BigInteger::createFromDecimal(0)) < 0 || $c->compare(BigInteger::createFromBinaryString($key->n())) > 0) {
+        if ($c->compare(BigInteger::createFromDecimal(1)) < 0 || $c->compare(BigInteger::createFromBinaryString($key->n())) > 0) {
             throw new RuntimeException();
         }
         if ($key->isPublic() || !$key->hasPrimes() || !$key->hasExponents() || !$key->hasCoefficient()) {

172) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:64    [M] LessThan

--- Original
+++ New
@@ @@
      */
     public function exponentiate(RsaKey $key, BigInteger $c) : BigInteger
     {
-        if ($c->compare(BigInteger::createFromDecimal(0)) < 0 || $c->compare(BigInteger::createFromBinaryString($key->n())) > 0) {
+        if ($c->compare(BigInteger::createFromDecimal(0)) <= 0 || $c->compare(BigInteger::createFromBinaryString($key->n())) > 0) {
             throw new RuntimeException();
         }
         if ($key->isPublic() || !$key->hasPrimes() || !$key->hasExponents() || !$key->hasCoefficient()) {

173) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:64    [M] LessThanNegotiation

--- Original
+++ New
@@ @@
      */
     public function exponentiate(RsaKey $key, BigInteger $c) : BigInteger
     {
-        if ($c->compare(BigInteger::createFromDecimal(0)) < 0 || $c->compare(BigInteger::createFromBinaryString($key->n())) > 0) {
+        if ($c->compare(BigInteger::createFromDecimal(0)) >= 0 || $c->compare(BigInteger::createFromBinaryString($key->n())) > 0) {
             throw new RuntimeException();
         }
         if ($key->isPublic() || !$key->hasPrimes() || !$key->hasExponents() || !$key->hasCoefficient()) {

174) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:64    [M] GreaterThan

--- Original
+++ New
@@ @@
      */
     public function exponentiate(RsaKey $key, BigInteger $c) : BigInteger
     {
-        if ($c->compare(BigInteger::createFromDecimal(0)) < 0 || $c->compare(BigInteger::createFromBinaryString($key->n())) > 0) {
+        if ($c->compare(BigInteger::createFromDecimal(0)) < 0 || $c->compare(BigInteger::createFromBinaryString($key->n())) >= 0) {
             throw new RuntimeException();
         }
         if ($key->isPublic() || !$key->hasPrimes() || !$key->hasExponents() || !$key->hasCoefficient()) {

175) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:64    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
      */
     public function exponentiate(RsaKey $key, BigInteger $c) : BigInteger
     {
-        if ($c->compare(BigInteger::createFromDecimal(0)) < 0 || $c->compare(BigInteger::createFromBinaryString($key->n())) > 0) {
+        if ($c->compare(BigInteger::createFromDecimal(0)) < 0 || $c->compare(BigInteger::createFromBinaryString($key->n())) <= 0) {
             throw new RuntimeException();
         }
         if ($key->isPublic() || !$key->hasPrimes() || !$key->hasExponents() || !$key->hasCoefficient()) {

176) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:64    [M] LogicalOr

--- Original
+++ New
@@ @@
      */
     public function exponentiate(RsaKey $key, BigInteger $c) : BigInteger
     {
-        if ($c->compare(BigInteger::createFromDecimal(0)) < 0 || $c->compare(BigInteger::createFromBinaryString($key->n())) > 0) {
+        if ($c->compare(BigInteger::createFromDecimal(0)) < 0 && $c->compare(BigInteger::createFromBinaryString($key->n())) > 0) {
             throw new RuntimeException();
         }
         if ($key->isPublic() || !$key->hasPrimes() || !$key->hasExponents() || !$key->hasCoefficient()) {

177) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:67    [M] Throw_

--- Original
+++ New
@@ @@
     public function exponentiate(RsaKey $key, BigInteger $c) : BigInteger
     {
         if ($c->compare(BigInteger::createFromDecimal(0)) < 0 || $c->compare(BigInteger::createFromBinaryString($key->n())) > 0) {
-            throw new RuntimeException();
+            new RuntimeException();
         }
         if ($key->isPublic() || !$key->hasPrimes() || !$key->hasExponents() || !$key->hasCoefficient()) {
             return $c->modPow(BigInteger::createFromBinaryString($key->e()), BigInteger::createFromBinaryString($key->n()));

178) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:69    [M] LogicalNot

--- Original
+++ New
@@ @@
         if ($c->compare(BigInteger::createFromDecimal(0)) < 0 || $c->compare(BigInteger::createFromBinaryString($key->n())) > 0) {
             throw new RuntimeException();
         }
-        if ($key->isPublic() || !$key->hasPrimes() || !$key->hasExponents() || !$key->hasCoefficient()) {
+        if ($key->isPublic() || $key->hasPrimes() || !$key->hasExponents() || !$key->hasCoefficient()) {
             return $c->modPow(BigInteger::createFromBinaryString($key->e()), BigInteger::createFromBinaryString($key->n()));
         }
         [$pS, $qS] = $key->primes();

179) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:69    [M] LogicalOr

--- Original
+++ New
@@ @@
         if ($c->compare(BigInteger::createFromDecimal(0)) < 0 || $c->compare(BigInteger::createFromBinaryString($key->n())) > 0) {
             throw new RuntimeException();
         }
-        if ($key->isPublic() || !$key->hasPrimes() || !$key->hasExponents() || !$key->hasCoefficient()) {
+        if ($key->isPublic() && !$key->hasPrimes() || !$key->hasExponents() || !$key->hasCoefficient()) {
             return $c->modPow(BigInteger::createFromBinaryString($key->e()), BigInteger::createFromBinaryString($key->n()));
         }
         [$pS, $qS] = $key->primes();

180) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:69    [M] LogicalNot

--- Original
+++ New
@@ @@
         if ($c->compare(BigInteger::createFromDecimal(0)) < 0 || $c->compare(BigInteger::createFromBinaryString($key->n())) > 0) {
             throw new RuntimeException();
         }
-        if ($key->isPublic() || !$key->hasPrimes() || !$key->hasExponents() || !$key->hasCoefficient()) {
+        if ($key->isPublic() || !$key->hasPrimes() || $key->hasExponents() || !$key->hasCoefficient()) {
             return $c->modPow(BigInteger::createFromBinaryString($key->e()), BigInteger::createFromBinaryString($key->n()));
         }
         [$pS, $qS] = $key->primes();

181) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:69    [M] LogicalOr

--- Original
+++ New
@@ @@
         if ($c->compare(BigInteger::createFromDecimal(0)) < 0 || $c->compare(BigInteger::createFromBinaryString($key->n())) > 0) {
             throw new RuntimeException();
         }
-        if ($key->isPublic() || !$key->hasPrimes() || !$key->hasExponents() || !$key->hasCoefficient()) {
+        if (($key->isPublic() || !$key->hasPrimes()) && !$key->hasExponents() || !$key->hasCoefficient()) {
             return $c->modPow(BigInteger::createFromBinaryString($key->e()), BigInteger::createFromBinaryString($key->n()));
         }
         [$pS, $qS] = $key->primes();

182) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:69    [M] LogicalNot

--- Original
+++ New
@@ @@
         if ($c->compare(BigInteger::createFromDecimal(0)) < 0 || $c->compare(BigInteger::createFromBinaryString($key->n())) > 0) {
             throw new RuntimeException();
         }
-        if ($key->isPublic() || !$key->hasPrimes() || !$key->hasExponents() || !$key->hasCoefficient()) {
+        if ($key->isPublic() || !$key->hasPrimes() || !$key->hasExponents() || $key->hasCoefficient()) {
             return $c->modPow(BigInteger::createFromBinaryString($key->e()), BigInteger::createFromBinaryString($key->n()));
         }
         [$pS, $qS] = $key->primes();

183) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:69    [M] LogicalOr

--- Original
+++ New
@@ @@
         if ($c->compare(BigInteger::createFromDecimal(0)) < 0 || $c->compare(BigInteger::createFromBinaryString($key->n())) > 0) {
             throw new RuntimeException();
         }
-        if ($key->isPublic() || !$key->hasPrimes() || !$key->hasExponents() || !$key->hasCoefficient()) {
+        if (($key->isPublic() || !$key->hasPrimes() || !$key->hasExponents()) && !$key->hasCoefficient()) {
             return $c->modPow(BigInteger::createFromBinaryString($key->e()), BigInteger::createFromBinaryString($key->n()));
         }
         [$pS, $qS] = $key->primes();

184) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:103    [M] MBString

--- Original
+++ New
@@ @@
     private function convertIntegerToOctetString(BigInteger $x, int $xLen) : string
     {
         $xB = $x->toBytes();
-        if (mb_strlen($xB, '8bit') > $xLen) {
+        if (strlen($xB) > $xLen) {
             throw new RuntimeException('Unable to convert the integer');
         }
         return str_pad($xB, $xLen, chr(0), STR_PAD_LEFT);

185) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:103    [M] GreaterThan

--- Original
+++ New
@@ @@
     private function convertIntegerToOctetString(BigInteger $x, int $xLen) : string
     {
         $xB = $x->toBytes();
-        if (mb_strlen($xB, '8bit') > $xLen) {
+        if (mb_strlen($xB, '8bit') >= $xLen) {
             throw new RuntimeException('Unable to convert the integer');
         }
         return str_pad($xB, $xLen, chr(0), STR_PAD_LEFT);

186) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:103    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
     private function convertIntegerToOctetString(BigInteger $x, int $xLen) : string
     {
         $xB = $x->toBytes();
-        if (mb_strlen($xB, '8bit') > $xLen) {
+        if (mb_strlen($xB, '8bit') <= $xLen) {
             throw new RuntimeException('Unable to convert the integer');
         }
         return str_pad($xB, $xLen, chr(0), STR_PAD_LEFT);

187) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:104    [M] Throw_

--- Original
+++ New
@@ @@
     {
         $xB = $x->toBytes();
         if (mb_strlen($xB, '8bit') > $xLen) {
-            throw new RuntimeException('Unable to convert the integer');
+            new RuntimeException('Unable to convert the integer');
         }
         return str_pad($xB, $xLen, chr(0), STR_PAD_LEFT);
     }

188) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:107    [M] DecrementInteger

--- Original
+++ New
@@ @@
         if (mb_strlen($xB, '8bit') > $xLen) {
             throw new RuntimeException('Unable to convert the integer');
         }
-        return str_pad($xB, $xLen, chr(0), STR_PAD_LEFT);
+        return str_pad($xB, $xLen, chr(-1), STR_PAD_LEFT);
     }
     /**
      * MGF1.

189) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:107    [M] IncrementInteger

--- Original
+++ New
@@ @@
         if (mb_strlen($xB, '8bit') > $xLen) {
             throw new RuntimeException('Unable to convert the integer');
         }
-        return str_pad($xB, $xLen, chr(0), STR_PAD_LEFT);
+        return str_pad($xB, $xLen, chr(1), STR_PAD_LEFT);
     }
     /**
      * MGF1.

190) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:116    [M] Division

--- Original
+++ New
@@ @@
     private function getMGF1(string $mgfSeed, int $maskLen, Hash $mgfHash) : string
     {
         $t = '';
-        $count = ceil($maskLen / $mgfHash->getLength());
+        $count = ceil($maskLen * $mgfHash->getLength());
         for ($i = 0; $i < $count; ++$i) {
             $c = pack('N', $i);
             $t .= $mgfHash->hash($mgfSeed . $c);

191) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:116    [M] RoundingFamily

--- Original
+++ New
@@ @@
     private function getMGF1(string $mgfSeed, int $maskLen, Hash $mgfHash) : string
     {
         $t = '';
-        $count = ceil($maskLen / $mgfHash->getLength());
+        $count = floor($maskLen / $mgfHash->getLength());
         for ($i = 0; $i < $count; ++$i) {
             $c = pack('N', $i);
             $t .= $mgfHash->hash($mgfSeed . $c);

192) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:116    [M] RoundingFamily

--- Original
+++ New
@@ @@
     private function getMGF1(string $mgfSeed, int $maskLen, Hash $mgfHash) : string
     {
         $t = '';
-        $count = ceil($maskLen / $mgfHash->getLength());
+        $count = round($maskLen / $mgfHash->getLength());
         for ($i = 0; $i < $count; ++$i) {
             $c = pack('N', $i);
             $t .= $mgfHash->hash($mgfSeed . $c);

193) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:117    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         $t = '';
         $count = ceil($maskLen / $mgfHash->getLength());
-        for ($i = 0; $i < $count; ++$i) {
+        for ($i = -1; $i < $count; ++$i) {
             $c = pack('N', $i);
             $t .= $mgfHash->hash($mgfSeed . $c);
         }

194) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:117    [M] LessThan

--- Original
+++ New
@@ @@
     {
         $t = '';
         $count = ceil($maskLen / $mgfHash->getLength());
-        for ($i = 0; $i < $count; ++$i) {
+        for ($i = 0; $i <= $count; ++$i) {
             $c = pack('N', $i);
             $t .= $mgfHash->hash($mgfSeed . $c);
         }

195) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:117    [M] LessThanNegotiation

--- Original
+++ New
@@ @@
     {
         $t = '';
         $count = ceil($maskLen / $mgfHash->getLength());
-        for ($i = 0; $i < $count; ++$i) {
+        for ($i = 0; $i >= $count; ++$i) {
             $c = pack('N', $i);
             $t .= $mgfHash->hash($mgfSeed . $c);
         }

196) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:117    [M] Increment

--- Original
+++ New
@@ @@
     {
         $t = '';
         $count = ceil($maskLen / $mgfHash->getLength());
-        for ($i = 0; $i < $count; ++$i) {
+        for ($i = 0; $i < $count; --$i) {
             $c = pack('N', $i);
             $t .= $mgfHash->hash($mgfSeed . $c);
         }

197) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:117    [M] For_

--- Original
+++ New
@@ @@
     {
         $t = '';
         $count = ceil($maskLen / $mgfHash->getLength());
-        for ($i = 0; $i < $count; ++$i) {
+        for ($i = 0; false; ++$i) {
             $c = pack('N', $i);
             $t .= $mgfHash->hash($mgfSeed . $c);
         }

198) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:119    [M] Concat

--- Original
+++ New
@@ @@
         $count = ceil($maskLen / $mgfHash->getLength());
         for ($i = 0; $i < $count; ++$i) {
             $c = pack('N', $i);
-            $t .= $mgfHash->hash($mgfSeed . $c);
+            $t .= $mgfHash->hash($c . $mgfSeed);
         }
         return mb_substr($t, 0, $maskLen, '8bit');
     }

199) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:119    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $count = ceil($maskLen / $mgfHash->getLength());
         for ($i = 0; $i < $count; ++$i) {
             $c = pack('N', $i);
-            $t .= $mgfHash->hash($mgfSeed . $c);
+            $t .= $mgfHash->hash($c);
         }
         return mb_substr($t, 0, $maskLen, '8bit');
     }

200) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:119    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $count = ceil($maskLen / $mgfHash->getLength());
         for ($i = 0; $i < $count; ++$i) {
             $c = pack('N', $i);
-            $t .= $mgfHash->hash($mgfSeed . $c);
+            $t .= $mgfHash->hash($mgfSeed);
         }
         return mb_substr($t, 0, $maskLen, '8bit');
     }

201) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:119    [M] Assignment

--- Original
+++ New
@@ @@
         $count = ceil($maskLen / $mgfHash->getLength());
         for ($i = 0; $i < $count; ++$i) {
             $c = pack('N', $i);
-            $t .= $mgfHash->hash($mgfSeed . $c);
+            $t = $mgfHash->hash($mgfSeed . $c);
         }
         return mb_substr($t, 0, $maskLen, '8bit');
     }

202) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:122    [M] DecrementInteger

--- Original
+++ New
@@ @@
             $c = pack('N', $i);
             $t .= $mgfHash->hash($mgfSeed . $c);
         }
-        return mb_substr($t, 0, $maskLen, '8bit');
+        return mb_substr($t, -1, $maskLen, '8bit');
     }
     /**
      * EMSA-PSS-ENCODE.

203) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:122    [M] IncrementInteger

--- Original
+++ New
@@ @@
             $c = pack('N', $i);
             $t .= $mgfHash->hash($mgfSeed . $c);
         }
-        return mb_substr($t, 0, $maskLen, '8bit');
+        return mb_substr($t, 1, $maskLen, '8bit');
     }
     /**
      * EMSA-PSS-ENCODE.

204) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:122    [M] MBString

--- Original
+++ New
@@ @@
             $c = pack('N', $i);
             $t .= $mgfHash->hash($mgfSeed . $c);
         }
-        return mb_substr($t, 0, $maskLen, '8bit');
+        return substr($t, 0, $maskLen);
     }
     /**
      * EMSA-PSS-ENCODE.

205) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:130    [M] DecrementInteger

--- Original
+++ New
@@ @@
      */
     private function encodeEMSAPSS(string $message, int $modulusLength, Hash $hash) : string
     {
-        $emLen = $modulusLength + 1 >> 3;
+        $emLen = $modulusLength + 0 >> 3;
         $sLen = $hash->getLength();
         $mHash = $hash->hash($message);
         if ($emLen <= $hash->getLength() + $sLen + 2) {

206) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:130    [M] IncrementInteger

--- Original
+++ New
@@ @@
      */
     private function encodeEMSAPSS(string $message, int $modulusLength, Hash $hash) : string
     {
-        $emLen = $modulusLength + 1 >> 3;
+        $emLen = $modulusLength + 2 >> 3;
         $sLen = $hash->getLength();
         $mHash = $hash->hash($message);
         if ($emLen <= $hash->getLength() + $sLen + 2) {

207) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:130    [M] Plus

--- Original
+++ New
@@ @@
      */
     private function encodeEMSAPSS(string $message, int $modulusLength, Hash $hash) : string
     {
-        $emLen = $modulusLength + 1 >> 3;
+        $emLen = $modulusLength - 1 >> 3;
         $sLen = $hash->getLength();
         $mHash = $hash->hash($message);
         if ($emLen <= $hash->getLength() + $sLen + 2) {

208) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:130    [M] DecrementInteger

--- Original
+++ New
@@ @@
      */
     private function encodeEMSAPSS(string $message, int $modulusLength, Hash $hash) : string
     {
-        $emLen = $modulusLength + 1 >> 3;
+        $emLen = $modulusLength + 1 >> 2;
         $sLen = $hash->getLength();
         $mHash = $hash->hash($message);
         if ($emLen <= $hash->getLength() + $sLen + 2) {

209) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:130    [M] IncrementInteger

--- Original
+++ New
@@ @@
      */
     private function encodeEMSAPSS(string $message, int $modulusLength, Hash $hash) : string
     {
-        $emLen = $modulusLength + 1 >> 3;
+        $emLen = $modulusLength + 1 >> 4;
         $sLen = $hash->getLength();
         $mHash = $hash->hash($message);
         if ($emLen <= $hash->getLength() + $sLen + 2) {

210) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:130    [M] ShiftRight

--- Original
+++ New
@@ @@
      */
     private function encodeEMSAPSS(string $message, int $modulusLength, Hash $hash) : string
     {
-        $emLen = $modulusLength + 1 >> 3;
+        $emLen = $modulusLength + 1 << 3;
         $sLen = $hash->getLength();
         $mHash = $hash->hash($message);
         if ($emLen <= $hash->getLength() + $sLen + 2) {

211) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:133    [M] Plus

--- Original
+++ New
@@ @@
         $emLen = $modulusLength + 1 >> 3;
         $sLen = $hash->getLength();
         $mHash = $hash->hash($message);
-        if ($emLen <= $hash->getLength() + $sLen + 2) {
+        if ($emLen <= $hash->getLength() - $sLen + 2) {
             throw new RuntimeException();
         }
         $salt = random_bytes($sLen);

212) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:133    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $emLen = $modulusLength + 1 >> 3;
         $sLen = $hash->getLength();
         $mHash = $hash->hash($message);
-        if ($emLen <= $hash->getLength() + $sLen + 2) {
+        if ($emLen <= $hash->getLength() + $sLen + 1) {
             throw new RuntimeException();
         }
         $salt = random_bytes($sLen);

213) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:133    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $emLen = $modulusLength + 1 >> 3;
         $sLen = $hash->getLength();
         $mHash = $hash->hash($message);
-        if ($emLen <= $hash->getLength() + $sLen + 2) {
+        if ($emLen <= $hash->getLength() + $sLen + 3) {
             throw new RuntimeException();
         }
         $salt = random_bytes($sLen);

214) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:133    [M] Plus

--- Original
+++ New
@@ @@
         $emLen = $modulusLength + 1 >> 3;
         $sLen = $hash->getLength();
         $mHash = $hash->hash($message);
-        if ($emLen <= $hash->getLength() + $sLen + 2) {
+        if ($emLen <= $hash->getLength() + $sLen - 2) {
             throw new RuntimeException();
         }
         $salt = random_bytes($sLen);

215) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:133    [M] LessThanOrEqualTo

--- Original
+++ New
@@ @@
         $emLen = $modulusLength + 1 >> 3;
         $sLen = $hash->getLength();
         $mHash = $hash->hash($message);
-        if ($emLen <= $hash->getLength() + $sLen + 2) {
+        if ($emLen < $hash->getLength() + $sLen + 2) {
             throw new RuntimeException();
         }
         $salt = random_bytes($sLen);
