216) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:133    [M] LessThanOrEqualToNegotiation

--- Original
+++ New
@@ @@
         $emLen = $modulusLength + 1 >> 3;
         $sLen = $hash->getLength();
         $mHash = $hash->hash($message);
-        if ($emLen <= $hash->getLength() + $sLen + 2) {
+        if ($emLen > $hash->getLength() + $sLen + 2) {
             throw new RuntimeException();
         }
         $salt = random_bytes($sLen);

217) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:134    [M] Throw_

--- Original
+++ New
@@ @@
         $sLen = $hash->getLength();
         $mHash = $hash->hash($message);
         if ($emLen <= $hash->getLength() + $sLen + 2) {
-            throw new RuntimeException();
+            new RuntimeException();
         }
         $salt = random_bytes($sLen);
         $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $mHash . $salt;

218) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:137    [M] Concat

--- Original
+++ New
@@ @@
             throw new RuntimeException();
         }
         $salt = random_bytes($sLen);
-        $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $mHash . $salt;
+        $m2 = $mHash . "\x00\x00\x00\x00\x00\x00\x00\x00" . $salt;
         $h = $hash->hash($m2);
         $ps = str_repeat(chr(0), $emLen - $sLen - $hash->getLength() - 2);
         $db = $ps . chr(1) . $salt;

219) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:137    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             throw new RuntimeException();
         }
         $salt = random_bytes($sLen);
-        $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $mHash . $salt;
+        $m2 = $mHash . $salt;
         $h = $hash->hash($m2);
         $ps = str_repeat(chr(0), $emLen - $sLen - $hash->getLength() - 2);
         $db = $ps . chr(1) . $salt;

220) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:137    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             throw new RuntimeException();
         }
         $salt = random_bytes($sLen);
-        $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $mHash . $salt;
+        $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $salt;
         $h = $hash->hash($m2);
         $ps = str_repeat(chr(0), $emLen - $sLen - $hash->getLength() - 2);
         $db = $ps . chr(1) . $salt;

221) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:137    [M] Concat

--- Original
+++ New
@@ @@
             throw new RuntimeException();
         }
         $salt = random_bytes($sLen);
-        $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $mHash . $salt;
+        $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $salt . $mHash;
         $h = $hash->hash($m2);
         $ps = str_repeat(chr(0), $emLen - $sLen - $hash->getLength() - 2);
         $db = $ps . chr(1) . $salt;

222) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:137    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             throw new RuntimeException();
         }
         $salt = random_bytes($sLen);
-        $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $mHash . $salt;
+        $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $mHash;
         $h = $hash->hash($m2);
         $ps = str_repeat(chr(0), $emLen - $sLen - $hash->getLength() - 2);
         $db = $ps . chr(1) . $salt;

223) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:139    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $salt = random_bytes($sLen);
         $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $mHash . $salt;
         $h = $hash->hash($m2);
-        $ps = str_repeat(chr(0), $emLen - $sLen - $hash->getLength() - 2);
+        $ps = str_repeat(chr(-1), $emLen - $sLen - $hash->getLength() - 2);
         $db = $ps . chr(1) . $salt;
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $maskedDB = $db ^ $dbMask;

224) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:139    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $salt = random_bytes($sLen);
         $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $mHash . $salt;
         $h = $hash->hash($m2);
-        $ps = str_repeat(chr(0), $emLen - $sLen - $hash->getLength() - 2);
+        $ps = str_repeat(chr(1), $emLen - $sLen - $hash->getLength() - 2);
         $db = $ps . chr(1) . $salt;
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $maskedDB = $db ^ $dbMask;

225) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:139    [M] Minus

--- Original
+++ New
@@ @@
         $salt = random_bytes($sLen);
         $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $mHash . $salt;
         $h = $hash->hash($m2);
-        $ps = str_repeat(chr(0), $emLen - $sLen - $hash->getLength() - 2);
+        $ps = str_repeat(chr(0), $emLen + $sLen - $hash->getLength() - 2);
         $db = $ps . chr(1) . $salt;
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $maskedDB = $db ^ $dbMask;

226) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:139    [M] Minus

--- Original
+++ New
@@ @@
         $salt = random_bytes($sLen);
         $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $mHash . $salt;
         $h = $hash->hash($m2);
-        $ps = str_repeat(chr(0), $emLen - $sLen - $hash->getLength() - 2);
+        $ps = str_repeat(chr(0), $emLen - $sLen + $hash->getLength() - 2);
         $db = $ps . chr(1) . $salt;
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $maskedDB = $db ^ $dbMask;

227) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:139    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $salt = random_bytes($sLen);
         $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $mHash . $salt;
         $h = $hash->hash($m2);
-        $ps = str_repeat(chr(0), $emLen - $sLen - $hash->getLength() - 2);
+        $ps = str_repeat(chr(0), $emLen - $sLen - $hash->getLength() - 1);
         $db = $ps . chr(1) . $salt;
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $maskedDB = $db ^ $dbMask;

228) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:139    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $salt = random_bytes($sLen);
         $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $mHash . $salt;
         $h = $hash->hash($m2);
-        $ps = str_repeat(chr(0), $emLen - $sLen - $hash->getLength() - 2);
+        $ps = str_repeat(chr(0), $emLen - $sLen - $hash->getLength() - 3);
         $db = $ps . chr(1) . $salt;
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $maskedDB = $db ^ $dbMask;

229) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:139    [M] Minus

--- Original
+++ New
@@ @@
         $salt = random_bytes($sLen);
         $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $mHash . $salt;
         $h = $hash->hash($m2);
-        $ps = str_repeat(chr(0), $emLen - $sLen - $hash->getLength() - 2);
+        $ps = str_repeat(chr(0), $emLen - $sLen - $hash->getLength() + 2);
         $db = $ps . chr(1) . $salt;
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $maskedDB = $db ^ $dbMask;

230) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:139    [M] UnwrapStrRepeat

--- Original
+++ New
@@ @@
         $salt = random_bytes($sLen);
         $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $mHash . $salt;
         $h = $hash->hash($m2);
-        $ps = str_repeat(chr(0), $emLen - $sLen - $hash->getLength() - 2);
+        $ps = chr(0);
         $db = $ps . chr(1) . $salt;
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $maskedDB = $db ^ $dbMask;

231) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:140    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $mHash . $salt;
         $h = $hash->hash($m2);
         $ps = str_repeat(chr(0), $emLen - $sLen - $hash->getLength() - 2);
-        $db = $ps . chr(1) . $salt;
+        $db = $ps . chr(0) . $salt;
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $maskedDB = $db ^ $dbMask;
         $maskedDB[0] = ~chr(0xff << ($modulusLength & 7)) & $maskedDB[0];

232) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:140    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $mHash . $salt;
         $h = $hash->hash($m2);
         $ps = str_repeat(chr(0), $emLen - $sLen - $hash->getLength() - 2);
-        $db = $ps . chr(1) . $salt;
+        $db = $ps . chr(2) . $salt;
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $maskedDB = $db ^ $dbMask;
         $maskedDB[0] = ~chr(0xff << ($modulusLength & 7)) & $maskedDB[0];

233) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:140    [M] Concat

--- Original
+++ New
@@ @@
         $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $mHash . $salt;
         $h = $hash->hash($m2);
         $ps = str_repeat(chr(0), $emLen - $sLen - $hash->getLength() - 2);
-        $db = $ps . chr(1) . $salt;
+        $db = chr(1) . $ps . $salt;
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $maskedDB = $db ^ $dbMask;
         $maskedDB[0] = ~chr(0xff << ($modulusLength & 7)) & $maskedDB[0];

234) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:140    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $mHash . $salt;
         $h = $hash->hash($m2);
         $ps = str_repeat(chr(0), $emLen - $sLen - $hash->getLength() - 2);
-        $db = $ps . chr(1) . $salt;
+        $db = chr(1) . $salt;
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $maskedDB = $db ^ $dbMask;
         $maskedDB[0] = ~chr(0xff << ($modulusLength & 7)) & $maskedDB[0];

235) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:140    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $mHash . $salt;
         $h = $hash->hash($m2);
         $ps = str_repeat(chr(0), $emLen - $sLen - $hash->getLength() - 2);
-        $db = $ps . chr(1) . $salt;
+        $db = $ps . $salt;
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $maskedDB = $db ^ $dbMask;
         $maskedDB[0] = ~chr(0xff << ($modulusLength & 7)) & $maskedDB[0];

236) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:140    [M] Concat

--- Original
+++ New
@@ @@
         $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $mHash . $salt;
         $h = $hash->hash($m2);
         $ps = str_repeat(chr(0), $emLen - $sLen - $hash->getLength() - 2);
-        $db = $ps . chr(1) . $salt;
+        $db = $ps . $salt . chr(1);
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $maskedDB = $db ^ $dbMask;
         $maskedDB[0] = ~chr(0xff << ($modulusLength & 7)) & $maskedDB[0];

237) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:140    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $mHash . $salt;
         $h = $hash->hash($m2);
         $ps = str_repeat(chr(0), $emLen - $sLen - $hash->getLength() - 2);
-        $db = $ps . chr(1) . $salt;
+        $db = $ps . chr(1);
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $maskedDB = $db ^ $dbMask;
         $maskedDB[0] = ~chr(0xff << ($modulusLength & 7)) & $maskedDB[0];

238) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:141    [M] Minus

--- Original
+++ New
@@ @@
         $h = $hash->hash($m2);
         $ps = str_repeat(chr(0), $emLen - $sLen - $hash->getLength() - 2);
         $db = $ps . chr(1) . $salt;
-        $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
+        $dbMask = $this->getMGF1($h, $emLen + $hash->getLength() - 1, $hash);
         $maskedDB = $db ^ $dbMask;
         $maskedDB[0] = ~chr(0xff << ($modulusLength & 7)) & $maskedDB[0];
         return $maskedDB . $h . chr(0xbc);

239) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:141    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $h = $hash->hash($m2);
         $ps = str_repeat(chr(0), $emLen - $sLen - $hash->getLength() - 2);
         $db = $ps . chr(1) . $salt;
-        $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
+        $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 0, $hash);
         $maskedDB = $db ^ $dbMask;
         $maskedDB[0] = ~chr(0xff << ($modulusLength & 7)) & $maskedDB[0];
         return $maskedDB . $h . chr(0xbc);

240) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:141    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $h = $hash->hash($m2);
         $ps = str_repeat(chr(0), $emLen - $sLen - $hash->getLength() - 2);
         $db = $ps . chr(1) . $salt;
-        $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
+        $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 2, $hash);
         $maskedDB = $db ^ $dbMask;
         $maskedDB[0] = ~chr(0xff << ($modulusLength & 7)) & $maskedDB[0];
         return $maskedDB . $h . chr(0xbc);

241) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:141    [M] Minus

--- Original
+++ New
@@ @@
         $h = $hash->hash($m2);
         $ps = str_repeat(chr(0), $emLen - $sLen - $hash->getLength() - 2);
         $db = $ps . chr(1) . $salt;
-        $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
+        $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() + 1, $hash);
         $maskedDB = $db ^ $dbMask;
         $maskedDB[0] = ~chr(0xff << ($modulusLength & 7)) & $maskedDB[0];
         return $maskedDB . $h . chr(0xbc);

242) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:142    [M] BitwiseXor

--- Original
+++ New
@@ @@
         $ps = str_repeat(chr(0), $emLen - $sLen - $hash->getLength() - 2);
         $db = $ps . chr(1) . $salt;
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
-        $maskedDB = $db ^ $dbMask;
+        $maskedDB = $db & $dbMask;
         $maskedDB[0] = ~chr(0xff << ($modulusLength & 7)) & $maskedDB[0];
         return $maskedDB . $h . chr(0xbc);
     }

243) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:143    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $db = $ps . chr(1) . $salt;
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $maskedDB = $db ^ $dbMask;
-        $maskedDB[0] = ~chr(0xff << ($modulusLength & 7)) & $maskedDB[0];
+        $maskedDB[1] = ~chr(0xff << ($modulusLength & 7)) & $maskedDB[0];
         return $maskedDB . $h . chr(0xbc);
     }
     /**

244) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:143    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $db = $ps . chr(1) . $salt;
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $maskedDB = $db ^ $dbMask;
-        $maskedDB[0] = ~chr(0xff << ($modulusLength & 7)) & $maskedDB[0];
+        $maskedDB[0] = ~chr(254 << ($modulusLength & 7)) & $maskedDB[0];
         return $maskedDB . $h . chr(0xbc);
     }
     /**

245) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:143    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $db = $ps . chr(1) . $salt;
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $maskedDB = $db ^ $dbMask;
-        $maskedDB[0] = ~chr(0xff << ($modulusLength & 7)) & $maskedDB[0];
+        $maskedDB[0] = ~chr(256 << ($modulusLength & 7)) & $maskedDB[0];
         return $maskedDB . $h . chr(0xbc);
     }
     /**

246) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:143    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $db = $ps . chr(1) . $salt;
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $maskedDB = $db ^ $dbMask;
-        $maskedDB[0] = ~chr(0xff << ($modulusLength & 7)) & $maskedDB[0];
+        $maskedDB[0] = ~chr(0xff << ($modulusLength & 6)) & $maskedDB[0];
         return $maskedDB . $h . chr(0xbc);
     }
     /**

247) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:143    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $db = $ps . chr(1) . $salt;
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $maskedDB = $db ^ $dbMask;
-        $maskedDB[0] = ~chr(0xff << ($modulusLength & 7)) & $maskedDB[0];
+        $maskedDB[0] = ~chr(0xff << ($modulusLength & 8)) & $maskedDB[0];
         return $maskedDB . $h . chr(0xbc);
     }
     /**

248) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:143    [M] BitwiseAnd

--- Original
+++ New
@@ @@
         $db = $ps . chr(1) . $salt;
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $maskedDB = $db ^ $dbMask;
-        $maskedDB[0] = ~chr(0xff << ($modulusLength & 7)) & $maskedDB[0];
+        $maskedDB[0] = ~chr(0xff << ($modulusLength | 7)) & $maskedDB[0];
         return $maskedDB . $h . chr(0xbc);
     }
     /**

249) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:143    [M] ShiftLeft

--- Original
+++ New
@@ @@
         $db = $ps . chr(1) . $salt;
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $maskedDB = $db ^ $dbMask;
-        $maskedDB[0] = ~chr(0xff << ($modulusLength & 7)) & $maskedDB[0];
+        $maskedDB[0] = ~chr(0xff >> ($modulusLength & 7)) & $maskedDB[0];
         return $maskedDB . $h . chr(0xbc);
     }
     /**

250) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:143    [M] BitwiseNot

--- Original
+++ New
@@ @@
         $db = $ps . chr(1) . $salt;
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $maskedDB = $db ^ $dbMask;
-        $maskedDB[0] = ~chr(0xff << ($modulusLength & 7)) & $maskedDB[0];
+        $maskedDB[0] = chr(0xff << ($modulusLength & 7)) & $maskedDB[0];
         return $maskedDB . $h . chr(0xbc);
     }
     /**

251) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:143    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $db = $ps . chr(1) . $salt;
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $maskedDB = $db ^ $dbMask;
-        $maskedDB[0] = ~chr(0xff << ($modulusLength & 7)) & $maskedDB[0];
+        $maskedDB[0] = ~chr(0xff << ($modulusLength & 7)) & $maskedDB[1];
         return $maskedDB . $h . chr(0xbc);
     }
     /**

252) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:143    [M] BitwiseAnd

--- Original
+++ New
@@ @@
         $db = $ps . chr(1) . $salt;
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $maskedDB = $db ^ $dbMask;
-        $maskedDB[0] = ~chr(0xff << ($modulusLength & 7)) & $maskedDB[0];
+        $maskedDB[0] = ~chr(0xff << ($modulusLength & 7)) | $maskedDB[0];
         return $maskedDB . $h . chr(0xbc);
     }
     /**

253) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:145    [M] Concat

--- Original
+++ New
@@ @@
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $maskedDB = $db ^ $dbMask;
         $maskedDB[0] = ~chr(0xff << ($modulusLength & 7)) & $maskedDB[0];
-        return $maskedDB . $h . chr(0xbc);
+        return $h . $maskedDB . chr(0xbc);
     }
     /**
      * EMSA-PSS-VERIFY.

254) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:145    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $maskedDB = $db ^ $dbMask;
         $maskedDB[0] = ~chr(0xff << ($modulusLength & 7)) & $maskedDB[0];
-        return $maskedDB . $h . chr(0xbc);
+        return $h . chr(0xbc);
     }
     /**
      * EMSA-PSS-VERIFY.

255) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:145    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $maskedDB = $db ^ $dbMask;
         $maskedDB[0] = ~chr(0xff << ($modulusLength & 7)) & $maskedDB[0];
-        return $maskedDB . $h . chr(0xbc);
+        return $maskedDB . chr(0xbc);
     }
     /**
      * EMSA-PSS-VERIFY.

256) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:145    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $maskedDB = $db ^ $dbMask;
         $maskedDB[0] = ~chr(0xff << ($modulusLength & 7)) & $maskedDB[0];
-        return $maskedDB . $h . chr(0xbc);
+        return $maskedDB . $h . chr(187);
     }
     /**
      * EMSA-PSS-VERIFY.

257) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:145    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $maskedDB = $db ^ $dbMask;
         $maskedDB[0] = ~chr(0xff << ($modulusLength & 7)) & $maskedDB[0];
-        return $maskedDB . $h . chr(0xbc);
+        return $maskedDB . $h . chr(189);
     }
     /**
      * EMSA-PSS-VERIFY.

258) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:145    [M] Concat

--- Original
+++ New
@@ @@
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $maskedDB = $db ^ $dbMask;
         $maskedDB[0] = ~chr(0xff << ($modulusLength & 7)) & $maskedDB[0];
-        return $maskedDB . $h . chr(0xbc);
+        return $maskedDB . chr(0xbc) . $h;
     }
     /**
      * EMSA-PSS-VERIFY.

259) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:145    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $maskedDB = $db ^ $dbMask;
         $maskedDB[0] = ~chr(0xff << ($modulusLength & 7)) & $maskedDB[0];
-        return $maskedDB . $h . chr(0xbc);
+        return $maskedDB . $h;
     }
     /**
      * EMSA-PSS-VERIFY.

260) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:153    [M] DecrementInteger

--- Original
+++ New
@@ @@
      */
     private function verifyEMSAPSS(string $m, string $em, int $emBits, Hash $hash) : bool
     {
-        $emLen = $emBits + 1 >> 3;
+        $emLen = $emBits + 0 >> 3;
         $sLen = $hash->getLength();
         $mHash = $hash->hash($m);
         if ($emLen < $hash->getLength() + $sLen + 2) {

261) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:153    [M] IncrementInteger

--- Original
+++ New
@@ @@
      */
     private function verifyEMSAPSS(string $m, string $em, int $emBits, Hash $hash) : bool
     {
-        $emLen = $emBits + 1 >> 3;
+        $emLen = $emBits + 2 >> 3;
         $sLen = $hash->getLength();
         $mHash = $hash->hash($m);
         if ($emLen < $hash->getLength() + $sLen + 2) {

262) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:153    [M] Plus

--- Original
+++ New
@@ @@
      */
     private function verifyEMSAPSS(string $m, string $em, int $emBits, Hash $hash) : bool
     {
-        $emLen = $emBits + 1 >> 3;
+        $emLen = $emBits - 1 >> 3;
         $sLen = $hash->getLength();
         $mHash = $hash->hash($m);
         if ($emLen < $hash->getLength() + $sLen + 2) {

263) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:153    [M] DecrementInteger

--- Original
+++ New
@@ @@
      */
     private function verifyEMSAPSS(string $m, string $em, int $emBits, Hash $hash) : bool
     {
-        $emLen = $emBits + 1 >> 3;
+        $emLen = $emBits + 1 >> 2;
         $sLen = $hash->getLength();
         $mHash = $hash->hash($m);
         if ($emLen < $hash->getLength() + $sLen + 2) {

264) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:153    [M] IncrementInteger

--- Original
+++ New
@@ @@
      */
     private function verifyEMSAPSS(string $m, string $em, int $emBits, Hash $hash) : bool
     {
-        $emLen = $emBits + 1 >> 3;
+        $emLen = $emBits + 1 >> 4;
         $sLen = $hash->getLength();
         $mHash = $hash->hash($m);
         if ($emLen < $hash->getLength() + $sLen + 2) {

265) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:153    [M] ShiftRight

--- Original
+++ New
@@ @@
      */
     private function verifyEMSAPSS(string $m, string $em, int $emBits, Hash $hash) : bool
     {
-        $emLen = $emBits + 1 >> 3;
+        $emLen = $emBits + 1 << 3;
         $sLen = $hash->getLength();
         $mHash = $hash->hash($m);
         if ($emLen < $hash->getLength() + $sLen + 2) {

266) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:156    [M] Plus

--- Original
+++ New
@@ @@
         $emLen = $emBits + 1 >> 3;
         $sLen = $hash->getLength();
         $mHash = $hash->hash($m);
-        if ($emLen < $hash->getLength() + $sLen + 2) {
+        if ($emLen < $hash->getLength() - $sLen + 2) {
             throw new InvalidArgumentException();
         }
         if ($em[mb_strlen($em, '8bit') - 1] !== chr(0xbc)) {

267) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:156    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $emLen = $emBits + 1 >> 3;
         $sLen = $hash->getLength();
         $mHash = $hash->hash($m);
-        if ($emLen < $hash->getLength() + $sLen + 2) {
+        if ($emLen < $hash->getLength() + $sLen + 1) {
             throw new InvalidArgumentException();
         }
         if ($em[mb_strlen($em, '8bit') - 1] !== chr(0xbc)) {

268) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:156    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $emLen = $emBits + 1 >> 3;
         $sLen = $hash->getLength();
         $mHash = $hash->hash($m);
-        if ($emLen < $hash->getLength() + $sLen + 2) {
+        if ($emLen < $hash->getLength() + $sLen + 3) {
             throw new InvalidArgumentException();
         }
         if ($em[mb_strlen($em, '8bit') - 1] !== chr(0xbc)) {

269) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:156    [M] Plus

--- Original
+++ New
@@ @@
         $emLen = $emBits + 1 >> 3;
         $sLen = $hash->getLength();
         $mHash = $hash->hash($m);
-        if ($emLen < $hash->getLength() + $sLen + 2) {
+        if ($emLen < $hash->getLength() + $sLen - 2) {
             throw new InvalidArgumentException();
         }
         if ($em[mb_strlen($em, '8bit') - 1] !== chr(0xbc)) {

270) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:156    [M] LessThan

--- Original
+++ New
@@ @@
         $emLen = $emBits + 1 >> 3;
         $sLen = $hash->getLength();
         $mHash = $hash->hash($m);
-        if ($emLen < $hash->getLength() + $sLen + 2) {
+        if ($emLen <= $hash->getLength() + $sLen + 2) {
             throw new InvalidArgumentException();
         }
         if ($em[mb_strlen($em, '8bit') - 1] !== chr(0xbc)) {

271) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:156    [M] LessThanNegotiation

--- Original
+++ New
@@ @@
         $emLen = $emBits + 1 >> 3;
         $sLen = $hash->getLength();
         $mHash = $hash->hash($m);
-        if ($emLen < $hash->getLength() + $sLen + 2) {
+        if ($emLen >= $hash->getLength() + $sLen + 2) {
             throw new InvalidArgumentException();
         }
         if ($em[mb_strlen($em, '8bit') - 1] !== chr(0xbc)) {

272) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:157    [M] Throw_

--- Original
+++ New
@@ @@
         $sLen = $hash->getLength();
         $mHash = $hash->hash($m);
         if ($emLen < $hash->getLength() + $sLen + 2) {
-            throw new InvalidArgumentException();
+            new InvalidArgumentException();
         }
         if ($em[mb_strlen($em, '8bit') - 1] !== chr(0xbc)) {
             throw new InvalidArgumentException();

273) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:159    [M] MBString

--- Original
+++ New
@@ @@
         if ($emLen < $hash->getLength() + $sLen + 2) {
             throw new InvalidArgumentException();
         }
-        if ($em[mb_strlen($em, '8bit') - 1] !== chr(0xbc)) {
+        if ($em[strlen($em) - 1] !== chr(0xbc)) {
             throw new InvalidArgumentException();
         }
         $maskedDB = mb_substr($em, 0, -$hash->getLength() - 1, '8bit');
