274) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:159    [M] DecrementInteger

--- Original
+++ New
@@ @@
         if ($emLen < $hash->getLength() + $sLen + 2) {
             throw new InvalidArgumentException();
         }
-        if ($em[mb_strlen($em, '8bit') - 1] !== chr(0xbc)) {
+        if ($em[mb_strlen($em, '8bit') - 0] !== chr(0xbc)) {
             throw new InvalidArgumentException();
         }
         $maskedDB = mb_substr($em, 0, -$hash->getLength() - 1, '8bit');

275) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:159    [M] IncrementInteger

--- Original
+++ New
@@ @@
         if ($emLen < $hash->getLength() + $sLen + 2) {
             throw new InvalidArgumentException();
         }
-        if ($em[mb_strlen($em, '8bit') - 1] !== chr(0xbc)) {
+        if ($em[mb_strlen($em, '8bit') - 2] !== chr(0xbc)) {
             throw new InvalidArgumentException();
         }
         $maskedDB = mb_substr($em, 0, -$hash->getLength() - 1, '8bit');

276) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:159    [M] Minus

--- Original
+++ New
@@ @@
         if ($emLen < $hash->getLength() + $sLen + 2) {
             throw new InvalidArgumentException();
         }
-        if ($em[mb_strlen($em, '8bit') - 1] !== chr(0xbc)) {
+        if ($em[mb_strlen($em, '8bit') + 1] !== chr(0xbc)) {
             throw new InvalidArgumentException();
         }
         $maskedDB = mb_substr($em, 0, -$hash->getLength() - 1, '8bit');

277) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:159    [M] DecrementInteger

--- Original
+++ New
@@ @@
         if ($emLen < $hash->getLength() + $sLen + 2) {
             throw new InvalidArgumentException();
         }
-        if ($em[mb_strlen($em, '8bit') - 1] !== chr(0xbc)) {
+        if ($em[mb_strlen($em, '8bit') - 1] !== chr(187)) {
             throw new InvalidArgumentException();
         }
         $maskedDB = mb_substr($em, 0, -$hash->getLength() - 1, '8bit');

278) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:159    [M] IncrementInteger

--- Original
+++ New
@@ @@
         if ($emLen < $hash->getLength() + $sLen + 2) {
             throw new InvalidArgumentException();
         }
-        if ($em[mb_strlen($em, '8bit') - 1] !== chr(0xbc)) {
+        if ($em[mb_strlen($em, '8bit') - 1] !== chr(189)) {
             throw new InvalidArgumentException();
         }
         $maskedDB = mb_substr($em, 0, -$hash->getLength() - 1, '8bit');

279) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:159    [M] NotIdentical

--- Original
+++ New
@@ @@
         if ($emLen < $hash->getLength() + $sLen + 2) {
             throw new InvalidArgumentException();
         }
-        if ($em[mb_strlen($em, '8bit') - 1] !== chr(0xbc)) {
+        if ($em[mb_strlen($em, '8bit') - 1] === chr(0xbc)) {
             throw new InvalidArgumentException();
         }
         $maskedDB = mb_substr($em, 0, -$hash->getLength() - 1, '8bit');

280) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:160    [M] Throw_

--- Original
+++ New
@@ @@
             throw new InvalidArgumentException();
         }
         if ($em[mb_strlen($em, '8bit') - 1] !== chr(0xbc)) {
-            throw new InvalidArgumentException();
+            new InvalidArgumentException();
         }
         $maskedDB = mb_substr($em, 0, -$hash->getLength() - 1, '8bit');
         $h = mb_substr($em, -$hash->getLength() - 1, $hash->getLength(), '8bit');

281) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:162    [M] DecrementInteger

--- Original
+++ New
@@ @@
         if ($em[mb_strlen($em, '8bit') - 1] !== chr(0xbc)) {
             throw new InvalidArgumentException();
         }
-        $maskedDB = mb_substr($em, 0, -$hash->getLength() - 1, '8bit');
+        $maskedDB = mb_substr($em, -1, -$hash->getLength() - 1, '8bit');
         $h = mb_substr($em, -$hash->getLength() - 1, $hash->getLength(), '8bit');
         $temp = chr(0xff << ($emBits & 7));
         if ((~$maskedDB[0] & $temp) !== $temp) {

282) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:162    [M] IncrementInteger

--- Original
+++ New
@@ @@
         if ($em[mb_strlen($em, '8bit') - 1] !== chr(0xbc)) {
             throw new InvalidArgumentException();
         }
-        $maskedDB = mb_substr($em, 0, -$hash->getLength() - 1, '8bit');
+        $maskedDB = mb_substr($em, 1, -$hash->getLength() - 1, '8bit');
         $h = mb_substr($em, -$hash->getLength() - 1, $hash->getLength(), '8bit');
         $temp = chr(0xff << ($emBits & 7));
         if ((~$maskedDB[0] & $temp) !== $temp) {

283) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:162    [M] DecrementInteger

--- Original
+++ New
@@ @@
         if ($em[mb_strlen($em, '8bit') - 1] !== chr(0xbc)) {
             throw new InvalidArgumentException();
         }
-        $maskedDB = mb_substr($em, 0, -$hash->getLength() - 1, '8bit');
+        $maskedDB = mb_substr($em, 0, -$hash->getLength() - 0, '8bit');
         $h = mb_substr($em, -$hash->getLength() - 1, $hash->getLength(), '8bit');
         $temp = chr(0xff << ($emBits & 7));
         if ((~$maskedDB[0] & $temp) !== $temp) {

284) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:162    [M] IncrementInteger

--- Original
+++ New
@@ @@
         if ($em[mb_strlen($em, '8bit') - 1] !== chr(0xbc)) {
             throw new InvalidArgumentException();
         }
-        $maskedDB = mb_substr($em, 0, -$hash->getLength() - 1, '8bit');
+        $maskedDB = mb_substr($em, 0, -$hash->getLength() - 2, '8bit');
         $h = mb_substr($em, -$hash->getLength() - 1, $hash->getLength(), '8bit');
         $temp = chr(0xff << ($emBits & 7));
         if ((~$maskedDB[0] & $temp) !== $temp) {

285) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:162    [M] Minus

--- Original
+++ New
@@ @@
         if ($em[mb_strlen($em, '8bit') - 1] !== chr(0xbc)) {
             throw new InvalidArgumentException();
         }
-        $maskedDB = mb_substr($em, 0, -$hash->getLength() - 1, '8bit');
+        $maskedDB = mb_substr($em, 0, -$hash->getLength() + 1, '8bit');
         $h = mb_substr($em, -$hash->getLength() - 1, $hash->getLength(), '8bit');
         $temp = chr(0xff << ($emBits & 7));
         if ((~$maskedDB[0] & $temp) !== $temp) {

286) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:162    [M] MBString

--- Original
+++ New
@@ @@
         if ($em[mb_strlen($em, '8bit') - 1] !== chr(0xbc)) {
             throw new InvalidArgumentException();
         }
-        $maskedDB = mb_substr($em, 0, -$hash->getLength() - 1, '8bit');
+        $maskedDB = substr($em, 0, -$hash->getLength() - 1);
         $h = mb_substr($em, -$hash->getLength() - 1, $hash->getLength(), '8bit');
         $temp = chr(0xff << ($emBits & 7));
         if ((~$maskedDB[0] & $temp) !== $temp) {

287) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:163    [M] DecrementInteger

--- Original
+++ New
@@ @@
             throw new InvalidArgumentException();
         }
         $maskedDB = mb_substr($em, 0, -$hash->getLength() - 1, '8bit');
-        $h = mb_substr($em, -$hash->getLength() - 1, $hash->getLength(), '8bit');
+        $h = mb_substr($em, -$hash->getLength() - 0, $hash->getLength(), '8bit');
         $temp = chr(0xff << ($emBits & 7));
         if ((~$maskedDB[0] & $temp) !== $temp) {
             throw new InvalidArgumentException();

288) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:163    [M] IncrementInteger

--- Original
+++ New
@@ @@
             throw new InvalidArgumentException();
         }
         $maskedDB = mb_substr($em, 0, -$hash->getLength() - 1, '8bit');
-        $h = mb_substr($em, -$hash->getLength() - 1, $hash->getLength(), '8bit');
+        $h = mb_substr($em, -$hash->getLength() - 2, $hash->getLength(), '8bit');
         $temp = chr(0xff << ($emBits & 7));
         if ((~$maskedDB[0] & $temp) !== $temp) {
             throw new InvalidArgumentException();

289) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:163    [M] Minus

--- Original
+++ New
@@ @@
             throw new InvalidArgumentException();
         }
         $maskedDB = mb_substr($em, 0, -$hash->getLength() - 1, '8bit');
-        $h = mb_substr($em, -$hash->getLength() - 1, $hash->getLength(), '8bit');
+        $h = mb_substr($em, -$hash->getLength() + 1, $hash->getLength(), '8bit');
         $temp = chr(0xff << ($emBits & 7));
         if ((~$maskedDB[0] & $temp) !== $temp) {
             throw new InvalidArgumentException();

290) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:163    [M] MBString

--- Original
+++ New
@@ @@
             throw new InvalidArgumentException();
         }
         $maskedDB = mb_substr($em, 0, -$hash->getLength() - 1, '8bit');
-        $h = mb_substr($em, -$hash->getLength() - 1, $hash->getLength(), '8bit');
+        $h = substr($em, -$hash->getLength() - 1, $hash->getLength());
         $temp = chr(0xff << ($emBits & 7));
         if ((~$maskedDB[0] & $temp) !== $temp) {
             throw new InvalidArgumentException();

291) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:164    [M] DecrementInteger

--- Original
+++ New
@@ @@
         }
         $maskedDB = mb_substr($em, 0, -$hash->getLength() - 1, '8bit');
         $h = mb_substr($em, -$hash->getLength() - 1, $hash->getLength(), '8bit');
-        $temp = chr(0xff << ($emBits & 7));
+        $temp = chr(254 << ($emBits & 7));
         if ((~$maskedDB[0] & $temp) !== $temp) {
             throw new InvalidArgumentException();
         }

292) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:164    [M] IncrementInteger

--- Original
+++ New
@@ @@
         }
         $maskedDB = mb_substr($em, 0, -$hash->getLength() - 1, '8bit');
         $h = mb_substr($em, -$hash->getLength() - 1, $hash->getLength(), '8bit');
-        $temp = chr(0xff << ($emBits & 7));
+        $temp = chr(256 << ($emBits & 7));
         if ((~$maskedDB[0] & $temp) !== $temp) {
             throw new InvalidArgumentException();
         }

293) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:164    [M] DecrementInteger

--- Original
+++ New
@@ @@
         }
         $maskedDB = mb_substr($em, 0, -$hash->getLength() - 1, '8bit');
         $h = mb_substr($em, -$hash->getLength() - 1, $hash->getLength(), '8bit');
-        $temp = chr(0xff << ($emBits & 7));
+        $temp = chr(0xff << ($emBits & 6));
         if ((~$maskedDB[0] & $temp) !== $temp) {
             throw new InvalidArgumentException();
         }

294) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:164    [M] IncrementInteger

--- Original
+++ New
@@ @@
         }
         $maskedDB = mb_substr($em, 0, -$hash->getLength() - 1, '8bit');
         $h = mb_substr($em, -$hash->getLength() - 1, $hash->getLength(), '8bit');
-        $temp = chr(0xff << ($emBits & 7));
+        $temp = chr(0xff << ($emBits & 8));
         if ((~$maskedDB[0] & $temp) !== $temp) {
             throw new InvalidArgumentException();
         }

295) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:164    [M] BitwiseAnd

--- Original
+++ New
@@ @@
         }
         $maskedDB = mb_substr($em, 0, -$hash->getLength() - 1, '8bit');
         $h = mb_substr($em, -$hash->getLength() - 1, $hash->getLength(), '8bit');
-        $temp = chr(0xff << ($emBits & 7));
+        $temp = chr(0xff << ($emBits | 7));
         if ((~$maskedDB[0] & $temp) !== $temp) {
             throw new InvalidArgumentException();
         }

296) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:164    [M] ShiftLeft

--- Original
+++ New
@@ @@
         }
         $maskedDB = mb_substr($em, 0, -$hash->getLength() - 1, '8bit');
         $h = mb_substr($em, -$hash->getLength() - 1, $hash->getLength(), '8bit');
-        $temp = chr(0xff << ($emBits & 7));
+        $temp = chr(0xff >> ($emBits & 7));
         if ((~$maskedDB[0] & $temp) !== $temp) {
             throw new InvalidArgumentException();
         }

297) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:165    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $maskedDB = mb_substr($em, 0, -$hash->getLength() - 1, '8bit');
         $h = mb_substr($em, -$hash->getLength() - 1, $hash->getLength(), '8bit');
         $temp = chr(0xff << ($emBits & 7));
-        if ((~$maskedDB[0] & $temp) !== $temp) {
+        if ((~$maskedDB[1] & $temp) !== $temp) {
             throw new InvalidArgumentException();
         }
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);

298) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:165    [M] BitwiseNot

--- Original
+++ New
@@ @@
         $maskedDB = mb_substr($em, 0, -$hash->getLength() - 1, '8bit');
         $h = mb_substr($em, -$hash->getLength() - 1, $hash->getLength(), '8bit');
         $temp = chr(0xff << ($emBits & 7));
-        if ((~$maskedDB[0] & $temp) !== $temp) {
+        if (($maskedDB[0] & $temp) !== $temp) {
             throw new InvalidArgumentException();
         }
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);

299) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:165    [M] BitwiseAnd

--- Original
+++ New
@@ @@
         $maskedDB = mb_substr($em, 0, -$hash->getLength() - 1, '8bit');
         $h = mb_substr($em, -$hash->getLength() - 1, $hash->getLength(), '8bit');
         $temp = chr(0xff << ($emBits & 7));
-        if ((~$maskedDB[0] & $temp) !== $temp) {
+        if ((~$maskedDB[0] | $temp) !== $temp) {
             throw new InvalidArgumentException();
         }
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);

300) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:165    [M] NotIdentical

--- Original
+++ New
@@ @@
         $maskedDB = mb_substr($em, 0, -$hash->getLength() - 1, '8bit');
         $h = mb_substr($em, -$hash->getLength() - 1, $hash->getLength(), '8bit');
         $temp = chr(0xff << ($emBits & 7));
-        if ((~$maskedDB[0] & $temp) !== $temp) {
+        if ((~$maskedDB[0] & $temp) === $temp) {
             throw new InvalidArgumentException();
         }
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);

301) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:166    [M] Throw_

--- Original
+++ New
@@ @@
         $h = mb_substr($em, -$hash->getLength() - 1, $hash->getLength(), '8bit');
         $temp = chr(0xff << ($emBits & 7));
         if ((~$maskedDB[0] & $temp) !== $temp) {
-            throw new InvalidArgumentException();
+            new InvalidArgumentException();
         }
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $db = $maskedDB ^ $dbMask;

302) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:168    [M] Minus

--- Original
+++ New
@@ @@
         if ((~$maskedDB[0] & $temp) !== $temp) {
             throw new InvalidArgumentException();
         }
-        $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
+        $dbMask = $this->getMGF1($h, $emLen + $hash->getLength() - 1, $hash);
         $db = $maskedDB ^ $dbMask;
         $db[0] = ~chr(0xff << ($emBits & 7)) & $db[0];
         $temp = $emLen - $hash->getLength() - $sLen - 2;

303) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:168    [M] DecrementInteger

--- Original
+++ New
@@ @@
         if ((~$maskedDB[0] & $temp) !== $temp) {
             throw new InvalidArgumentException();
         }
-        $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
+        $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 0, $hash);
         $db = $maskedDB ^ $dbMask;
         $db[0] = ~chr(0xff << ($emBits & 7)) & $db[0];
         $temp = $emLen - $hash->getLength() - $sLen - 2;

304) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:168    [M] IncrementInteger

--- Original
+++ New
@@ @@
         if ((~$maskedDB[0] & $temp) !== $temp) {
             throw new InvalidArgumentException();
         }
-        $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
+        $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 2, $hash);
         $db = $maskedDB ^ $dbMask;
         $db[0] = ~chr(0xff << ($emBits & 7)) & $db[0];
         $temp = $emLen - $hash->getLength() - $sLen - 2;

305) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:168    [M] Minus

--- Original
+++ New
@@ @@
         if ((~$maskedDB[0] & $temp) !== $temp) {
             throw new InvalidArgumentException();
         }
-        $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
+        $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() + 1, $hash);
         $db = $maskedDB ^ $dbMask;
         $db[0] = ~chr(0xff << ($emBits & 7)) & $db[0];
         $temp = $emLen - $hash->getLength() - $sLen - 2;

306) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:169    [M] BitwiseXor

--- Original
+++ New
@@ @@
             throw new InvalidArgumentException();
         }
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
-        $db = $maskedDB ^ $dbMask;
+        $db = $maskedDB & $dbMask;
         $db[0] = ~chr(0xff << ($emBits & 7)) & $db[0];
         $temp = $emLen - $hash->getLength() - $sLen - 2;
         if (mb_strpos($db, str_repeat(chr(0), $temp), 0, '8bit') !== 0) {

307) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:170    [M] IncrementInteger

--- Original
+++ New
@@ @@
         }
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $db = $maskedDB ^ $dbMask;
-        $db[0] = ~chr(0xff << ($emBits & 7)) & $db[0];
+        $db[1] = ~chr(0xff << ($emBits & 7)) & $db[0];
         $temp = $emLen - $hash->getLength() - $sLen - 2;
         if (mb_strpos($db, str_repeat(chr(0), $temp), 0, '8bit') !== 0) {
             throw new InvalidArgumentException();

308) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:170    [M] DecrementInteger

--- Original
+++ New
@@ @@
         }
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $db = $maskedDB ^ $dbMask;
-        $db[0] = ~chr(0xff << ($emBits & 7)) & $db[0];
+        $db[0] = ~chr(254 << ($emBits & 7)) & $db[0];
         $temp = $emLen - $hash->getLength() - $sLen - 2;
         if (mb_strpos($db, str_repeat(chr(0), $temp), 0, '8bit') !== 0) {
             throw new InvalidArgumentException();

309) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:170    [M] IncrementInteger

--- Original
+++ New
@@ @@
         }
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $db = $maskedDB ^ $dbMask;
-        $db[0] = ~chr(0xff << ($emBits & 7)) & $db[0];
+        $db[0] = ~chr(256 << ($emBits & 7)) & $db[0];
         $temp = $emLen - $hash->getLength() - $sLen - 2;
         if (mb_strpos($db, str_repeat(chr(0), $temp), 0, '8bit') !== 0) {
             throw new InvalidArgumentException();

310) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:170    [M] DecrementInteger

--- Original
+++ New
@@ @@
         }
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $db = $maskedDB ^ $dbMask;
-        $db[0] = ~chr(0xff << ($emBits & 7)) & $db[0];
+        $db[0] = ~chr(0xff << ($emBits & 6)) & $db[0];
         $temp = $emLen - $hash->getLength() - $sLen - 2;
         if (mb_strpos($db, str_repeat(chr(0), $temp), 0, '8bit') !== 0) {
             throw new InvalidArgumentException();

311) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:170    [M] IncrementInteger

--- Original
+++ New
@@ @@
         }
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $db = $maskedDB ^ $dbMask;
-        $db[0] = ~chr(0xff << ($emBits & 7)) & $db[0];
+        $db[0] = ~chr(0xff << ($emBits & 8)) & $db[0];
         $temp = $emLen - $hash->getLength() - $sLen - 2;
         if (mb_strpos($db, str_repeat(chr(0), $temp), 0, '8bit') !== 0) {
             throw new InvalidArgumentException();

312) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:170    [M] BitwiseAnd

--- Original
+++ New
@@ @@
         }
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $db = $maskedDB ^ $dbMask;
-        $db[0] = ~chr(0xff << ($emBits & 7)) & $db[0];
+        $db[0] = ~chr(0xff << ($emBits | 7)) & $db[0];
         $temp = $emLen - $hash->getLength() - $sLen - 2;
         if (mb_strpos($db, str_repeat(chr(0), $temp), 0, '8bit') !== 0) {
             throw new InvalidArgumentException();

313) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:170    [M] ShiftLeft

--- Original
+++ New
@@ @@
         }
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $db = $maskedDB ^ $dbMask;
-        $db[0] = ~chr(0xff << ($emBits & 7)) & $db[0];
+        $db[0] = ~chr(0xff >> ($emBits & 7)) & $db[0];
         $temp = $emLen - $hash->getLength() - $sLen - 2;
         if (mb_strpos($db, str_repeat(chr(0), $temp), 0, '8bit') !== 0) {
             throw new InvalidArgumentException();

314) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:170    [M] BitwiseNot

--- Original
+++ New
@@ @@
         }
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $db = $maskedDB ^ $dbMask;
-        $db[0] = ~chr(0xff << ($emBits & 7)) & $db[0];
+        $db[0] = chr(0xff << ($emBits & 7)) & $db[0];
         $temp = $emLen - $hash->getLength() - $sLen - 2;
         if (mb_strpos($db, str_repeat(chr(0), $temp), 0, '8bit') !== 0) {
             throw new InvalidArgumentException();

315) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:170    [M] IncrementInteger

--- Original
+++ New
@@ @@
         }
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $db = $maskedDB ^ $dbMask;
-        $db[0] = ~chr(0xff << ($emBits & 7)) & $db[0];
+        $db[0] = ~chr(0xff << ($emBits & 7)) & $db[1];
         $temp = $emLen - $hash->getLength() - $sLen - 2;
         if (mb_strpos($db, str_repeat(chr(0), $temp), 0, '8bit') !== 0) {
             throw new InvalidArgumentException();

316) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:170    [M] BitwiseAnd

--- Original
+++ New
@@ @@
         }
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $db = $maskedDB ^ $dbMask;
-        $db[0] = ~chr(0xff << ($emBits & 7)) & $db[0];
+        $db[0] = ~chr(0xff << ($emBits & 7)) | $db[0];
         $temp = $emLen - $hash->getLength() - $sLen - 2;
         if (mb_strpos($db, str_repeat(chr(0), $temp), 0, '8bit') !== 0) {
             throw new InvalidArgumentException();

317) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:171    [M] Minus

--- Original
+++ New
@@ @@
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $db = $maskedDB ^ $dbMask;
         $db[0] = ~chr(0xff << ($emBits & 7)) & $db[0];
-        $temp = $emLen - $hash->getLength() - $sLen - 2;
+        $temp = $emLen + $hash->getLength() - $sLen - 2;
         if (mb_strpos($db, str_repeat(chr(0), $temp), 0, '8bit') !== 0) {
             throw new InvalidArgumentException();
         }

318) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:171    [M] Minus

--- Original
+++ New
@@ @@
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $db = $maskedDB ^ $dbMask;
         $db[0] = ~chr(0xff << ($emBits & 7)) & $db[0];
-        $temp = $emLen - $hash->getLength() - $sLen - 2;
+        $temp = $emLen - $hash->getLength() + $sLen - 2;
         if (mb_strpos($db, str_repeat(chr(0), $temp), 0, '8bit') !== 0) {
             throw new InvalidArgumentException();
         }

319) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:171    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $db = $maskedDB ^ $dbMask;
         $db[0] = ~chr(0xff << ($emBits & 7)) & $db[0];
-        $temp = $emLen - $hash->getLength() - $sLen - 2;
+        $temp = $emLen - $hash->getLength() - $sLen - 1;
         if (mb_strpos($db, str_repeat(chr(0), $temp), 0, '8bit') !== 0) {
             throw new InvalidArgumentException();
         }

320) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:171    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $db = $maskedDB ^ $dbMask;
         $db[0] = ~chr(0xff << ($emBits & 7)) & $db[0];
-        $temp = $emLen - $hash->getLength() - $sLen - 2;
+        $temp = $emLen - $hash->getLength() - $sLen - 3;
         if (mb_strpos($db, str_repeat(chr(0), $temp), 0, '8bit') !== 0) {
             throw new InvalidArgumentException();
         }

321) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:171    [M] Minus

--- Original
+++ New
@@ @@
         $dbMask = $this->getMGF1($h, $emLen - $hash->getLength() - 1, $hash);
         $db = $maskedDB ^ $dbMask;
         $db[0] = ~chr(0xff << ($emBits & 7)) & $db[0];
-        $temp = $emLen - $hash->getLength() - $sLen - 2;
+        $temp = $emLen - $hash->getLength() - $sLen + 2;
         if (mb_strpos($db, str_repeat(chr(0), $temp), 0, '8bit') !== 0) {
             throw new InvalidArgumentException();
         }

322) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:172    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $db = $maskedDB ^ $dbMask;
         $db[0] = ~chr(0xff << ($emBits & 7)) & $db[0];
         $temp = $emLen - $hash->getLength() - $sLen - 2;
-        if (mb_strpos($db, str_repeat(chr(0), $temp), 0, '8bit') !== 0) {
+        if (mb_strpos($db, str_repeat(chr(-1), $temp), 0, '8bit') !== 0) {
             throw new InvalidArgumentException();
         }
         if (ord($db[$temp]) !== 1) {

323) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:172    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $db = $maskedDB ^ $dbMask;
         $db[0] = ~chr(0xff << ($emBits & 7)) & $db[0];
         $temp = $emLen - $hash->getLength() - $sLen - 2;
-        if (mb_strpos($db, str_repeat(chr(0), $temp), 0, '8bit') !== 0) {
+        if (mb_strpos($db, str_repeat(chr(1), $temp), 0, '8bit') !== 0) {
             throw new InvalidArgumentException();
         }
         if (ord($db[$temp]) !== 1) {

324) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:172    [M] UnwrapStrRepeat

--- Original
+++ New
@@ @@
         $db = $maskedDB ^ $dbMask;
         $db[0] = ~chr(0xff << ($emBits & 7)) & $db[0];
         $temp = $emLen - $hash->getLength() - $sLen - 2;
-        if (mb_strpos($db, str_repeat(chr(0), $temp), 0, '8bit') !== 0) {
+        if (mb_strpos($db, chr(0), 0, '8bit') !== 0) {
             throw new InvalidArgumentException();
         }
         if (ord($db[$temp]) !== 1) {

325) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:172    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $db = $maskedDB ^ $dbMask;
         $db[0] = ~chr(0xff << ($emBits & 7)) & $db[0];
         $temp = $emLen - $hash->getLength() - $sLen - 2;
-        if (mb_strpos($db, str_repeat(chr(0), $temp), 0, '8bit') !== 0) {
+        if (mb_strpos($db, str_repeat(chr(0), $temp), -1, '8bit') !== 0) {
             throw new InvalidArgumentException();
         }
         if (ord($db[$temp]) !== 1) {

326) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:172    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $db = $maskedDB ^ $dbMask;
         $db[0] = ~chr(0xff << ($emBits & 7)) & $db[0];
         $temp = $emLen - $hash->getLength() - $sLen - 2;
-        if (mb_strpos($db, str_repeat(chr(0), $temp), 0, '8bit') !== 0) {
+        if (mb_strpos($db, str_repeat(chr(0), $temp), 1, '8bit') !== 0) {
             throw new InvalidArgumentException();
         }
         if (ord($db[$temp]) !== 1) {

327) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:172    [M] MBString

--- Original
+++ New
@@ @@
         $db = $maskedDB ^ $dbMask;
         $db[0] = ~chr(0xff << ($emBits & 7)) & $db[0];
         $temp = $emLen - $hash->getLength() - $sLen - 2;
-        if (mb_strpos($db, str_repeat(chr(0), $temp), 0, '8bit') !== 0) {
+        if (strpos($db, str_repeat(chr(0), $temp), 0) !== 0) {
             throw new InvalidArgumentException();
         }
         if (ord($db[$temp]) !== 1) {
