328) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:172    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $db = $maskedDB ^ $dbMask;
         $db[0] = ~chr(0xff << ($emBits & 7)) & $db[0];
         $temp = $emLen - $hash->getLength() - $sLen - 2;
-        if (mb_strpos($db, str_repeat(chr(0), $temp), 0, '8bit') !== 0) {
+        if (mb_strpos($db, str_repeat(chr(0), $temp), 0, '8bit') !== -1) {
             throw new InvalidArgumentException();
         }
         if (ord($db[$temp]) !== 1) {

329) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:172    [M] NotIdentical

--- Original
+++ New
@@ @@
         $db = $maskedDB ^ $dbMask;
         $db[0] = ~chr(0xff << ($emBits & 7)) & $db[0];
         $temp = $emLen - $hash->getLength() - $sLen - 2;
-        if (mb_strpos($db, str_repeat(chr(0), $temp), 0, '8bit') !== 0) {
+        if (mb_strpos($db, str_repeat(chr(0), $temp), 0, '8bit') === 0) {
             throw new InvalidArgumentException();
         }
         if (ord($db[$temp]) !== 1) {

330) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:173    [M] Throw_

--- Original
+++ New
@@ @@
         $db[0] = ~chr(0xff << ($emBits & 7)) & $db[0];
         $temp = $emLen - $hash->getLength() - $sLen - 2;
         if (mb_strpos($db, str_repeat(chr(0), $temp), 0, '8bit') !== 0) {
-            throw new InvalidArgumentException();
+            new InvalidArgumentException();
         }
         if (ord($db[$temp]) !== 1) {
             throw new InvalidArgumentException();

331) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:175    [M] IncrementInteger

--- Original
+++ New
@@ @@
         if (mb_strpos($db, str_repeat(chr(0), $temp), 0, '8bit') !== 0) {
             throw new InvalidArgumentException();
         }
-        if (ord($db[$temp]) !== 1) {
+        if (ord($db[$temp]) !== 2) {
             throw new InvalidArgumentException();
         }
         $salt = mb_substr($db, $temp + 1, null, '8bit');

332) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:175    [M] NotIdentical

--- Original
+++ New
@@ @@
         if (mb_strpos($db, str_repeat(chr(0), $temp), 0, '8bit') !== 0) {
             throw new InvalidArgumentException();
         }
-        if (ord($db[$temp]) !== 1) {
+        if (ord($db[$temp]) === 1) {
             throw new InvalidArgumentException();
         }
         $salt = mb_substr($db, $temp + 1, null, '8bit');

333) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:176    [M] Throw_

--- Original
+++ New
@@ @@
             throw new InvalidArgumentException();
         }
         if (ord($db[$temp]) !== 1) {
-            throw new InvalidArgumentException();
+            new InvalidArgumentException();
         }
         $salt = mb_substr($db, $temp + 1, null, '8bit');
         // should be $sLen long

334) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:178    [M] DecrementInteger

--- Original
+++ New
@@ @@
         if (ord($db[$temp]) !== 1) {
             throw new InvalidArgumentException();
         }
-        $salt = mb_substr($db, $temp + 1, null, '8bit');
+        $salt = mb_substr($db, $temp + 0, null, '8bit');
         // should be $sLen long
         $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $mHash . $salt;
         $h2 = $hash->hash($m2);

335) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:178    [M] IncrementInteger

--- Original
+++ New
@@ @@
         if (ord($db[$temp]) !== 1) {
             throw new InvalidArgumentException();
         }
-        $salt = mb_substr($db, $temp + 1, null, '8bit');
+        $salt = mb_substr($db, $temp + 2, null, '8bit');
         // should be $sLen long
         $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $mHash . $salt;
         $h2 = $hash->hash($m2);

336) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:178    [M] Plus

--- Original
+++ New
@@ @@
         if (ord($db[$temp]) !== 1) {
             throw new InvalidArgumentException();
         }
-        $salt = mb_substr($db, $temp + 1, null, '8bit');
+        $salt = mb_substr($db, $temp - 1, null, '8bit');
         // should be $sLen long
         $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $mHash . $salt;
         $h2 = $hash->hash($m2);

337) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:178    [M] MBString

--- Original
+++ New
@@ @@
         if (ord($db[$temp]) !== 1) {
             throw new InvalidArgumentException();
         }
-        $salt = mb_substr($db, $temp + 1, null, '8bit');
+        $salt = substr($db, $temp + 1, null);
         // should be $sLen long
         $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $mHash . $salt;
         $h2 = $hash->hash($m2);

338) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:179    [M] Concat

--- Original
+++ New
@@ @@
         }
         $salt = mb_substr($db, $temp + 1, null, '8bit');
         // should be $sLen long
-        $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $mHash . $salt;
+        $m2 = $mHash . "\x00\x00\x00\x00\x00\x00\x00\x00" . $salt;
         $h2 = $hash->hash($m2);
         return hash_equals($h, $h2);
     }
 }

339) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:179    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         }
         $salt = mb_substr($db, $temp + 1, null, '8bit');
         // should be $sLen long
-        $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $mHash . $salt;
+        $m2 = $mHash . $salt;
         $h2 = $hash->hash($m2);
         return hash_equals($h, $h2);
     }
 }

340) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:179    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         }
         $salt = mb_substr($db, $temp + 1, null, '8bit');
         // should be $sLen long
-        $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $mHash . $salt;
+        $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $salt;
         $h2 = $hash->hash($m2);
         return hash_equals($h, $h2);
     }
 }

341) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:179    [M] Concat

--- Original
+++ New
@@ @@
         }
         $salt = mb_substr($db, $temp + 1, null, '8bit');
         // should be $sLen long
-        $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $mHash . $salt;
+        $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $salt . $mHash;
         $h2 = $hash->hash($m2);
         return hash_equals($h, $h2);
     }
 }

342) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/PSSRSA.php:179    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         }
         $salt = mb_substr($db, $temp + 1, null, '8bit');
         // should be $sLen long
-        $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $mHash . $salt;
+        $m2 = "\x00\x00\x00\x00\x00\x00\x00\x00" . $mHash;
         $h2 = $hash->hash($m2);
         return hash_equals($h, $h2);
     }
 }

343) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/RS1.php:13    [M] PublicVisibility

--- Original
+++ New
@@ @@
 final class RS1 extends RSA
 {
     public const ID = -65535;
-    public static function create() : self
+    protected static function create() : self
     {
         return new self();
     }

344) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/RS256.php:13    [M] PublicVisibility

--- Original
+++ New
@@ @@
 final class RS256 extends RSA
 {
     public const ID = -257;
-    public static function create() : self
+    protected static function create() : self
     {
         return new self();
     }

345) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/RS384.php:13    [M] PublicVisibility

--- Original
+++ New
@@ @@
 final class RS384 extends RSA
 {
     public const ID = -258;
-    public static function create() : self
+    protected static function create() : self
     {
         return new self();
     }

346) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/RS512.php:13    [M] PublicVisibility

--- Original
+++ New
@@ @@
 final class RS512 extends RSA
 {
     public const ID = -259;
-    public static function create() : self
+    protected static function create() : self
     {
         return new self();
     }

348) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/RSA.php:24    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
         $key = $this->handleKey($key);
         Assertion::true($key->isPrivate(), 'The key is not private');
         try {
-            openssl_sign($data, $signature, $key->asPem(), $this->getHashAlgorithm());
+            
         } catch (Throwable $e) {
             throw new InvalidArgumentException('Unable to sign the data', 0, $e);
         }

349) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/RSA.php:26    [M] DecrementInteger

--- Original
+++ New
@@ @@
         try {
             openssl_sign($data, $signature, $key->asPem(), $this->getHashAlgorithm());
         } catch (Throwable $e) {
-            throw new InvalidArgumentException('Unable to sign the data', 0, $e);
+            throw new InvalidArgumentException('Unable to sign the data', -1, $e);
         }
         return $signature;
     }

350) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/RSA.php:26    [M] IncrementInteger

--- Original
+++ New
@@ @@
         try {
             openssl_sign($data, $signature, $key->asPem(), $this->getHashAlgorithm());
         } catch (Throwable $e) {
-            throw new InvalidArgumentException('Unable to sign the data', 0, $e);
+            throw new InvalidArgumentException('Unable to sign the data', 1, $e);
         }
         return $signature;
     }

351) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/RSA.php:26    [M] Throw_

--- Original
+++ New
@@ @@
         try {
             openssl_sign($data, $signature, $key->asPem(), $this->getHashAlgorithm());
         } catch (Throwable $e) {
-            throw new InvalidArgumentException('Unable to sign the data', 0, $e);
+            new InvalidArgumentException('Unable to sign the data', 0, $e);
         }
         return $signature;
     }

352) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/RSA.php:36    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function verify(string $data, Key $key, string $signature) : bool
     {
         $key = $this->handleKey($key);
-        return openssl_verify($data, $signature, $key->asPem(), $this->getHashAlgorithm()) === 1;
+        return openssl_verify($data, $signature, $key->asPem(), $this->getHashAlgorithm()) === 2;
     }
     protected abstract function getHashAlgorithm() : int;
     private function handleKey(Key $key) : RsaKey

353) /home/florent/PhpstormProjects/cose-lib/src/Algorithm/Signature/RSA/RSA.php:36    [M] Identical

--- Original
+++ New
@@ @@
     public function verify(string $data, Key $key, string $signature) : bool
     {
         $key = $this->handleKey($key);
-        return openssl_verify($data, $signature, $key->asPem(), $this->getHashAlgorithm()) === 1;
+        return openssl_verify($data, $signature, $key->asPem(), $this->getHashAlgorithm()) !== 1;
     }
     protected abstract function getHashAlgorithm() : int;
     private function handleKey(Key $key) : RsaKey

354) /home/florent/PhpstormProjects/cose-lib/src/Algorithms.php:152    [M] PublicVisibility

--- Original
+++ New
@@ @@
     public final const COSE_ALGORITHM_RS1 = -65535;
-    public static function getOpensslAlgorithmFor(int $algorithmIdentifier) : int
+    protected static function getOpensslAlgorithmFor(int $algorithmIdentifier) : int
     {
         Assertion::keyExists(self::COSE_ALGORITHM_MAP, $algorithmIdentifier, 'The specified algorithm identifier is not supported');
         return self::COSE_ALGORITHM_MAP[$algorithmIdentifier];

355) /home/florent/PhpstormProjects/cose-lib/src/Algorithms.php:154    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public static function getOpensslAlgorithmFor(int $algorithmIdentifier) : int
     {
-        Assertion::keyExists(self::COSE_ALGORITHM_MAP, $algorithmIdentifier, 'The specified algorithm identifier is not supported');
+        
         return self::COSE_ALGORITHM_MAP[$algorithmIdentifier];
     }
     public static function getHashAlgorithmFor(int $algorithmIdentifier) : string

356) /home/florent/PhpstormProjects/cose-lib/src/Algorithms.php:163    [M] PublicVisibility

--- Original
+++ New
@@ @@
         Assertion::keyExists(self::COSE_ALGORITHM_MAP, $algorithmIdentifier, 'The specified algorithm identifier is not supported');
         return self::COSE_ALGORITHM_MAP[$algorithmIdentifier];
     }
-    public static function getHashAlgorithmFor(int $algorithmIdentifier) : string
+    protected static function getHashAlgorithmFor(int $algorithmIdentifier) : string
     {
         Assertion::keyExists(self::COSE_HASH_MAP, $algorithmIdentifier, 'The specified algorithm identifier is not supported');
         return self::COSE_HASH_MAP[$algorithmIdentifier];
     }
 }

357) /home/florent/PhpstormProjects/cose-lib/src/Algorithms.php:165    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public static function getHashAlgorithmFor(int $algorithmIdentifier) : string
     {
-        Assertion::keyExists(self::COSE_HASH_MAP, $algorithmIdentifier, 'The specified algorithm identifier is not supported');
+        
         return self::COSE_HASH_MAP[$algorithmIdentifier];
     }
 }

358) /home/florent/PhpstormProjects/cose-lib/src/BigInteger.php:22    [M] PublicVisibility

--- Original
+++ New
@@ @@
     private function __construct(private readonly BrickBigInteger $value)
     {
     }
-    public static function createFromBinaryString(string $value) : self
+    protected static function createFromBinaryString(string $value) : self
     {
         $res = unpack('H*', $value);
         $data = current($res);

359) /home/florent/PhpstormProjects/cose-lib/src/BigInteger.php:27    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         $res = unpack('H*', $value);
         $data = current($res);
-        return new self(BrickBigInteger::fromBase($data, 16));
+        return new self(BrickBigInteger::fromBase($data, 15));
     }
     public static function createFromDecimal(int $value) : self
     {

360) /home/florent/PhpstormProjects/cose-lib/src/BigInteger.php:27    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         $res = unpack('H*', $value);
         $data = current($res);
-        return new self(BrickBigInteger::fromBase($data, 16));
+        return new self(BrickBigInteger::fromBase($data, 17));
     }
     public static function createFromDecimal(int $value) : self
     {

361) /home/florent/PhpstormProjects/cose-lib/src/BigInteger.php:30    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $data = current($res);
         return new self(BrickBigInteger::fromBase($data, 16));
     }
-    public static function createFromDecimal(int $value) : self
+    protected static function createFromDecimal(int $value) : self
     {
         return new self(BrickBigInteger::of($value));
     }

362) /home/florent/PhpstormProjects/cose-lib/src/BigInteger.php:38    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * Converts a BigInteger to a binary string.
      */
-    public function toBytes() : string
+    protected function toBytes() : string
     {
         if ($this->value->isEqualTo(BrickBigInteger::zero())) {
             return '';

363) /home/florent/PhpstormProjects/cose-lib/src/BigInteger.php:44    [M] DecrementInteger

--- Original
+++ New
@@ @@
         if ($this->value->isEqualTo(BrickBigInteger::zero())) {
             return '';
         }
-        $temp = $this->value->toBase(16);
+        $temp = $this->value->toBase(15);
         $temp = 0 !== (mb_strlen($temp, '8bit') & 1) ? '0' . $temp : $temp;
         $temp = hex2bin($temp);
         return ltrim($temp, chr(0));

364) /home/florent/PhpstormProjects/cose-lib/src/BigInteger.php:44    [M] IncrementInteger

--- Original
+++ New
@@ @@
         if ($this->value->isEqualTo(BrickBigInteger::zero())) {
             return '';
         }
-        $temp = $this->value->toBase(16);
+        $temp = $this->value->toBase(17);
         $temp = 0 !== (mb_strlen($temp, '8bit') & 1) ? '0' . $temp : $temp;
         $temp = hex2bin($temp);
         return ltrim($temp, chr(0));

365) /home/florent/PhpstormProjects/cose-lib/src/BigInteger.php:45    [M] DecrementInteger

--- Original
+++ New
@@ @@
             return '';
         }
         $temp = $this->value->toBase(16);
-        $temp = 0 !== (mb_strlen($temp, '8bit') & 1) ? '0' . $temp : $temp;
+        $temp = -1 !== (mb_strlen($temp, '8bit') & 1) ? '0' . $temp : $temp;
         $temp = hex2bin($temp);
         return ltrim($temp, chr(0));
     }

366) /home/florent/PhpstormProjects/cose-lib/src/BigInteger.php:45    [M] MBString

--- Original
+++ New
@@ @@
             return '';
         }
         $temp = $this->value->toBase(16);
-        $temp = 0 !== (mb_strlen($temp, '8bit') & 1) ? '0' . $temp : $temp;
+        $temp = 0 !== (strlen($temp) & 1) ? '0' . $temp : $temp;
         $temp = hex2bin($temp);
         return ltrim($temp, chr(0));
     }

367) /home/florent/PhpstormProjects/cose-lib/src/BigInteger.php:45    [M] DecrementInteger

--- Original
+++ New
@@ @@
             return '';
         }
         $temp = $this->value->toBase(16);
-        $temp = 0 !== (mb_strlen($temp, '8bit') & 1) ? '0' . $temp : $temp;
+        $temp = 0 !== (mb_strlen($temp, '8bit') & 0) ? '0' . $temp : $temp;
         $temp = hex2bin($temp);
         return ltrim($temp, chr(0));
     }

368) /home/florent/PhpstormProjects/cose-lib/src/BigInteger.php:45    [M] IncrementInteger

--- Original
+++ New
@@ @@
             return '';
         }
         $temp = $this->value->toBase(16);
-        $temp = 0 !== (mb_strlen($temp, '8bit') & 1) ? '0' . $temp : $temp;
+        $temp = 0 !== (mb_strlen($temp, '8bit') & 2) ? '0' . $temp : $temp;
         $temp = hex2bin($temp);
         return ltrim($temp, chr(0));
     }

369) /home/florent/PhpstormProjects/cose-lib/src/BigInteger.php:45    [M] BitwiseAnd

--- Original
+++ New
@@ @@
             return '';
         }
         $temp = $this->value->toBase(16);
-        $temp = 0 !== (mb_strlen($temp, '8bit') & 1) ? '0' . $temp : $temp;
+        $temp = 0 !== (mb_strlen($temp, '8bit') | 1) ? '0' . $temp : $temp;
         $temp = hex2bin($temp);
         return ltrim($temp, chr(0));
     }

370) /home/florent/PhpstormProjects/cose-lib/src/BigInteger.php:45    [M] NotIdentical

--- Original
+++ New
@@ @@
             return '';
         }
         $temp = $this->value->toBase(16);
-        $temp = 0 !== (mb_strlen($temp, '8bit') & 1) ? '0' . $temp : $temp;
+        $temp = 0 === (mb_strlen($temp, '8bit') & 1) ? '0' . $temp : $temp;
         $temp = hex2bin($temp);
         return ltrim($temp, chr(0));
     }

371) /home/florent/PhpstormProjects/cose-lib/src/BigInteger.php:45    [M] Concat

--- Original
+++ New
@@ @@
             return '';
         }
         $temp = $this->value->toBase(16);
-        $temp = 0 !== (mb_strlen($temp, '8bit') & 1) ? '0' . $temp : $temp;
+        $temp = 0 !== (mb_strlen($temp, '8bit') & 1) ? $temp . '0' : $temp;
         $temp = hex2bin($temp);
         return ltrim($temp, chr(0));
     }

372) /home/florent/PhpstormProjects/cose-lib/src/BigInteger.php:45    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             return '';
         }
         $temp = $this->value->toBase(16);
-        $temp = 0 !== (mb_strlen($temp, '8bit') & 1) ? '0' . $temp : $temp;
+        $temp = 0 !== (mb_strlen($temp, '8bit') & 1) ? $temp : $temp;
         $temp = hex2bin($temp);
         return ltrim($temp, chr(0));
     }

373) /home/florent/PhpstormProjects/cose-lib/src/BigInteger.php:45    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             return '';
         }
         $temp = $this->value->toBase(16);
-        $temp = 0 !== (mb_strlen($temp, '8bit') & 1) ? '0' . $temp : $temp;
+        $temp = 0 !== (mb_strlen($temp, '8bit') & 1) ? '0' : $temp;
         $temp = hex2bin($temp);
         return ltrim($temp, chr(0));
     }

374) /home/florent/PhpstormProjects/cose-lib/src/BigInteger.php:45    [M] Ternary

--- Original
+++ New
@@ @@
             return '';
         }
         $temp = $this->value->toBase(16);
-        $temp = 0 !== (mb_strlen($temp, '8bit') & 1) ? '0' . $temp : $temp;
+        $temp = 0 !== (mb_strlen($temp, '8bit') & 1) ? $temp : '0' . $temp;
         $temp = hex2bin($temp);
         return ltrim($temp, chr(0));
     }

375) /home/florent/PhpstormProjects/cose-lib/src/BigInteger.php:48    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $temp = $this->value->toBase(16);
         $temp = 0 !== (mb_strlen($temp, '8bit') & 1) ? '0' . $temp : $temp;
         $temp = hex2bin($temp);
-        return ltrim($temp, chr(0));
+        return ltrim($temp, chr(-1));
     }
     /**
      * Adds two BigIntegers.

376) /home/florent/PhpstormProjects/cose-lib/src/BigInteger.php:48    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $temp = $this->value->toBase(16);
         $temp = 0 !== (mb_strlen($temp, '8bit') & 1) ? '0' . $temp : $temp;
         $temp = hex2bin($temp);
-        return ltrim($temp, chr(0));
+        return ltrim($temp, chr(1));
     }
     /**
      * Adds two BigIntegers.

377) /home/florent/PhpstormProjects/cose-lib/src/BigInteger.php:48    [M] UnwrapLtrim

--- Original
+++ New
@@ @@
         $temp = $this->value->toBase(16);
         $temp = 0 !== (mb_strlen($temp, '8bit') & 1) ? '0' . $temp : $temp;
         $temp = hex2bin($temp);
-        return ltrim($temp, chr(0));
+        return $temp;
     }
     /**
      * Adds two BigIntegers.

378) /home/florent/PhpstormProjects/cose-lib/src/BigInteger.php:54    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * Adds two BigIntegers.
      */
-    public function add(self $y) : self
+    protected function add(self $y) : self
     {
         $value = $this->value->plus($y->value);
         return new self($value);

379) /home/florent/PhpstormProjects/cose-lib/src/BigInteger.php:64    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * Subtracts two BigIntegers.
      */
-    public function subtract(self $y) : self
+    protected function subtract(self $y) : self
     {
         $value = $this->value->minus($y->value);
         return new self($value);

380) /home/florent/PhpstormProjects/cose-lib/src/BigInteger.php:74    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * Multiplies two BigIntegers.
      */
-    public function multiply(self $x) : self
+    protected function multiply(self $x) : self
     {
         $value = $this->value->multipliedBy($x->value);
         return new self($value);

381) /home/florent/PhpstormProjects/cose-lib/src/BigInteger.php:84    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * Performs modular exponentiation.
      */
-    public function modPow(self $e, self $n) : self
+    protected function modPow(self $e, self $n) : self
     {
         $value = $this->value->modPow($e->value, $n->value);
         return new self($value);

382) /home/florent/PhpstormProjects/cose-lib/src/BigInteger.php:94    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * Performs modular exponentiation.
      */
-    public function mod(self $d) : self
+    protected function mod(self $d) : self
     {
         $value = $this->value->mod($d->value);
         return new self($value);

383) /home/florent/PhpstormProjects/cose-lib/src/BigInteger.php:104    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * Compares two numbers.
      */
-    public function compare(self $y) : int
+    protected function compare(self $y) : int
     {
         return $this->value->compareTo($y->value);
     }
 }

384) /home/florent/PhpstormProjects/cose-lib/src/Hash.php:19    [M] PublicVisibility

--- Original
+++ New
@@ @@
     private function __construct(private readonly string $hash, private readonly int $length, private readonly string $t)
     {
     }
-    public static function sha1() : self
+    protected static function sha1() : self
     {
         return new self('sha1', 20, "0!0\t\x06\x05+\x0e\x03\x02\x1a\x05\x00\x04\x14");
     }

385) /home/florent/PhpstormProjects/cose-lib/src/Hash.php:21    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     public static function sha1() : self
     {
-        return new self('sha1', 20, "0!0\t\x06\x05+\x0e\x03\x02\x1a\x05\x00\x04\x14");
+        return new self('sha1', 19, "0!0\t\x06\x05+\x0e\x03\x02\x1a\x05\x00\x04\x14");
     }
     public static function sha256() : self
     {

386) /home/florent/PhpstormProjects/cose-lib/src/Hash.php:21    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     public static function sha1() : self
     {
-        return new self('sha1', 20, "0!0\t\x06\x05+\x0e\x03\x02\x1a\x05\x00\x04\x14");
+        return new self('sha1', 21, "0!0\t\x06\x05+\x0e\x03\x02\x1a\x05\x00\x04\x14");
     }
     public static function sha256() : self
     {

387) /home/florent/PhpstormProjects/cose-lib/src/Hash.php:24    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return new self('sha1', 20, "0!0\t\x06\x05+\x0e\x03\x02\x1a\x05\x00\x04\x14");
     }
-    public static function sha256() : self
+    protected static function sha256() : self
     {
         return new self('sha256', 32, "010\r\x06\t`\x86H\x01e\x03\x04\x02\x01\x05\x00\x04 ");
     }

388) /home/florent/PhpstormProjects/cose-lib/src/Hash.php:26    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     public static function sha256() : self
     {
-        return new self('sha256', 32, "010\r\x06\t`\x86H\x01e\x03\x04\x02\x01\x05\x00\x04 ");
+        return new self('sha256', 31, "010\r\x06\t`\x86H\x01e\x03\x04\x02\x01\x05\x00\x04 ");
     }
     public static function sha384() : self
     {

389) /home/florent/PhpstormProjects/cose-lib/src/Hash.php:26    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     public static function sha256() : self
     {
-        return new self('sha256', 32, "010\r\x06\t`\x86H\x01e\x03\x04\x02\x01\x05\x00\x04 ");
+        return new self('sha256', 33, "010\r\x06\t`\x86H\x01e\x03\x04\x02\x01\x05\x00\x04 ");
     }
     public static function sha384() : self
     {

390) /home/florent/PhpstormProjects/cose-lib/src/Hash.php:29    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return new self('sha256', 32, "010\r\x06\t`\x86H\x01e\x03\x04\x02\x01\x05\x00\x04 ");
     }
-    public static function sha384() : self
+    protected static function sha384() : self
     {
         return new self('sha384', 48, "0A0\r\x06\t`\x86H\x01e\x03\x04\x02\x02\x05\x00\x040");
     }

391) /home/florent/PhpstormProjects/cose-lib/src/Hash.php:31    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     public static function sha384() : self
     {
-        return new self('sha384', 48, "0A0\r\x06\t`\x86H\x01e\x03\x04\x02\x02\x05\x00\x040");
+        return new self('sha384', 47, "0A0\r\x06\t`\x86H\x01e\x03\x04\x02\x02\x05\x00\x040");
     }
     public static function sha512() : self
     {

392) /home/florent/PhpstormProjects/cose-lib/src/Hash.php:31    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     public static function sha384() : self
     {
-        return new self('sha384', 48, "0A0\r\x06\t`\x86H\x01e\x03\x04\x02\x02\x05\x00\x040");
+        return new self('sha384', 49, "0A0\r\x06\t`\x86H\x01e\x03\x04\x02\x02\x05\x00\x040");
     }
     public static function sha512() : self
     {

393) /home/florent/PhpstormProjects/cose-lib/src/Hash.php:34    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return new self('sha384', 48, "0A0\r\x06\t`\x86H\x01e\x03\x04\x02\x02\x05\x00\x040");
     }
-    public static function sha512() : self
+    protected static function sha512() : self
     {
         return new self('sha512', 64, "0Q0\r\x06\t`\x86H\x01e\x03\x04\x02\x03\x05\x00\x04@");
     }

394) /home/florent/PhpstormProjects/cose-lib/src/Hash.php:36    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     public static function sha512() : self
     {
-        return new self('sha512', 64, "0Q0\r\x06\t`\x86H\x01e\x03\x04\x02\x03\x05\x00\x04@");
+        return new self('sha512', 63, "0Q0\r\x06\t`\x86H\x01e\x03\x04\x02\x03\x05\x00\x04@");
     }
     public function getLength() : int
     {

395) /home/florent/PhpstormProjects/cose-lib/src/Hash.php:36    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     public static function sha512() : self
     {
-        return new self('sha512', 64, "0Q0\r\x06\t`\x86H\x01e\x03\x04\x02\x03\x05\x00\x04@");
+        return new self('sha512', 65, "0Q0\r\x06\t`\x86H\x01e\x03\x04\x02\x03\x05\x00\x04@");
     }
     public function getLength() : int
     {

397) /home/florent/PhpstormProjects/cose-lib/src/Hash.php:47    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * Compute the HMAC.
      */
-    public function hash(string $text) : string
+    protected function hash(string $text) : string
     {
         return hash($this->hash, $text, true);
     }

398) /home/florent/PhpstormProjects/cose-lib/src/Hash.php:52    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return hash($this->hash, $text, true);
     }
-    public function name() : string
+    protected function name() : string
     {
         return $this->hash;
     }
