399) /home/florent/PhpstormProjects/cose-lib/src/Hash.php:57    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->hash;
     }
-    public function t() : string
+    protected function t() : string
     {
         return $this->t;
     }
 }

400) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:59    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function __construct(array $data)
     {
-        parent::__construct($data);
+        
         Assertion::eq($data[self::TYPE], self::TYPE_EC2, 'Invalid EC2 key. The key type does not correspond to an EC2 key');
         Assertion::keyExists($data, self::DATA_CURVE, 'Invalid EC2 key. The curve is missing');
         Assertion::keyExists($data, self::DATA_X, 'Invalid EC2 key. The x coordinate is missing');

401) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:60    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function __construct(array $data)
     {
         parent::__construct($data);
-        Assertion::eq($data[self::TYPE], self::TYPE_EC2, 'Invalid EC2 key. The key type does not correspond to an EC2 key');
+        
         Assertion::keyExists($data, self::DATA_CURVE, 'Invalid EC2 key. The curve is missing');
         Assertion::keyExists($data, self::DATA_X, 'Invalid EC2 key. The x coordinate is missing');
         Assertion::keyExists($data, self::DATA_Y, 'Invalid EC2 key. The y coordinate is missing');

402) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:65    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         parent::__construct($data);
         Assertion::eq($data[self::TYPE], self::TYPE_EC2, 'Invalid EC2 key. The key type does not correspond to an EC2 key');
-        Assertion::keyExists($data, self::DATA_CURVE, 'Invalid EC2 key. The curve is missing');
+        
         Assertion::keyExists($data, self::DATA_X, 'Invalid EC2 key. The x coordinate is missing');
         Assertion::keyExists($data, self::DATA_Y, 'Invalid EC2 key. The y coordinate is missing');
         Assertion::length($data[self::DATA_X], self::CURVE_KEY_LENGTH[$data[self::DATA_CURVE]], 'Invalid length for x coordinate', null, '8bit');

403) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:66    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         parent::__construct($data);
         Assertion::eq($data[self::TYPE], self::TYPE_EC2, 'Invalid EC2 key. The key type does not correspond to an EC2 key');
         Assertion::keyExists($data, self::DATA_CURVE, 'Invalid EC2 key. The curve is missing');
-        Assertion::keyExists($data, self::DATA_X, 'Invalid EC2 key. The x coordinate is missing');
+        
         Assertion::keyExists($data, self::DATA_Y, 'Invalid EC2 key. The y coordinate is missing');
         Assertion::length($data[self::DATA_X], self::CURVE_KEY_LENGTH[$data[self::DATA_CURVE]], 'Invalid length for x coordinate', null, '8bit');
         Assertion::length($data[self::DATA_Y], self::CURVE_KEY_LENGTH[$data[self::DATA_CURVE]], 'Invalid length for y coordinate', null, '8bit');

404) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:67    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         Assertion::eq($data[self::TYPE], self::TYPE_EC2, 'Invalid EC2 key. The key type does not correspond to an EC2 key');
         Assertion::keyExists($data, self::DATA_CURVE, 'Invalid EC2 key. The curve is missing');
         Assertion::keyExists($data, self::DATA_X, 'Invalid EC2 key. The x coordinate is missing');
-        Assertion::keyExists($data, self::DATA_Y, 'Invalid EC2 key. The y coordinate is missing');
+        
         Assertion::length($data[self::DATA_X], self::CURVE_KEY_LENGTH[$data[self::DATA_CURVE]], 'Invalid length for x coordinate', null, '8bit');
         Assertion::length($data[self::DATA_Y], self::CURVE_KEY_LENGTH[$data[self::DATA_CURVE]], 'Invalid length for y coordinate', null, '8bit');
         Assertion::inArray((int) $data[self::DATA_CURVE], self::SUPPORTED_CURVES, 'The curve is not supported');

405) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:68    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         Assertion::keyExists($data, self::DATA_CURVE, 'Invalid EC2 key. The curve is missing');
         Assertion::keyExists($data, self::DATA_X, 'Invalid EC2 key. The x coordinate is missing');
         Assertion::keyExists($data, self::DATA_Y, 'Invalid EC2 key. The y coordinate is missing');
-        Assertion::length($data[self::DATA_X], self::CURVE_KEY_LENGTH[$data[self::DATA_CURVE]], 'Invalid length for x coordinate', null, '8bit');
+        
         Assertion::length($data[self::DATA_Y], self::CURVE_KEY_LENGTH[$data[self::DATA_CURVE]], 'Invalid length for y coordinate', null, '8bit');
         Assertion::inArray((int) $data[self::DATA_CURVE], self::SUPPORTED_CURVES, 'The curve is not supported');
     }

406) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:75    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         Assertion::keyExists($data, self::DATA_X, 'Invalid EC2 key. The x coordinate is missing');
         Assertion::keyExists($data, self::DATA_Y, 'Invalid EC2 key. The y coordinate is missing');
         Assertion::length($data[self::DATA_X], self::CURVE_KEY_LENGTH[$data[self::DATA_CURVE]], 'Invalid length for x coordinate', null, '8bit');
-        Assertion::length($data[self::DATA_Y], self::CURVE_KEY_LENGTH[$data[self::DATA_CURVE]], 'Invalid length for y coordinate', null, '8bit');
+        
         Assertion::inArray((int) $data[self::DATA_CURVE], self::SUPPORTED_CURVES, 'The curve is not supported');
     }
     /**

407) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:82    [M] CastInt

--- Original
+++ New
@@ @@
         Assertion::keyExists($data, self::DATA_Y, 'Invalid EC2 key. The y coordinate is missing');
         Assertion::length($data[self::DATA_X], self::CURVE_KEY_LENGTH[$data[self::DATA_CURVE]], 'Invalid length for x coordinate', null, '8bit');
         Assertion::length($data[self::DATA_Y], self::CURVE_KEY_LENGTH[$data[self::DATA_CURVE]], 'Invalid length for y coordinate', null, '8bit');
-        Assertion::inArray((int) $data[self::DATA_CURVE], self::SUPPORTED_CURVES, 'The curve is not supported');
+        Assertion::inArray($data[self::DATA_CURVE], self::SUPPORTED_CURVES, 'The curve is not supported');
     }
     /**
      * @param array<int|string, mixed> $data

408) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:82    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         Assertion::keyExists($data, self::DATA_Y, 'Invalid EC2 key. The y coordinate is missing');
         Assertion::length($data[self::DATA_X], self::CURVE_KEY_LENGTH[$data[self::DATA_CURVE]], 'Invalid length for x coordinate', null, '8bit');
         Assertion::length($data[self::DATA_Y], self::CURVE_KEY_LENGTH[$data[self::DATA_CURVE]], 'Invalid length for y coordinate', null, '8bit');
-        Assertion::inArray((int) $data[self::DATA_CURVE], self::SUPPORTED_CURVES, 'The curve is not supported');
+        
     }
     /**
      * @param array<int|string, mixed> $data

409) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:93    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return new self($data);
     }
-    public function toPublic() : self
+    protected function toPublic() : self
     {
         $data = $this->getData();
         unset($data[self::DATA_D]);

410) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:101    [M] PublicVisibility

--- Original
+++ New
@@ @@
         unset($data[self::DATA_D]);
         return new self($data);
     }
-    public function x() : string
+    protected function x() : string
     {
         return $this->get(self::DATA_X);
     }

411) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:106    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->get(self::DATA_X);
     }
-    public function y() : string
+    protected function y() : string
     {
         return $this->get(self::DATA_Y);
     }

412) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:111    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->get(self::DATA_Y);
     }
-    public function isPrivate() : bool
+    protected function isPrivate() : bool
     {
         return array_key_exists(self::DATA_D, $this->getData());
     }

413) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:116    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return array_key_exists(self::DATA_D, $this->getData());
     }
-    public function d() : string
+    protected function d() : string
     {
         Assertion::true($this->isPrivate(), 'The key is not private');
         return $this->get(self::DATA_D);

414) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:118    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function d() : string
     {
-        Assertion::true($this->isPrivate(), 'The key is not private');
+        
         return $this->get(self::DATA_D);
     }
     public function curve() : int

415) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:123    [M] PublicVisibility

--- Original
+++ New
@@ @@
         Assertion::true($this->isPrivate(), 'The key is not private');
         return $this->get(self::DATA_D);
     }
-    public function curve() : int
+    protected function curve() : int
     {
         return (int) $this->get(self::DATA_CURVE);
     }

416) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:125    [M] CastInt

--- Original
+++ New
@@ @@
     }
     public function curve() : int
     {
-        return (int) $this->get(self::DATA_CURVE);
+        return $this->get(self::DATA_CURVE);
     }
     public function asPEM() : string
     {

417) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:128    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return (int) $this->get(self::DATA_CURVE);
     }
-    public function asPEM() : string
+    protected function asPEM() : string
     {
         if ($this->isPrivate()) {
             $der = new Sequence(new Integer(1), new OctetString(bin2hex($this->d())), new ExplicitlyTaggedObject(0, new ObjectIdentifier($this->getCurveOid())), new ExplicitlyTaggedObject(1, new BitString(bin2hex($this->getUncompressedCoordinates()))));

418) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:132    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function asPEM() : string
     {
         if ($this->isPrivate()) {
-            $der = new Sequence(new Integer(1), new OctetString(bin2hex($this->d())), new ExplicitlyTaggedObject(0, new ObjectIdentifier($this->getCurveOid())), new ExplicitlyTaggedObject(1, new BitString(bin2hex($this->getUncompressedCoordinates()))));
+            $der = new Sequence(new Integer(0), new OctetString(bin2hex($this->d())), new ExplicitlyTaggedObject(0, new ObjectIdentifier($this->getCurveOid())), new ExplicitlyTaggedObject(1, new BitString(bin2hex($this->getUncompressedCoordinates()))));
             return $this->pem('EC PRIVATE KEY', $der->getBinary());
         }
         $der = new Sequence(new Sequence(new ObjectIdentifier('1.2.840.10045.2.1'), new ObjectIdentifier($this->getCurveOid())), new BitString(bin2hex($this->getUncompressedCoordinates())));

419) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:132    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function asPEM() : string
     {
         if ($this->isPrivate()) {
-            $der = new Sequence(new Integer(1), new OctetString(bin2hex($this->d())), new ExplicitlyTaggedObject(0, new ObjectIdentifier($this->getCurveOid())), new ExplicitlyTaggedObject(1, new BitString(bin2hex($this->getUncompressedCoordinates()))));
+            $der = new Sequence(new Integer(2), new OctetString(bin2hex($this->d())), new ExplicitlyTaggedObject(0, new ObjectIdentifier($this->getCurveOid())), new ExplicitlyTaggedObject(1, new BitString(bin2hex($this->getUncompressedCoordinates()))));
             return $this->pem('EC PRIVATE KEY', $der->getBinary());
         }
         $der = new Sequence(new Sequence(new ObjectIdentifier('1.2.840.10045.2.1'), new ObjectIdentifier($this->getCurveOid())), new BitString(bin2hex($this->getUncompressedCoordinates())));

420) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:134    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function asPEM() : string
     {
         if ($this->isPrivate()) {
-            $der = new Sequence(new Integer(1), new OctetString(bin2hex($this->d())), new ExplicitlyTaggedObject(0, new ObjectIdentifier($this->getCurveOid())), new ExplicitlyTaggedObject(1, new BitString(bin2hex($this->getUncompressedCoordinates()))));
+            $der = new Sequence(new Integer(1), new OctetString(bin2hex($this->d())), new ExplicitlyTaggedObject(-1, new ObjectIdentifier($this->getCurveOid())), new ExplicitlyTaggedObject(1, new BitString(bin2hex($this->getUncompressedCoordinates()))));
             return $this->pem('EC PRIVATE KEY', $der->getBinary());
         }
         $der = new Sequence(new Sequence(new ObjectIdentifier('1.2.840.10045.2.1'), new ObjectIdentifier($this->getCurveOid())), new BitString(bin2hex($this->getUncompressedCoordinates())));

421) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:134    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function asPEM() : string
     {
         if ($this->isPrivate()) {
-            $der = new Sequence(new Integer(1), new OctetString(bin2hex($this->d())), new ExplicitlyTaggedObject(0, new ObjectIdentifier($this->getCurveOid())), new ExplicitlyTaggedObject(1, new BitString(bin2hex($this->getUncompressedCoordinates()))));
+            $der = new Sequence(new Integer(1), new OctetString(bin2hex($this->d())), new ExplicitlyTaggedObject(1, new ObjectIdentifier($this->getCurveOid())), new ExplicitlyTaggedObject(1, new BitString(bin2hex($this->getUncompressedCoordinates()))));
             return $this->pem('EC PRIVATE KEY', $der->getBinary());
         }
         $der = new Sequence(new Sequence(new ObjectIdentifier('1.2.840.10045.2.1'), new ObjectIdentifier($this->getCurveOid())), new BitString(bin2hex($this->getUncompressedCoordinates())));

422) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:135    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function asPEM() : string
     {
         if ($this->isPrivate()) {
-            $der = new Sequence(new Integer(1), new OctetString(bin2hex($this->d())), new ExplicitlyTaggedObject(0, new ObjectIdentifier($this->getCurveOid())), new ExplicitlyTaggedObject(1, new BitString(bin2hex($this->getUncompressedCoordinates()))));
+            $der = new Sequence(new Integer(1), new OctetString(bin2hex($this->d())), new ExplicitlyTaggedObject(0, new ObjectIdentifier($this->getCurveOid())), new ExplicitlyTaggedObject(0, new BitString(bin2hex($this->getUncompressedCoordinates()))));
             return $this->pem('EC PRIVATE KEY', $der->getBinary());
         }
         $der = new Sequence(new Sequence(new ObjectIdentifier('1.2.840.10045.2.1'), new ObjectIdentifier($this->getCurveOid())), new BitString(bin2hex($this->getUncompressedCoordinates())));

423) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:135    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function asPEM() : string
     {
         if ($this->isPrivate()) {
-            $der = new Sequence(new Integer(1), new OctetString(bin2hex($this->d())), new ExplicitlyTaggedObject(0, new ObjectIdentifier($this->getCurveOid())), new ExplicitlyTaggedObject(1, new BitString(bin2hex($this->getUncompressedCoordinates()))));
+            $der = new Sequence(new Integer(1), new OctetString(bin2hex($this->d())), new ExplicitlyTaggedObject(0, new ObjectIdentifier($this->getCurveOid())), new ExplicitlyTaggedObject(2, new BitString(bin2hex($this->getUncompressedCoordinates()))));
             return $this->pem('EC PRIVATE KEY', $der->getBinary());
         }
         $der = new Sequence(new Sequence(new ObjectIdentifier('1.2.840.10045.2.1'), new ObjectIdentifier($this->getCurveOid())), new BitString(bin2hex($this->getUncompressedCoordinates())));

424) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:149    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $der = new Sequence(new Sequence(new ObjectIdentifier('1.2.840.10045.2.1'), new ObjectIdentifier($this->getCurveOid())), new BitString(bin2hex($this->getUncompressedCoordinates())));
         return $this->pem('PUBLIC KEY', $der->getBinary());
     }
-    public function getUncompressedCoordinates() : string
+    protected function getUncompressedCoordinates() : string
     {
         return "\x04" . $this->x() . $this->y();
     }

425) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:151    [M] Concat

--- Original
+++ New
@@ @@
     }
     public function getUncompressedCoordinates() : string
     {
-        return "\x04" . $this->x() . $this->y();
+        return $this->x() . "\x04" . $this->y();
     }
     private function getCurveOid() : string
     {

426) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:151    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     }
     public function getUncompressedCoordinates() : string
     {
-        return "\x04" . $this->x() . $this->y();
+        return $this->x() . $this->y();
     }
     private function getCurveOid() : string
     {

427) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:151    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     }
     public function getUncompressedCoordinates() : string
     {
-        return "\x04" . $this->x() . $this->y();
+        return "\x04" . $this->y();
     }
     private function getCurveOid() : string
     {

428) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:151    [M] Concat

--- Original
+++ New
@@ @@
     }
     public function getUncompressedCoordinates() : string
     {
-        return "\x04" . $this->x() . $this->y();
+        return "\x04" . $this->y() . $this->x();
     }
     private function getCurveOid() : string
     {

429) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:151    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     }
     public function getUncompressedCoordinates() : string
     {
-        return "\x04" . $this->x() . $this->y();
+        return "\x04" . $this->x();
     }
     private function getCurveOid() : string
     {

430) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:161    [M] MBString

--- Original
+++ New
@@ @@
     }
     private function pem(string $type, string $der) : string
     {
-        return sprintf("-----BEGIN %s-----\n", mb_strtoupper($type)) . chunk_split(base64_encode($der), 64, "\n") . sprintf("-----END %s-----\n", mb_strtoupper($type));
+        return sprintf("-----BEGIN %s-----\n", strtoupper($type)) . chunk_split(base64_encode($der), 64, "\n") . sprintf("-----END %s-----\n", mb_strtoupper($type));
     }
 }

431) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:161    [M] Concat

--- Original
+++ New
@@ @@
     }
     private function pem(string $type, string $der) : string
     {
-        return sprintf("-----BEGIN %s-----\n", mb_strtoupper($type)) . chunk_split(base64_encode($der), 64, "\n") . sprintf("-----END %s-----\n", mb_strtoupper($type));
+        return chunk_split(base64_encode($der), 64, "\n") . sprintf("-----BEGIN %s-----\n", mb_strtoupper($type)) . sprintf("-----END %s-----\n", mb_strtoupper($type));
     }
 }

432) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:161    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     }
     private function pem(string $type, string $der) : string
     {
-        return sprintf("-----BEGIN %s-----\n", mb_strtoupper($type)) . chunk_split(base64_encode($der), 64, "\n") . sprintf("-----END %s-----\n", mb_strtoupper($type));
+        return chunk_split(base64_encode($der), 64, "\n") . sprintf("-----END %s-----\n", mb_strtoupper($type));
     }
 }

433) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:161    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     }
     private function pem(string $type, string $der) : string
     {
-        return sprintf("-----BEGIN %s-----\n", mb_strtoupper($type)) . chunk_split(base64_encode($der), 64, "\n") . sprintf("-----END %s-----\n", mb_strtoupper($type));
+        return sprintf("-----BEGIN %s-----\n", mb_strtoupper($type)) . sprintf("-----END %s-----\n", mb_strtoupper($type));
     }
 }

434) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:161    [M] Concat

--- Original
+++ New
@@ @@
     }
     private function pem(string $type, string $der) : string
     {
-        return sprintf("-----BEGIN %s-----\n", mb_strtoupper($type)) . chunk_split(base64_encode($der), 64, "\n") . sprintf("-----END %s-----\n", mb_strtoupper($type));
+        return sprintf("-----BEGIN %s-----\n", mb_strtoupper($type)) . sprintf("-----END %s-----\n", mb_strtoupper($type)) . chunk_split(base64_encode($der), 64, "\n");
     }
 }

435) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:161    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     }
     private function pem(string $type, string $der) : string
     {
-        return sprintf("-----BEGIN %s-----\n", mb_strtoupper($type)) . chunk_split(base64_encode($der), 64, "\n") . sprintf("-----END %s-----\n", mb_strtoupper($type));
+        return sprintf("-----BEGIN %s-----\n", mb_strtoupper($type)) . chunk_split(base64_encode($der), 64, "\n");
     }
 }

436) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:162    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     private function pem(string $type, string $der) : string
     {
-        return sprintf("-----BEGIN %s-----\n", mb_strtoupper($type)) . chunk_split(base64_encode($der), 64, "\n") . sprintf("-----END %s-----\n", mb_strtoupper($type));
+        return sprintf("-----BEGIN %s-----\n", mb_strtoupper($type)) . chunk_split(base64_encode($der), 63, "\n") . sprintf("-----END %s-----\n", mb_strtoupper($type));
     }
 }

437) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:162    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     private function pem(string $type, string $der) : string
     {
-        return sprintf("-----BEGIN %s-----\n", mb_strtoupper($type)) . chunk_split(base64_encode($der), 64, "\n") . sprintf("-----END %s-----\n", mb_strtoupper($type));
+        return sprintf("-----BEGIN %s-----\n", mb_strtoupper($type)) . chunk_split(base64_encode($der), 65, "\n") . sprintf("-----END %s-----\n", mb_strtoupper($type));
     }
 }

438) /home/florent/PhpstormProjects/cose-lib/src/Key/Ec2Key.php:163    [M] MBString

--- Original
+++ New
@@ @@
     }
     private function pem(string $type, string $der) : string
     {
-        return sprintf("-----BEGIN %s-----\n", mb_strtoupper($type)) . chunk_split(base64_encode($der), 64, "\n") . sprintf("-----END %s-----\n", mb_strtoupper($type));
+        return sprintf("-----BEGIN %s-----\n", mb_strtoupper($type)) . chunk_split(base64_encode($der), 64, "\n") . sprintf("-----END %s-----\n", strtoupper($type));
     }
 }

439) /home/florent/PhpstormProjects/cose-lib/src/Key/Key.php:47    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @param array<int|string, mixed> $data
      */
-    public static function create(array $data) : self
+    protected static function create(array $data) : self
     {
         return new self($data);
     }

440) /home/florent/PhpstormProjects/cose-lib/src/Key/Key.php:55    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @param array<int, mixed> $data
      */
-    public static function createFromData(array $data) : self
+    protected static function createFromData(array $data) : self
     {
         Assertion::keyExists($data, self::TYPE, 'Invalid key: the type is not defined');
         return match ($data[self::TYPE]) {

442) /home/florent/PhpstormProjects/cose-lib/src/Key/Key.php:73    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->data[self::TYPE];
     }
-    public function alg() : int
+    protected function alg() : int
     {
         return (int) $this->get(self::ALG);
     }

443) /home/florent/PhpstormProjects/cose-lib/src/Key/Key.php:75    [M] CastInt

--- Original
+++ New
@@ @@
     }
     public function alg() : int
     {
-        return (int) $this->get(self::ALG);
+        return $this->get(self::ALG);
     }
     /**
      * @return array<int|string, mixed>

452) /home/florent/PhpstormProjects/cose-lib/src/Key/RsaKey.php:49    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function __construct(array $data)
     {
         parent::__construct($data);
-        Assertion::eq($data[self::TYPE], self::TYPE_RSA, 'Invalid RSA key. The key type does not correspond to a RSA key');
+        
         Assertion::keyExists($data, self::DATA_N, 'Invalid RSA key. The modulus is missing');
         Assertion::keyExists($data, self::DATA_E, 'Invalid RSA key. The exponent is missing');
     }

453) /home/florent/PhpstormProjects/cose-lib/src/Key/RsaKey.php:54    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         parent::__construct($data);
         Assertion::eq($data[self::TYPE], self::TYPE_RSA, 'Invalid RSA key. The key type does not correspond to a RSA key');
-        Assertion::keyExists($data, self::DATA_N, 'Invalid RSA key. The modulus is missing');
+        
         Assertion::keyExists($data, self::DATA_E, 'Invalid RSA key. The exponent is missing');
     }
     /**

454) /home/florent/PhpstormProjects/cose-lib/src/Key/RsaKey.php:55    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         parent::__construct($data);
         Assertion::eq($data[self::TYPE], self::TYPE_RSA, 'Invalid RSA key. The key type does not correspond to a RSA key');
         Assertion::keyExists($data, self::DATA_N, 'Invalid RSA key. The modulus is missing');
-        Assertion::keyExists($data, self::DATA_E, 'Invalid RSA key. The exponent is missing');
+        
     }
     /**
      * @param array<int|string, mixed> $data

455) /home/florent/PhpstormProjects/cose-lib/src/Key/RsaKey.php:66    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return new self($data);
     }
-    public function n() : string
+    protected function n() : string
     {
         return $this->get(self::DATA_N);
     }

456) /home/florent/PhpstormProjects/cose-lib/src/Key/RsaKey.php:71    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->get(self::DATA_N);
     }
-    public function e() : string
+    protected function e() : string
     {
         return $this->get(self::DATA_E);
     }

458) /home/florent/PhpstormProjects/cose-lib/src/Key/RsaKey.php:78    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function d() : string
     {
-        Assertion::true($this->isPrivate(), 'The key is not private.');
+        
         return $this->get(self::DATA_D);
     }
     public function p() : string

459) /home/florent/PhpstormProjects/cose-lib/src/Key/RsaKey.php:83    [M] PublicVisibility

--- Original
+++ New
@@ @@
         Assertion::true($this->isPrivate(), 'The key is not private.');
         return $this->get(self::DATA_D);
     }
-    public function p() : string
+    protected function p() : string
     {
         Assertion::true($this->isPrivate(), 'The key is not private.');
         return $this->get(self::DATA_P);

461) /home/florent/PhpstormProjects/cose-lib/src/Key/RsaKey.php:90    [M] PublicVisibility

--- Original
+++ New
@@ @@
         Assertion::true($this->isPrivate(), 'The key is not private.');
         return $this->get(self::DATA_P);
     }
-    public function q() : string
+    protected function q() : string
     {
         Assertion::true($this->isPrivate(), 'The key is not private.');
         return $this->get(self::DATA_Q);

463) /home/florent/PhpstormProjects/cose-lib/src/Key/RsaKey.php:97    [M] PublicVisibility

--- Original
+++ New
@@ @@
         Assertion::true($this->isPrivate(), 'The key is not private.');
         return $this->get(self::DATA_Q);
     }
-    public function dP() : string
+    protected function dP() : string
     {
         Assertion::true($this->isPrivate(), 'The key is not private.');
         return $this->get(self::DATA_DP);

465) /home/florent/PhpstormProjects/cose-lib/src/Key/RsaKey.php:104    [M] PublicVisibility

--- Original
+++ New
@@ @@
         Assertion::true($this->isPrivate(), 'The key is not private.');
         return $this->get(self::DATA_DP);
     }
-    public function dQ() : string
+    protected function dQ() : string
     {
         Assertion::true($this->isPrivate(), 'The key is not private.');
         return $this->get(self::DATA_DQ);

467) /home/florent/PhpstormProjects/cose-lib/src/Key/RsaKey.php:111    [M] PublicVisibility

--- Original
+++ New
@@ @@
         Assertion::true($this->isPrivate(), 'The key is not private.');
         return $this->get(self::DATA_DQ);
     }
-    public function QInv() : string
+    protected function QInv() : string
     {
         Assertion::true($this->isPrivate(), 'The key is not private.');
         return $this->get(self::DATA_QI);

469) /home/florent/PhpstormProjects/cose-lib/src/Key/RsaKey.php:121    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @return array<mixed>
      */
-    public function other() : array
+    protected function other() : array
     {
         Assertion::true($this->isPrivate(), 'The key is not private.');
         return $this->get(self::DATA_OTHER);
