471) /home/florent/PhpstormProjects/cose-lib/src/Key/RsaKey.php:128    [M] PublicVisibility

--- Original
+++ New
@@ @@
         Assertion::true($this->isPrivate(), 'The key is not private.');
         return $this->get(self::DATA_OTHER);
     }
-    public function rI() : string
+    protected function rI() : string
     {
         Assertion::true($this->isPrivate(), 'The key is not private.');
         return $this->get(self::DATA_RI);

473) /home/florent/PhpstormProjects/cose-lib/src/Key/RsaKey.php:135    [M] PublicVisibility

--- Original
+++ New
@@ @@
         Assertion::true($this->isPrivate(), 'The key is not private.');
         return $this->get(self::DATA_RI);
     }
-    public function dI() : string
+    protected function dI() : string
     {
         Assertion::true($this->isPrivate(), 'The key is not private.');
         return $this->get(self::DATA_DI);

475) /home/florent/PhpstormProjects/cose-lib/src/Key/RsaKey.php:142    [M] PublicVisibility

--- Original
+++ New
@@ @@
         Assertion::true($this->isPrivate(), 'The key is not private.');
         return $this->get(self::DATA_DI);
     }
-    public function tI() : string
+    protected function tI() : string
     {
         Assertion::true($this->isPrivate(), 'The key is not private.');
         return $this->get(self::DATA_TI);

477) /home/florent/PhpstormProjects/cose-lib/src/Key/RsaKey.php:149    [M] PublicVisibility

--- Original
+++ New
@@ @@
         Assertion::true($this->isPrivate(), 'The key is not private.');
         return $this->get(self::DATA_TI);
     }
-    public function hasPrimes() : bool
+    protected function hasPrimes() : bool
     {
         return $this->has(self::DATA_P) && $this->has(self::DATA_Q);
     }

478) /home/florent/PhpstormProjects/cose-lib/src/Key/RsaKey.php:151    [M] LogicalAnd

--- Original
+++ New
@@ @@
     }
     public function hasPrimes() : bool
     {
-        return $this->has(self::DATA_P) && $this->has(self::DATA_Q);
+        return $this->has(self::DATA_P) || $this->has(self::DATA_Q);
     }
     /**
      * @return string[]

479) /home/florent/PhpstormProjects/cose-lib/src/Key/RsaKey.php:157    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @return string[]
      */
-    public function primes() : array
+    protected function primes() : array
     {
         return [$this->p(), $this->q()];
     }

480) /home/florent/PhpstormProjects/cose-lib/src/Key/RsaKey.php:159    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function primes() : array
     {
-        return [$this->p(), $this->q()];
+        return [$this->q()];
     }
     public function hasExponents() : bool
     {

481) /home/florent/PhpstormProjects/cose-lib/src/Key/RsaKey.php:162    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return [$this->p(), $this->q()];
     }
-    public function hasExponents() : bool
+    protected function hasExponents() : bool
     {
         return $this->has(self::DATA_DP) && $this->has(self::DATA_DQ);
     }

482) /home/florent/PhpstormProjects/cose-lib/src/Key/RsaKey.php:164    [M] LogicalAnd

--- Original
+++ New
@@ @@
     }
     public function hasExponents() : bool
     {
-        return $this->has(self::DATA_DP) && $this->has(self::DATA_DQ);
+        return $this->has(self::DATA_DP) || $this->has(self::DATA_DQ);
     }
     /**
      * @return string[]

483) /home/florent/PhpstormProjects/cose-lib/src/Key/RsaKey.php:170    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @return string[]
      */
-    public function exponents() : array
+    protected function exponents() : array
     {
         return [$this->dP(), $this->dQ()];
     }

484) /home/florent/PhpstormProjects/cose-lib/src/Key/RsaKey.php:172    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function exponents() : array
     {
-        return [$this->dP(), $this->dQ()];
+        return [$this->dQ()];
     }
     public function hasCoefficient() : bool
     {

485) /home/florent/PhpstormProjects/cose-lib/src/Key/RsaKey.php:175    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return [$this->dP(), $this->dQ()];
     }
-    public function hasCoefficient() : bool
+    protected function hasCoefficient() : bool
     {
         return $this->has(self::DATA_QI);
     }

486) /home/florent/PhpstormProjects/cose-lib/src/Key/RsaKey.php:180    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->has(self::DATA_QI);
     }
-    public function isPublic() : bool
+    protected function isPublic() : bool
     {
         return !$this->isPrivate();
     }

487) /home/florent/PhpstormProjects/cose-lib/src/Key/RsaKey.php:182    [M] LogicalNot

--- Original
+++ New
@@ @@
     }
     public function isPublic() : bool
     {
-        return !$this->isPrivate();
+        return $this->isPrivate();
     }
     public function isPrivate() : bool
     {

489) /home/florent/PhpstormProjects/cose-lib/src/Key/RsaKey.php:190    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return array_key_exists(self::DATA_D, $this->getData());
     }
-    public function asPem() : string
+    protected function asPem() : string
     {
         Assertion::false($this->isPrivate(), 'Unsupported for private keys.');
         $bitSring = new Sequence(new Integer($this->fromBase64ToInteger($this->n())), new Integer($this->fromBase64ToInteger($this->e())));

490) /home/florent/PhpstormProjects/cose-lib/src/Key/RsaKey.php:192    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function asPem() : string
     {
-        Assertion::false($this->isPrivate(), 'Unsupported for private keys.');
+        
         $bitSring = new Sequence(new Integer($this->fromBase64ToInteger($this->n())), new Integer($this->fromBase64ToInteger($this->e())));
         $der = new Sequence(new Sequence(new ObjectIdentifier('1.2.840.113549.1.1.1'), new NullObject()), new BitString(bin2hex($bitSring->getBinary())));
         return $this->pem('PUBLIC KEY', $der->getBinary());

491) /home/florent/PhpstormProjects/cose-lib/src/Key/RsaKey.php:211    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         $data = unpack('H*', $value);
         $hex = current($data);
-        return BigInteger::fromBase($hex, 16)->toBase(10);
+        return BigInteger::fromBase($hex, 15)->toBase(10);
     }
     private function pem(string $type, string $der) : string
     {

492) /home/florent/PhpstormProjects/cose-lib/src/Key/RsaKey.php:211    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         $data = unpack('H*', $value);
         $hex = current($data);
-        return BigInteger::fromBase($hex, 16)->toBase(10);
+        return BigInteger::fromBase($hex, 17)->toBase(10);
     }
     private function pem(string $type, string $der) : string
     {

493) /home/florent/PhpstormProjects/cose-lib/src/Key/RsaKey.php:211    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         $data = unpack('H*', $value);
         $hex = current($data);
-        return BigInteger::fromBase($hex, 16)->toBase(10);
+        return BigInteger::fromBase($hex, 16)->toBase(9);
     }
     private function pem(string $type, string $der) : string
     {

494) /home/florent/PhpstormProjects/cose-lib/src/Key/RsaKey.php:211    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         $data = unpack('H*', $value);
         $hex = current($data);
-        return BigInteger::fromBase($hex, 16)->toBase(10);
+        return BigInteger::fromBase($hex, 16)->toBase(11);
     }
     private function pem(string $type, string $der) : string
     {
